[
    {
        "title": "In India, Apple's iPhone 16e faces stiff competition from older models",
        "publisher": "TechCrunch",
        "publish_date": "2025-02-20 19:20:17",
        "link": "https://finance.yahoo.com/m/57d649f1-9d08-3c12-8930-54f6bcbc5dd8/in-india%2C-apple%27s-iphone-16e.html",
        "type": "STORY",
        "content": "On Wednesday, Apple unveiled the iPhone 16e. The model replaces both the iPhone SE and iPhone 14 in the company's lineup. The new handset is the least expensive member of the iPhone 16 lineup, aiming at emerging markets including India. The world's second largest smartphone market (behind China) has fueled significant iPhone sales, with Apple recently cracking the top five vendors in India. A week ahead of the iPhone 16e's release, however, it's unclear what impact the device will have on this key market. In 2024, India became the fourth largest market for Apple, after the U.S., China, and Japan, seeing a record 12 million shipments during the quarter, with 35% YoY growth, per IDC. It is expected to cross the 15 million milestone this year. But it wasn't the iPhone SE or iPhone 14 that helped the Cupertino company succeed in the South Asian market. In fact, the iPhone 15 and iPhone 13 were the highest shipped models, with a 6% share of overall smartphone market in Q4. Even as Apple has expanded in India, the iPhone SE has seen a proportional decline. The iPhone SE (2020) represented 18% of overall iPhone shipments in its launch year, while the iPhone SE (2022) made up 6% of total shipments two years later, per IDC data shared exclusively with TechCrunch. In contrast, the iPhone 13 made up nearly 40% of iPhone shipments in 2022. According to IDC, iPhone SE shipments in India and globally declined to negligible volume in 2023 and 2024. Neither year saw a new SE release. Navkendar Singh, associate vice president at IDC India, tells TechCrunch that nearly two-thirds of iPhone volumes in India come from previous-generation models. Android dominates India's smartphone market, with an average smartphone of $259. Chinese brands such as Vivo, Oppo, and Xiaomi have made great strides in the market. However, the iPhone is still top dog in the $600+ market segment, followed by Samsung Galaxy smartphones. This means, in essence, that the iPhone's biggest competitor is other iPhones. The iPhone 16e starts at 59,900 Indian rupees (~$689) and goes up to $1,034. In contrast, the older iPhone 15 starts at $804 and iPhone 16 at $919. In a market like India, where older devices continue to sell, the price difference may not be enough to justify choosing the iPhone 16e over, say, the iPhone 15 given the features the budget phone sacrifices. What new features the 16e does offer may not be substantial enough to attract new buyers, given the popularity of the equated monthly installment (EMI) option, which allows users to purchase a high ticket item via installment payments. Roughly half of customers purchasing a premium handset in India ($400-700) opt to finance their devices this way. \"With EMI offers, the difference in real terms would make many prefer the iPhone 15 or 16 over the iPhone 16Ee\" Singh said. Apple has expanded Apple Intelligence to a more affordable segment with the iPhone 16e. This could help the company drive more Apple Services revenues over time. However, Apple Intelligence is currently in its infancy and in the U.S. and won't arrive in India until April. The 16e is Apple's latest iPhone to be assembled in India — alongside the other iPhone 16 models. However, local assembly isn't likely to impact the pricing — at least in the short term. Sanyam Chaurasia, a senior analyst at Canalys, believed that the iPhone 16e might help Apple attract customers who might otherwise pick up an iPhone 12 or 13 -- both of which are still available through retail channels in India. He added that younger users might also opt for the iPhone 16e, rather than the older 15. \"It's a model which serves a niche audience,\" Chaurasia said. Unlike other emerging markets such as Latin America and Southeast Asia, India is not a telco-driven market where carriers subsidize smartphones by bundling them with their plans. This makes the iPhone 16e a relatively expensive option for Indian buyers. The timing of launching the iPhone 16e also makes it less attractive as this is not an upgrade season, which usually falls around Indian festivals in the later part of the year, Chaurasia said. \"Apple is likely to have discounts on the iPhone 16e during the festive season later this year, but there would also be similar discounts on the existing iPhone models, making them even more attractive than this new model,\" he stated. This article originally appeared on TechCrunch at https://techcrunch.com/2025/02/20/in-india-apples-iphone-16e-faces-stiff-competition-from-older-models/"
    },
    {
        "title": "Apple Inc. (AAPL): Among the Best Long-Term Stocks to Buy According to Ken Fisher",
        "publisher": "Insider Monkey",
        "publish_date": "2025-02-20 19:08:30",
        "link": "https://finance.yahoo.com/news/apple-inc-aapl-among-best-180830245.html",
        "type": "STORY",
        "content": "We recently compiled a list of the 12 Best Long-Term Stocks to Buy According to Ken Fisher. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other long-term stocks. Ken Fisher is a prominent American billionaire investment analyst, author, and the founder of Fisher Asset Management, one of the biggest and most successful hedge funds in the world. Fisher was born in California in 1950. His net worth is estimated at over $11.2 billion, ranking him high on the list of richest Americans and global billionaires. Fisher's early life was influenced by his father, Philip A. Fisher, a renowned stock investor. He pursued higher education at California State Polytechnic University, Humboldt, graduating in 1972 with an associate degree in economics. In 1979, Fisher founded Fisher Investments, which has grown into a global financial advisory firm managing close to $252 billion in 13F securities. Read more about these developments by accessing 10 Best AI Data Center Stocks and 10 Buzzing AI Stocks According to Goldman Sachs. Fisher's influence extends beyond asset management. He authored the Portfolio Strategy column in Forbes from 1984 to 2016, making him the longest continuously running columnist in the magazine's history. Currently, he contributes monthly columns to major publications worldwide, including the New York Post, The Daily Telegraph, and The Australian, among others. In addition to his columns, Fisher has authored 11 books on investing, with four becoming New York Times bestsellers. His work has significantly influenced investment strategies and financial planning. Notably, he popularized the price-to-sales ratio as a stock analysis tool and has been involved in groundbreaking work in behavioral finance. Read more about these developments by accessing 30 Most Important AI Stocks According to BlackRock and Beyond the Tech Giants: 35 Non-Tech AI Opportunities. For this article, we selected stocks by combing through the 13F portfolio of Fisher Asset Management at the end of the fourth quarter of 2024. Only the companies that have been in the 13F portfolio of the fund consistently for the past three years were selected. These stocks are also popular among other hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). A wide view of an Apple store, showing the range of products the company offers. Number of Hedge Fund Holders: 166 Fisher Asset Management’s Stake: $14.8 billion Apple Inc. (NASDAQ:AAPL) is a consumer electronics firm. According to the fourth quarter of 2024, strong business performance in the September quarter generated nearly $27 billion in operating cash flow, enabling the company to return over $29 billion to the shareholders. In mid-February, Forbes reported that the company had released a new budget iPhone. The device comes with a price increase from the current $429 and features Apple Intelligence, along with a design similar to the iPhone 14. It is the first iPhone to include Apple’s in-house modem, a project the company has been working on for years. While Qualcomm has supplied modems for previous models and renewed its contract with Apple in September of the prior year, the company is gradually shifting toward its own technology. Overall AAPL ranks 1st on our list of the best long-term stocks to buy according to Ken Fisher. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.  READ NEXT: 20 Best AI Stocks To Buy Now and Complete List of 59 AI Companies Under $2 Billion in Market Cap  Disclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "title": "Alibaba is 'big beneficiary' of AI with partnerships like Apple",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-02-20 19:01:52",
        "link": "https://finance.yahoo.com/video/alibaba-big-beneficiary-ai-partnerships-180152065.html",
        "type": "VIDEO",
        "content": "Alibaba (BABA) shares gain after announcing strong cloud sales in its fiscal third quarter and highlighting its artificial intelligence (AI) related gains. The Chinese e-commerce tech company is also in focus after announcing a partnership with Apple (AAPL) to bring Apple Intelligence features to iPhones in the Chinese market. Manhattan Venture Partners head of research Santosh Rao joins Catalysts Co-Hosts Seana Smith and Madison Mills to discuss why Alibaba stock is \"definitely\" a Buy in his view as \"a big beneficiary\" of AI. \"AI is going to help [Alibaba's] core business,\" the analyst says, explaining, \"They're using it for their advertising for their e-commerce and all that.\" \"AI is a must. Every company has to use that word ... [Alibaba] has partnerships with many key players\" like its new Apple partnership, Rao explains. \"Competitively [the company is] in a good position and needs to keep innovating, which it is, because the competition is right, nipping at their heels.\" To watch more expert insights and analysis on the latest market action, check out more Catalysts here. This post was written by Naomi Buchanan."
    },
    {
        "title": "American Airlines Joins Rivals in Integrating Apple AirTags to Track Lost Bags",
        "publisher": "Investopedia",
        "publish_date": "2025-02-20 18:57:05",
        "link": "https://finance.yahoo.com/m/f7f74cf9-490d-34b4-aa25-a56ef4054956/american-airlines-joins.html",
        "type": "STORY",
        "content": "Joe Raedle / Getty Images  American Airlines passengers who place Apple AirTags in their luggage will be able to submit location information to the airline. The goal is to reduce the amount of time it takes to reunite passengers with delayed bags, an American Airlines spokesperson said. Less than 1% of bags are mishandled, but American was among the worst offenders in November, according to DOT data.  American Airlines (AAL) has introduced a feature that allows customers who place Apple (AAPL) AirTags in their luggage to help the airline track down their lost bags. Passengers can generate a link through Apple's Share Item feature available on iOS 18.2 or later and share it with the airline if a bag is delayed, an American Airlines spokesperson said. Customers are \"usually reunited with their bag in just over a day\" and this integration is designed to reduce that time, the spokesperson said, adding \"that less than 1% of customers' checked bags are mishandled.\" The service is available for trips ending in the U.S., Puerto Rico, and the U.S. Virgin Islands, American said. American joins rivals Delta Air Lines (DAL) and United Airlines (UAL), which integrated AirTag functionality late last year. United and American were the two worst offenders among U.S. carriers in terms of mishandling bags in November, according to the Department of Transportation's Air Travel Consumer Report last month, mishandling 0.54% and 0.53% of bags, respectively. Shares of American Airlines, which slipped 2% to $15.68 intraday Thursday, are up 7% over the past 12 months. Last month, Jefferies analysts raised their price target to $20 from $12, and said the airline \"could see significant surprise to the upside in 2025.”\" Read the original article on Investopedia"
    },
    {
        "title": "Apple Speeds Up Hardware Shift, Phases Out Broadcom Wi-Fi Chips in iPhone 17",
        "publisher": "GuruFocus.com",
        "publish_date": "2025-02-20 18:42:36",
        "link": "https://finance.yahoo.com/news/apple-speeds-hardware-shift-phases-174236151.html",
        "type": "STORY",
        "content": "Apple (NASDAQ:AAPL) is moving faster toward replacing third-party hardware with its own, according to TF International Securities analyst Ming-Chi Kuo. The company now plans to use in-house Wi-Fi chips in all iPhone 17 models, phasing out chips from Broadcom (NASDAQ:AVGO). This follows Apple's confirmation on Wednesday that its upcoming iPhone 16e will feature an in-house modem chip, the C1, instead of relying on Qualcomm (NASDAQ:QCOM). Qualcomm has supplied Apple's modem chips for more than a decade. \"Following Qualcomm, Broadcom's Wi-Fi chips will also be replaced by Apple's in-house chips at a faster pace,\" Kuo posted on X Thursday. His latest research suggests that while only the slim iPhone 17 model will use Apple's C1 modem, all iPhone 17 models will feature Apple's in-house Wi-Fi chips. Beyond cost savings, Kuo noted the switch would enhance connectivity across Apple devices. However, Apple's shift to its own chips doesn't mean third-party suppliers are entirely out. Many of these components are already patented, and Apple continues to operate under licensing agreements. For instance, even though Apple is moving away from Qualcomm's modems, Qualcomm still earns royalties through a patent deal. This article first appeared on GuruFocus."
    },
    {
        "title": "What Wall Street experts are saying about Alibaba ahead of earnings",
        "publisher": "TipRanks",
        "publish_date": "2025-02-20 18:15:10",
        "link": "https://finance.yahoo.com/news/wall-street-experts-saying-alibaba-171510231.html",
        "type": "STORY",
        "content": "Alibaba Group (BABA) is scheduled to report results of its fiscal third quarter of FY24 before the U.S. market opens on Thursday, February 20, and will hold a conference call to discuss the results at 7:30 a.m. U.S. Eastern Time the same day. What to watch for: See what stocks are receiving strong buy ratings from top-rated analysts. Filter, analyze, and streamline your search for investment opportunities with  TipRanks’ Stock Screener. EXPECTATIONS: Current consensus adjusted EPS and revenue forecasts for Alibaba’s December-end quarter stand at $2.64 and $38.23B, respectively, according to data from Bloomberg. AI: Along with its last earnings report, Alibaba said growth in its Cloud business accelerated from prior quarters, with revenues from public cloud products growing in double digits and AI-related product revenue delivering triple-digit growth. “We are more confident in our core businesses than ever and will continue to invest in supporting long-term growth,” added Eddie Wu, Chief Executive Officer of Alibaba Group. In late January, Alibaba debuted the latest iteration of its artificial intelligence model, “claiming it surpasses DeepSeek’s AI model across various benchmarks,” wrote The Wall Street Journal‘s Kimberley Kao. “The company stated that Qwen2.5 Max “achieves competitive performance against the top-tier models,” referencing OpenAI’s GPT-4o, DeepSeek-V3 and Meta’s Llama-3.1-405B, based on its compiled comparison using various benchmark tests,” noted the WSJ story. Afterward, Goldman Sachs reiterated a Buy rating and $117 price target on Alibaba, noting that after three different Chinese AI model launches, Alibaba Cloud announced the launch of its latest multi-modal vision-language model Qwen2.5-VL, which is open source, just like DeepSeek’s Janus-Pro. The firm believes increasingly agile Chinese models and significant improvement in computing cost efficiencies could drive further room for wider adoption/exploration/proliferation of AI applications and potential for further global expansion for Chinese players. Goldman added that the stock’s then-current market cap had already priced in the unfavorable e-commerce competition. The buzz around DeepSeek, a Chinese-built large-language open-source model that claims to rival offerings from OpenAI’s ChatGPT and Meta Platforms (META) but using a much smaller budget, sent several technology stocks tumbling on January 27. DeepSeek’s new AI model was being praised for being cost-effective and capable of running on less-advanced chips, which raised questions about the high valuations of companies like Nvidia (NVDA). Jefferies views DeepSeek’s launch “as part of an ongoing evolution, not revolution” and called the selloff in software stocks “largely overdone.” Innovations which continue to drive increasing efficiency at inference, but also training, will further improve the return on investment of artificial intelligence, leading to faster software adoption, the analyst argued. Inference efficiency is part of an ongoing trend with DeepSeek and not as incremental as some lead to believe, according to Jefferies. On February 7, Alibaba denied reports that the company plans to invest in DeepSeek, a Chinese-built large-language open-source model that claims to rival offerings from Microsoft-backed (MSFT) OpenAI’s ChatGPT and Meta Platforms but using a much smaller budget, Reuters’ Brenda Goh reported. Citing Chinese news outlet The Paper, Goh said that Yan Qiao, a vice president at Alibaba, wrote on her personal WeChat feed that “as a fellow Chinese and Hangzhou company, we applaud DeepSeek, but news circulating that Alibaba will invest in DeepSeek is fake news.” Previous reports indicated Alibaba planned to invest $1B into DeepSeek. On February 10, after speaking with more than 100 investors over preceding few days, JPMorgan analyst Alex Yao said he sensed an “increasingly positive” sentiment on Alibaba shares, which the firm says was evidenced by a 13% share price rally in the prior five trading days. However, there are still mixed views and positions on the stock, which indicates “room for share price movement on both sides,” the analyst told investors at that time. JPMorgan believes investors are divided on the potential upside from Alibaba’s artificial intelligence initiatives and cloud business. The firm thinks demonstrating a concrete plan for monetizing AI capabilities “could alleviate investor concerns about the sustainability of the current rally.” JPMorgan has an Overweight rating on Alibaba with a $125 price target. APPLE PACT: Earlier this month, Reuters’ Casey Hall reported that Alibaba will partner with Apple (AAPL) to support iPhones’ AI services offering in China, citing confirmation from the Chinese company’s chairman. For Alibaba, the partnership is a major win in China’s competitive AI market that is home to DeepSeek, which made headlines this year with models developed at a fraction of the cost of Western rivals, the author noted. The landmark deal also resolves months of speculation over Apple’s AI strategy in the region as the iPhone maker had been in talks with Chinese tech leaders including Baidu (BIDU), ByteDance and Tencent (TCEHY), Reuters and the Information have reported. After The Information initially reported that Apple partnered with Alibaba to bring Apple Intelligence features to iPhone users in China, Morgan Stanley said that the firm views the pact as “a critical catalyst for Apple’s competitive standing in China.” While acknowledging having no knowledge of Apple’s internal decisions, Alibaba is the largest e-commerce player in China, so it could have “a treasure trove of data that Apple could look to leverage in delivering personalized GenAI features to Chinese consumers,” says the analyst, who adds that the firm could also see a scenario where Apple creates an initial AI partnership with Alibaba that eventually expands to other local Chinese cloud players over time. Meanwhile, BofA analyst Wamsi Mohan noted that Apple’s smartphone share has been pressured in China, and while it was announced last year that Apple was partnering with Baidu for AI in China, Apple ended the project because Baidu’s models developed for Apple Intelligence were not up to Apple’s standards. The Alibaba partnership news shows Apple’s desire to swiftly launch AI features in China, BofA says. SENTIMENT: Among analysts tracked by Bloomberg that have updated their views on Alibaba within the last twelve months, 41 have Buy or equivalent ratings, eight have Hold or equivalent ratings and only one has a Sell or equivalent rating. The average twelve month price target of 30 of those analysts is $124.32. Check out recent Media Buzz Sentiment on Alibaba as measured by TipRanks. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See today’s best-performing stocks on TipRanks >> Read More on BABA: Alibaba price target raised to $125 from $110 at Baird Alibaba (BABA) Shares Climb after Xi Tells Tech Titans He Will Help Them Be “Competitive” Looking for Exposure to RGTI Stock? Try These Two ETFs BIDU Earnings: Baidu Revenues Slide Less than Expected as AI Rivalry Intensifies Alibaba (BABA) Will Report Earnings This Week. Here Is What to Expect"
    },
    {
        "title": "Apple unveils iPhone 16e, Arista reports Q4 beat: Morning Buzz",
        "publisher": "TipRanks",
        "publish_date": "2025-02-20 18:00:59",
        "link": "https://finance.yahoo.com/news/apple-unveils-iphone-16e-arista-170059313.html",
        "type": "STORY",
        "content": "Get caught up quickly on the top news and calls moving stocks with these five Top Five lists. See what stocks are receiving strong buy ratings from top-rated analysts. Filter, analyze, and streamline your search for investment opportunities with  TipRanks’ Stock Screener. 1. STOCK NEWS: Apple (AAPL) announced the iPhone 16e, available starting February 28 Arista Networks (ANET) reported better-than-expected Q4 results and provided upbeat Q1 revenue guidance Howard Hughes (HHH) confirmed receipt of an unsolicited takeover proposal from Pershing Square Analog Devices (ADI) reported upbeat Q1 results, raised its quarterly dividend by 8%, and boosted its share repurchase authorization by $10B Shift4 (FOUR) (GB) for $7.50 per share in cash 2. WALL STREET CALLS: BofA upgraded Capital One (COF) to Buy as it views the company being well positioned to benefit from the pending Discover (DFS) acquisition Mizuho upgraded Glaukos (GKOS) to Outperform Morgan Stanley downgraded Workday (WDAY) to Equal Weight Nomura downgraded Baidu (BIDU) to Neutral DA Davidson initiated coverage of Electronic Arts (EA) with a Neutral rating and Take-Two (TTWO) with a Buy 3. AROUND THE WEB: KKR (KKR) offered to inject $5B into Thames Water for a majority stake, Bloomberg says Milan prosecutors plan to drop a case brought against Google’s (GOOGL) European division after the company agreed to pay $340M to settle a tax claim, Reuters reports Airbnb (ABNB) is suing the City of New Orleans for requiring the company and other short-term rental platforms to ensure the properties they offer are in compliance with city laws, AP News reports Land & Buildings Investment Management is launching a proxy fight at National Health Investors (NHI) and is seeking to oust two board members, WSJ says BP (BP) is said to be weighing a potential sale of its Castrol-branded lubricants unit, which could be worth about $10B, Bloomberg reports 4. MOVERS: Hims & Hers (HIMS) gains after acquiring an at-home lab testing facility ImmunityBio (IBRX) higher after the FDA authorized the company to provide rBCG to urologists amid the shortages Compass (COMP) increases after reporting Q4 results and providing guidance for Q1 and FY25 Cinemark (CNK) and Global-e Online (GLBE) fall after reporting quarterly results Celanese (CE) lower after reporting Q4 results, with EPS and revenue beating consensus 5. EARNINGS/GUIDANCE: Etsy (ETSY) reported Q4 results, with EPS beating consensus Solar Edge (SEDG) reported Q4 results, with CEO Shuki Nir commenting, “We are just getting started on our turnaround story” WingStop (WING) reported Q4 results and provided guidance for FY25 Bumble (BMBL) reported Q4 results and provided guidance for Q1 Capri Holdings (CPRI) provided guidance for FY25 and FY26 INDEXES: Near midday, the Dow was down 0.22%, or 99.90, to 44,456.44, the Nasdaq was down 0.08%, or 15.03, to 20,026.23, and the S&P 500 was up 0.04%, or 2.16, to 6,131.74. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See the top stocks recommended by analysts >> Read More on KKR: KKR offers $5B for majority stake in Thames Water, Bloomberg says KKR clashes with FiberCop over EUR 449M earnings hole, FT says Delta flight crashes in Toronto, Southwest cuts corporate roles: Morning Buzz KKR enters into strategic partnership with EGC KKR enters partnership with EGC"
    },
    {
        "title": "Can the Latest iPhone 16e Push the Apple Stock Higher in 2025?",
        "publisher": "Zacks",
        "publish_date": "2025-02-20 17:32:00",
        "link": "https://finance.yahoo.com/news/latest-iphone-16e-push-apple-163200134.html",
        "type": "STORY",
        "content": "Apple AAPL expanded the iPhone 16 family with the launch of a cheaper iPhone 16e version powered by the latest A18 chip and supporting Apple Intelligence. iPhone 16e features the new Apple C1, the first cellular modem designed by Apple, and a 48MP Fusion camera with an integrated 2x Telephoto option.iPhone 16e is available in a 6.1-inch display size and has the best battery life ever on this display size offered by Apple. The iPhone 16e, available from Feb. 28, will cost $599 compared with $799 for iPhone 16 and $999 for iPhone 16 Pro. The affordable iPhone 16e is expected to boost Apple’s footprint in price-sensitive countries like China and India. Apple has been suffering from sluggish demand for the iPhone in China amid increasing competition from the likes of Huawei and Xiaomi, as well as the lack of Apple Intelligence. Although the iPhone 16e is still way pricier than devices like the Google Pixel 8A and OnePlus 12R, which cost below $500, the availability of Apple Intelligence can be a game changer. Although iPhone sales decreased 0.8% year over year to $69.14 billion in the first quarter of fiscal 2025, Apple saw better iPhone 16 sales in those regions where Apple Intelligence was available. iPhone’s active installed base grew to an all-time high and saw a record level of upgrades in the reported quarter. Per Kantar, the iPhone was a top-selling model in the United States, Urban China, India, the U.K., France, Australia and Japan.Apple launched the first set of Apple Intelligence features in U.S. English for iPhone, iPad and Mac, and introduced more features and expanded to more countries in December. Apple Intelligence is now available in Australia, Canada, New Zealand, South Africa and the U.K. Although Greater China sales decreased 11.1% year over year, Apple benefited from strong sales in a number of emerging markets, including India. In the first quarter of fiscal 2025, the iPhone was the top-selling model in the country. The company saw double-digit growth in the installed base in the emerging markets. Per Canalys’ latest data, Apple benefited from strong sales in emerging markets in the Asia-Pacific region in 2024. AAPL maintained its lead over Samsung for the second consecutive year, with a market share of 23% compared with the latter’s 16%. Xiaomi trailed both Apple and Samsung with 13% market share. According to Canalys, global smartphone shipments increased 7% year over year to $1.22 billion units in 2024. Apple shares have declined 2.3% year to date, underperforming the broader Zacks Computer & Technology sector’s appreciation of 2.1%.  Image Source: Zacks Investment Research  We believe the expanding launch of Apple Intelligence will drive further adoption of iPhone devices. In April, Apple is set to launch the next level of language updates with Apple Intelligence, including French, German, Italian, Portuguese, Spanish, Japanese, Korean, simplified Chinese, and localized English to Singapore and India. AAPL’s Services business is expected to drive top-line growth. It now has more than 1 billion paid subscribers across its Services portfolio, more than double what it had four years ago. The expanding content portfolio of Apple TV+, Apple Music and Apple Arcade, as well as the growing user base of Apple Pay, has helped drive subscriber growth.The Services business benefits from the growing demand for Apple TV+ content and the adoption of Apple Pay. It has expanded Tap to Pay on iPhone to more markets, including the U.A.E., Chile, Japan, Canada, Italy and Germany. Apple Pay is now available in countries like Egypt and Uruguay. The expanding content portfolio of Apple TV+ is noteworthy. Apple expects the March-end quarter’s (second-quarter fiscal 2025) revenues to grow low double digits on a year-over-year basis. The Zacks Consensus Estimate for Apple’s second-quarter fiscal 2025 earnings has declined 4.2% to $1.61 per share over the past 30 days, indicating 5.23% growth from the figure reported in the year-ago quarter.Apple’s earnings beat the Zacks Consensus Estimate in all the trailing four quarters, with the average earnings surprise being 4.39%. Apple Inc. price-consensus-chart | Apple Inc. Quote  Find the latest EPS estimates and surprises on Zacks Earnings Calendar. The AAPL stock is not so cheap, as the Value Score of D suggests a stretched valuation at this moment.Apple is trading at a premium with a forward 12-month P/E of 30.45X compared with the sector’s 26.88X and higher than the median of 29.85X, reflecting a stretched valuation. Image Source: Zacks Investment Research Apple’s AI push with Apple Intelligence is noteworthy. However, it is still playing catch-up with Microsoft MSFT, Alphabet GOOGL and Amazon AMZN.Although the Services business has emerged as AAPL’s new cash cow, with an expanding content portfolio for Apple TV+, we believe that Apple Intelligence will take some time to go mainstream.Hence, we believe that Apple’s near-term growth prospects do not justify a premium valuation.AAPL currently has a Zacks Rank #3 (Hold), suggesting that it may be wise to wait for a more favorable entry point in the stock. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research"
    },
    {
        "title": "In India, Apple's iPhone 16e faces stiff competition from older models",
        "publisher": "TechCrunch",
        "publish_date": "2025-02-20 19:20:17",
        "link": "https://finance.yahoo.com/m/57d649f1-9d08-3c12-8930-54f6bcbc5dd8/in-india%2C-apple%27s-iphone-16e.html",
        "type": "STORY",
        "content": "On Wednesday, Apple unveiled the iPhone 16e. The model replaces both the iPhone SE and iPhone 14 in the company's lineup. The new handset is the least expensive member of the iPhone 16 lineup, aiming at emerging markets including India. The world's second largest smartphone market (behind China) has fueled significant iPhone sales, with Apple recently cracking the top five vendors in India. A week ahead of the iPhone 16e's release, however, it's unclear what impact the device will have on this key market. In 2024, India became the fourth largest market for Apple, after the U.S., China, and Japan, seeing a record 12 million shipments during the quarter, with 35% YoY growth, per IDC. It is expected to cross the 15 million milestone this year. But it wasn't the iPhone SE or iPhone 14 that helped the Cupertino company succeed in the South Asian market. In fact, the iPhone 15 and iPhone 13 were the highest shipped models, with a 6% share of overall smartphone market in Q4. Even as Apple has expanded in India, the iPhone SE has seen a proportional decline. The iPhone SE (2020) represented 18% of overall iPhone shipments in its launch year, while the iPhone SE (2022) made up 6% of total shipments two years later, per IDC data shared exclusively with TechCrunch. In contrast, the iPhone 13 made up nearly 40% of iPhone shipments in 2022. According to IDC, iPhone SE shipments in India and globally declined to negligible volume in 2023 and 2024. Neither year saw a new SE release. Navkendar Singh, associate vice president at IDC India, tells TechCrunch that nearly two-thirds of iPhone volumes in India come from previous-generation models. Android dominates India's smartphone market, with an average smartphone of $259. Chinese brands such as Vivo, Oppo, and Xiaomi have made great strides in the market. However, the iPhone is still top dog in the $600+ market segment, followed by Samsung Galaxy smartphones. This means, in essence, that the iPhone's biggest competitor is other iPhones. The iPhone 16e starts at 59,900 Indian rupees (~$689) and goes up to $1,034. In contrast, the older iPhone 15 starts at $804 and iPhone 16 at $919. In a market like India, where older devices continue to sell, the price difference may not be enough to justify choosing the iPhone 16e over, say, the iPhone 15 given the features the budget phone sacrifices. What new features the 16e does offer may not be substantial enough to attract new buyers, given the popularity of the equated monthly installment (EMI) option, which allows users to purchase a high ticket item via installment payments. Roughly half of customers purchasing a premium handset in India ($400-700) opt to finance their devices this way. \"With EMI offers, the difference in real terms would make many prefer the iPhone 15 or 16 over the iPhone 16Ee\" Singh said. Apple has expanded Apple Intelligence to a more affordable segment with the iPhone 16e. This could help the company drive more Apple Services revenues over time. However, Apple Intelligence is currently in its infancy and in the U.S. and won't arrive in India until April. The 16e is Apple's latest iPhone to be assembled in India — alongside the other iPhone 16 models. However, local assembly isn't likely to impact the pricing — at least in the short term. Sanyam Chaurasia, a senior analyst at Canalys, believed that the iPhone 16e might help Apple attract customers who might otherwise pick up an iPhone 12 or 13 -- both of which are still available through retail channels in India. He added that younger users might also opt for the iPhone 16e, rather than the older 15. \"It's a model which serves a niche audience,\" Chaurasia said. Unlike other emerging markets such as Latin America and Southeast Asia, India is not a telco-driven market where carriers subsidize smartphones by bundling them with their plans. This makes the iPhone 16e a relatively expensive option for Indian buyers. The timing of launching the iPhone 16e also makes it less attractive as this is not an upgrade season, which usually falls around Indian festivals in the later part of the year, Chaurasia said. \"Apple is likely to have discounts on the iPhone 16e during the festive season later this year, but there would also be similar discounts on the existing iPhone models, making them even more attractive than this new model,\" he stated. This article originally appeared on TechCrunch at https://techcrunch.com/2025/02/20/in-india-apples-iphone-16e-faces-stiff-competition-from-older-models/"
    },
    {
        "title": "Apple Inc. (AAPL): Among the Best Long-Term Stocks to Buy According to Ken Fisher",
        "publisher": "Insider Monkey",
        "publish_date": "2025-02-20 19:08:30",
        "link": "https://finance.yahoo.com/news/apple-inc-aapl-among-best-180830245.html",
        "type": "STORY",
        "content": "We recently compiled a list of the 12 Best Long-Term Stocks to Buy According to Ken Fisher. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other long-term stocks. Ken Fisher is a prominent American billionaire investment analyst, author, and the founder of Fisher Asset Management, one of the biggest and most successful hedge funds in the world. Fisher was born in California in 1950. His net worth is estimated at over $11.2 billion, ranking him high on the list of richest Americans and global billionaires. Fisher's early life was influenced by his father, Philip A. Fisher, a renowned stock investor. He pursued higher education at California State Polytechnic University, Humboldt, graduating in 1972 with an associate degree in economics. In 1979, Fisher founded Fisher Investments, which has grown into a global financial advisory firm managing close to $252 billion in 13F securities. Read more about these developments by accessing 10 Best AI Data Center Stocks and 10 Buzzing AI Stocks According to Goldman Sachs. Fisher's influence extends beyond asset management. He authored the Portfolio Strategy column in Forbes from 1984 to 2016, making him the longest continuously running columnist in the magazine's history. Currently, he contributes monthly columns to major publications worldwide, including the New York Post, The Daily Telegraph, and The Australian, among others. In addition to his columns, Fisher has authored 11 books on investing, with four becoming New York Times bestsellers. His work has significantly influenced investment strategies and financial planning. Notably, he popularized the price-to-sales ratio as a stock analysis tool and has been involved in groundbreaking work in behavioral finance. Read more about these developments by accessing 30 Most Important AI Stocks According to BlackRock and Beyond the Tech Giants: 35 Non-Tech AI Opportunities. For this article, we selected stocks by combing through the 13F portfolio of Fisher Asset Management at the end of the fourth quarter of 2024. Only the companies that have been in the 13F portfolio of the fund consistently for the past three years were selected. These stocks are also popular among other hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). A wide view of an Apple store, showing the range of products the company offers. Number of Hedge Fund Holders: 166 Fisher Asset Management’s Stake: $14.8 billion Apple Inc. (NASDAQ:AAPL) is a consumer electronics firm. According to the fourth quarter of 2024, strong business performance in the September quarter generated nearly $27 billion in operating cash flow, enabling the company to return over $29 billion to the shareholders. In mid-February, Forbes reported that the company had released a new budget iPhone. The device comes with a price increase from the current $429 and features Apple Intelligence, along with a design similar to the iPhone 14. It is the first iPhone to include Apple’s in-house modem, a project the company has been working on for years. While Qualcomm has supplied modems for previous models and renewed its contract with Apple in September of the prior year, the company is gradually shifting toward its own technology. Overall AAPL ranks 1st on our list of the best long-term stocks to buy according to Ken Fisher. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.  READ NEXT: 20 Best AI Stocks To Buy Now and Complete List of 59 AI Companies Under $2 Billion in Market Cap  Disclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "title": "Alibaba is 'big beneficiary' of AI with partnerships like Apple",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-02-20 19:01:52",
        "link": "https://finance.yahoo.com/video/alibaba-big-beneficiary-ai-partnerships-180152065.html",
        "type": "VIDEO",
        "content": "Alibaba (BABA) shares gain after announcing strong cloud sales in its fiscal third quarter and highlighting its artificial intelligence (AI) related gains. The Chinese e-commerce tech company is also in focus after announcing a partnership with Apple (AAPL) to bring Apple Intelligence features to iPhones in the Chinese market. Manhattan Venture Partners head of research Santosh Rao joins Catalysts Co-Hosts Seana Smith and Madison Mills to discuss why Alibaba stock is \"definitely\" a Buy in his view as \"a big beneficiary\" of AI. \"AI is going to help [Alibaba's] core business,\" the analyst says, explaining, \"They're using it for their advertising for their e-commerce and all that.\" \"AI is a must. Every company has to use that word ... [Alibaba] has partnerships with many key players\" like its new Apple partnership, Rao explains. \"Competitively [the company is] in a good position and needs to keep innovating, which it is, because the competition is right, nipping at their heels.\" To watch more expert insights and analysis on the latest market action, check out more Catalysts here. This post was written by Naomi Buchanan."
    },
    {
        "title": "American Airlines Joins Rivals in Integrating Apple AirTags to Track Lost Bags",
        "publisher": "Investopedia",
        "publish_date": "2025-02-20 18:57:05",
        "link": "https://finance.yahoo.com/m/f7f74cf9-490d-34b4-aa25-a56ef4054956/american-airlines-joins.html",
        "type": "STORY",
        "content": "Joe Raedle / Getty Images  American Airlines passengers who place Apple AirTags in their luggage will be able to submit location information to the airline. The goal is to reduce the amount of time it takes to reunite passengers with delayed bags, an American Airlines spokesperson said. Less than 1% of bags are mishandled, but American was among the worst offenders in November, according to DOT data.  American Airlines (AAL) has introduced a feature that allows customers who place Apple (AAPL) AirTags in their luggage to help the airline track down their lost bags. Passengers can generate a link through Apple's Share Item feature available on iOS 18.2 or later and share it with the airline if a bag is delayed, an American Airlines spokesperson said. Customers are \"usually reunited with their bag in just over a day\" and this integration is designed to reduce that time, the spokesperson said, adding \"that less than 1% of customers' checked bags are mishandled.\" The service is available for trips ending in the U.S., Puerto Rico, and the U.S. Virgin Islands, American said. American joins rivals Delta Air Lines (DAL) and United Airlines (UAL), which integrated AirTag functionality late last year. United and American were the two worst offenders among U.S. carriers in terms of mishandling bags in November, according to the Department of Transportation's Air Travel Consumer Report last month, mishandling 0.54% and 0.53% of bags, respectively. Shares of American Airlines, which slipped 2% to $15.68 intraday Thursday, are up 7% over the past 12 months. Last month, Jefferies analysts raised their price target to $20 from $12, and said the airline \"could see significant surprise to the upside in 2025.”\" Read the original article on Investopedia"
    },
    {
        "title": "Apple Speeds Up Hardware Shift, Phases Out Broadcom Wi-Fi Chips in iPhone 17",
        "publisher": "GuruFocus.com",
        "publish_date": "2025-02-20 18:42:36",
        "link": "https://finance.yahoo.com/news/apple-speeds-hardware-shift-phases-174236151.html",
        "type": "STORY",
        "content": "Apple (NASDAQ:AAPL) is moving faster toward replacing third-party hardware with its own, according to TF International Securities analyst Ming-Chi Kuo. The company now plans to use in-house Wi-Fi chips in all iPhone 17 models, phasing out chips from Broadcom (NASDAQ:AVGO). This follows Apple's confirmation on Wednesday that its upcoming iPhone 16e will feature an in-house modem chip, the C1, instead of relying on Qualcomm (NASDAQ:QCOM). Qualcomm has supplied Apple's modem chips for more than a decade. \"Following Qualcomm, Broadcom's Wi-Fi chips will also be replaced by Apple's in-house chips at a faster pace,\" Kuo posted on X Thursday. His latest research suggests that while only the slim iPhone 17 model will use Apple's C1 modem, all iPhone 17 models will feature Apple's in-house Wi-Fi chips. Beyond cost savings, Kuo noted the switch would enhance connectivity across Apple devices. However, Apple's shift to its own chips doesn't mean third-party suppliers are entirely out. Many of these components are already patented, and Apple continues to operate under licensing agreements. For instance, even though Apple is moving away from Qualcomm's modems, Qualcomm still earns royalties through a patent deal. This article first appeared on GuruFocus."
    },
    {
        "title": "What Wall Street experts are saying about Alibaba ahead of earnings",
        "publisher": "TipRanks",
        "publish_date": "2025-02-20 18:15:10",
        "link": "https://finance.yahoo.com/news/wall-street-experts-saying-alibaba-171510231.html",
        "type": "STORY",
        "content": "Alibaba Group (BABA) is scheduled to report results of its fiscal third quarter of FY24 before the U.S. market opens on Thursday, February 20, and will hold a conference call to discuss the results at 7:30 a.m. U.S. Eastern Time the same day. What to watch for: See what stocks are receiving strong buy ratings from top-rated analysts. Filter, analyze, and streamline your search for investment opportunities with  TipRanks’ Stock Screener. EXPECTATIONS: Current consensus adjusted EPS and revenue forecasts for Alibaba’s December-end quarter stand at $2.64 and $38.23B, respectively, according to data from Bloomberg. AI: Along with its last earnings report, Alibaba said growth in its Cloud business accelerated from prior quarters, with revenues from public cloud products growing in double digits and AI-related product revenue delivering triple-digit growth. “We are more confident in our core businesses than ever and will continue to invest in supporting long-term growth,” added Eddie Wu, Chief Executive Officer of Alibaba Group. In late January, Alibaba debuted the latest iteration of its artificial intelligence model, “claiming it surpasses DeepSeek’s AI model across various benchmarks,” wrote The Wall Street Journal‘s Kimberley Kao. “The company stated that Qwen2.5 Max “achieves competitive performance against the top-tier models,” referencing OpenAI’s GPT-4o, DeepSeek-V3 and Meta’s Llama-3.1-405B, based on its compiled comparison using various benchmark tests,” noted the WSJ story. Afterward, Goldman Sachs reiterated a Buy rating and $117 price target on Alibaba, noting that after three different Chinese AI model launches, Alibaba Cloud announced the launch of its latest multi-modal vision-language model Qwen2.5-VL, which is open source, just like DeepSeek’s Janus-Pro. The firm believes increasingly agile Chinese models and significant improvement in computing cost efficiencies could drive further room for wider adoption/exploration/proliferation of AI applications and potential for further global expansion for Chinese players. Goldman added that the stock’s then-current market cap had already priced in the unfavorable e-commerce competition. The buzz around DeepSeek, a Chinese-built large-language open-source model that claims to rival offerings from OpenAI’s ChatGPT and Meta Platforms (META) but using a much smaller budget, sent several technology stocks tumbling on January 27. DeepSeek’s new AI model was being praised for being cost-effective and capable of running on less-advanced chips, which raised questions about the high valuations of companies like Nvidia (NVDA). Jefferies views DeepSeek’s launch “as part of an ongoing evolution, not revolution” and called the selloff in software stocks “largely overdone.” Innovations which continue to drive increasing efficiency at inference, but also training, will further improve the return on investment of artificial intelligence, leading to faster software adoption, the analyst argued. Inference efficiency is part of an ongoing trend with DeepSeek and not as incremental as some lead to believe, according to Jefferies. On February 7, Alibaba denied reports that the company plans to invest in DeepSeek, a Chinese-built large-language open-source model that claims to rival offerings from Microsoft-backed (MSFT) OpenAI’s ChatGPT and Meta Platforms but using a much smaller budget, Reuters’ Brenda Goh reported. Citing Chinese news outlet The Paper, Goh said that Yan Qiao, a vice president at Alibaba, wrote on her personal WeChat feed that “as a fellow Chinese and Hangzhou company, we applaud DeepSeek, but news circulating that Alibaba will invest in DeepSeek is fake news.” Previous reports indicated Alibaba planned to invest $1B into DeepSeek. On February 10, after speaking with more than 100 investors over preceding few days, JPMorgan analyst Alex Yao said he sensed an “increasingly positive” sentiment on Alibaba shares, which the firm says was evidenced by a 13% share price rally in the prior five trading days. However, there are still mixed views and positions on the stock, which indicates “room for share price movement on both sides,” the analyst told investors at that time. JPMorgan believes investors are divided on the potential upside from Alibaba’s artificial intelligence initiatives and cloud business. The firm thinks demonstrating a concrete plan for monetizing AI capabilities “could alleviate investor concerns about the sustainability of the current rally.” JPMorgan has an Overweight rating on Alibaba with a $125 price target. APPLE PACT: Earlier this month, Reuters’ Casey Hall reported that Alibaba will partner with Apple (AAPL) to support iPhones’ AI services offering in China, citing confirmation from the Chinese company’s chairman. For Alibaba, the partnership is a major win in China’s competitive AI market that is home to DeepSeek, which made headlines this year with models developed at a fraction of the cost of Western rivals, the author noted. The landmark deal also resolves months of speculation over Apple’s AI strategy in the region as the iPhone maker had been in talks with Chinese tech leaders including Baidu (BIDU), ByteDance and Tencent (TCEHY), Reuters and the Information have reported. After The Information initially reported that Apple partnered with Alibaba to bring Apple Intelligence features to iPhone users in China, Morgan Stanley said that the firm views the pact as “a critical catalyst for Apple’s competitive standing in China.” While acknowledging having no knowledge of Apple’s internal decisions, Alibaba is the largest e-commerce player in China, so it could have “a treasure trove of data that Apple could look to leverage in delivering personalized GenAI features to Chinese consumers,” says the analyst, who adds that the firm could also see a scenario where Apple creates an initial AI partnership with Alibaba that eventually expands to other local Chinese cloud players over time. Meanwhile, BofA analyst Wamsi Mohan noted that Apple’s smartphone share has been pressured in China, and while it was announced last year that Apple was partnering with Baidu for AI in China, Apple ended the project because Baidu’s models developed for Apple Intelligence were not up to Apple’s standards. The Alibaba partnership news shows Apple’s desire to swiftly launch AI features in China, BofA says. SENTIMENT: Among analysts tracked by Bloomberg that have updated their views on Alibaba within the last twelve months, 41 have Buy or equivalent ratings, eight have Hold or equivalent ratings and only one has a Sell or equivalent rating. The average twelve month price target of 30 of those analysts is $124.32. Check out recent Media Buzz Sentiment on Alibaba as measured by TipRanks. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See today’s best-performing stocks on TipRanks >> Read More on BABA: Alibaba price target raised to $125 from $110 at Baird Alibaba (BABA) Shares Climb after Xi Tells Tech Titans He Will Help Them Be “Competitive” Looking for Exposure to RGTI Stock? Try These Two ETFs BIDU Earnings: Baidu Revenues Slide Less than Expected as AI Rivalry Intensifies Alibaba (BABA) Will Report Earnings This Week. Here Is What to Expect"
    },
    {
        "title": "Apple unveils iPhone 16e, Arista reports Q4 beat: Morning Buzz",
        "publisher": "TipRanks",
        "publish_date": "2025-02-20 18:00:59",
        "link": "https://finance.yahoo.com/news/apple-unveils-iphone-16e-arista-170059313.html",
        "type": "STORY",
        "content": "Get caught up quickly on the top news and calls moving stocks with these five Top Five lists. See what stocks are receiving strong buy ratings from top-rated analysts. Filter, analyze, and streamline your search for investment opportunities with  TipRanks’ Stock Screener. 1. STOCK NEWS: Apple (AAPL) announced the iPhone 16e, available starting February 28 Arista Networks (ANET) reported better-than-expected Q4 results and provided upbeat Q1 revenue guidance Howard Hughes (HHH) confirmed receipt of an unsolicited takeover proposal from Pershing Square Analog Devices (ADI) reported upbeat Q1 results, raised its quarterly dividend by 8%, and boosted its share repurchase authorization by $10B Shift4 (FOUR) (GB) for $7.50 per share in cash 2. WALL STREET CALLS: BofA upgraded Capital One (COF) to Buy as it views the company being well positioned to benefit from the pending Discover (DFS) acquisition Mizuho upgraded Glaukos (GKOS) to Outperform Morgan Stanley downgraded Workday (WDAY) to Equal Weight Nomura downgraded Baidu (BIDU) to Neutral DA Davidson initiated coverage of Electronic Arts (EA) with a Neutral rating and Take-Two (TTWO) with a Buy 3. AROUND THE WEB: KKR (KKR) offered to inject $5B into Thames Water for a majority stake, Bloomberg says Milan prosecutors plan to drop a case brought against Google’s (GOOGL) European division after the company agreed to pay $340M to settle a tax claim, Reuters reports Airbnb (ABNB) is suing the City of New Orleans for requiring the company and other short-term rental platforms to ensure the properties they offer are in compliance with city laws, AP News reports Land & Buildings Investment Management is launching a proxy fight at National Health Investors (NHI) and is seeking to oust two board members, WSJ says BP (BP) is said to be weighing a potential sale of its Castrol-branded lubricants unit, which could be worth about $10B, Bloomberg reports 4. MOVERS: Hims & Hers (HIMS) gains after acquiring an at-home lab testing facility ImmunityBio (IBRX) higher after the FDA authorized the company to provide rBCG to urologists amid the shortages Compass (COMP) increases after reporting Q4 results and providing guidance for Q1 and FY25 Cinemark (CNK) and Global-e Online (GLBE) fall after reporting quarterly results Celanese (CE) lower after reporting Q4 results, with EPS and revenue beating consensus 5. EARNINGS/GUIDANCE: Etsy (ETSY) reported Q4 results, with EPS beating consensus Solar Edge (SEDG) reported Q4 results, with CEO Shuki Nir commenting, “We are just getting started on our turnaround story” WingStop (WING) reported Q4 results and provided guidance for FY25 Bumble (BMBL) reported Q4 results and provided guidance for Q1 Capri Holdings (CPRI) provided guidance for FY25 and FY26 INDEXES: Near midday, the Dow was down 0.22%, or 99.90, to 44,456.44, the Nasdaq was down 0.08%, or 15.03, to 20,026.23, and the S&P 500 was up 0.04%, or 2.16, to 6,131.74. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See the top stocks recommended by analysts >> Read More on KKR: KKR offers $5B for majority stake in Thames Water, Bloomberg says KKR clashes with FiberCop over EUR 449M earnings hole, FT says Delta flight crashes in Toronto, Southwest cuts corporate roles: Morning Buzz KKR enters into strategic partnership with EGC KKR enters partnership with EGC"
    },
    {
        "title": "Can the Latest iPhone 16e Push the Apple Stock Higher in 2025?",
        "publisher": "Zacks",
        "publish_date": "2025-02-20 17:32:00",
        "link": "https://finance.yahoo.com/news/latest-iphone-16e-push-apple-163200134.html",
        "type": "STORY",
        "content": "Apple AAPL expanded the iPhone 16 family with the launch of a cheaper iPhone 16e version powered by the latest A18 chip and supporting Apple Intelligence. iPhone 16e features the new Apple C1, the first cellular modem designed by Apple, and a 48MP Fusion camera with an integrated 2x Telephoto option.iPhone 16e is available in a 6.1-inch display size and has the best battery life ever on this display size offered by Apple. The iPhone 16e, available from Feb. 28, will cost $599 compared with $799 for iPhone 16 and $999 for iPhone 16 Pro. The affordable iPhone 16e is expected to boost Apple’s footprint in price-sensitive countries like China and India. Apple has been suffering from sluggish demand for the iPhone in China amid increasing competition from the likes of Huawei and Xiaomi, as well as the lack of Apple Intelligence. Although the iPhone 16e is still way pricier than devices like the Google Pixel 8A and OnePlus 12R, which cost below $500, the availability of Apple Intelligence can be a game changer. Although iPhone sales decreased 0.8% year over year to $69.14 billion in the first quarter of fiscal 2025, Apple saw better iPhone 16 sales in those regions where Apple Intelligence was available. iPhone’s active installed base grew to an all-time high and saw a record level of upgrades in the reported quarter. Per Kantar, the iPhone was a top-selling model in the United States, Urban China, India, the U.K., France, Australia and Japan.Apple launched the first set of Apple Intelligence features in U.S. English for iPhone, iPad and Mac, and introduced more features and expanded to more countries in December. Apple Intelligence is now available in Australia, Canada, New Zealand, South Africa and the U.K. Although Greater China sales decreased 11.1% year over year, Apple benefited from strong sales in a number of emerging markets, including India. In the first quarter of fiscal 2025, the iPhone was the top-selling model in the country. The company saw double-digit growth in the installed base in the emerging markets. Per Canalys’ latest data, Apple benefited from strong sales in emerging markets in the Asia-Pacific region in 2024. AAPL maintained its lead over Samsung for the second consecutive year, with a market share of 23% compared with the latter’s 16%. Xiaomi trailed both Apple and Samsung with 13% market share. According to Canalys, global smartphone shipments increased 7% year over year to $1.22 billion units in 2024. Apple shares have declined 2.3% year to date, underperforming the broader Zacks Computer & Technology sector’s appreciation of 2.1%.  Image Source: Zacks Investment Research  We believe the expanding launch of Apple Intelligence will drive further adoption of iPhone devices. In April, Apple is set to launch the next level of language updates with Apple Intelligence, including French, German, Italian, Portuguese, Spanish, Japanese, Korean, simplified Chinese, and localized English to Singapore and India. AAPL’s Services business is expected to drive top-line growth. It now has more than 1 billion paid subscribers across its Services portfolio, more than double what it had four years ago. The expanding content portfolio of Apple TV+, Apple Music and Apple Arcade, as well as the growing user base of Apple Pay, has helped drive subscriber growth.The Services business benefits from the growing demand for Apple TV+ content and the adoption of Apple Pay. It has expanded Tap to Pay on iPhone to more markets, including the U.A.E., Chile, Japan, Canada, Italy and Germany. Apple Pay is now available in countries like Egypt and Uruguay. The expanding content portfolio of Apple TV+ is noteworthy. Apple expects the March-end quarter’s (second-quarter fiscal 2025) revenues to grow low double digits on a year-over-year basis. The Zacks Consensus Estimate for Apple’s second-quarter fiscal 2025 earnings has declined 4.2% to $1.61 per share over the past 30 days, indicating 5.23% growth from the figure reported in the year-ago quarter.Apple’s earnings beat the Zacks Consensus Estimate in all the trailing four quarters, with the average earnings surprise being 4.39%. Apple Inc. price-consensus-chart | Apple Inc. Quote  Find the latest EPS estimates and surprises on Zacks Earnings Calendar. The AAPL stock is not so cheap, as the Value Score of D suggests a stretched valuation at this moment.Apple is trading at a premium with a forward 12-month P/E of 30.45X compared with the sector’s 26.88X and higher than the median of 29.85X, reflecting a stretched valuation. Image Source: Zacks Investment Research Apple’s AI push with Apple Intelligence is noteworthy. However, it is still playing catch-up with Microsoft MSFT, Alphabet GOOGL and Amazon AMZN.Although the Services business has emerged as AAPL’s new cash cow, with an expanding content portfolio for Apple TV+, we believe that Apple Intelligence will take some time to go mainstream.Hence, we believe that Apple’s near-term growth prospects do not justify a premium valuation.AAPL currently has a Zacks Rank #3 (Hold), suggesting that it may be wise to wait for a more favorable entry point in the stock. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research"
    },
    {
        "title": "In India, Apple's iPhone 16e faces stiff competition from older models",
        "publisher": "TechCrunch",
        "publish_date": "2025-02-20 19:20:17",
        "link": "https://finance.yahoo.com/m/57d649f1-9d08-3c12-8930-54f6bcbc5dd8/in-india%2C-apple%27s-iphone-16e.html",
        "type": "STORY",
        "content": "On Wednesday, Apple unveiled the iPhone 16e. The model replaces both the iPhone SE and iPhone 14 in the company's lineup. The new handset is the least expensive member of the iPhone 16 lineup, aiming at emerging markets including India. The world's second largest smartphone market (behind China) has fueled significant iPhone sales, with Apple recently cracking the top five vendors in India. A week ahead of the iPhone 16e's release, however, it's unclear what impact the device will have on this key market. In 2024, India became the fourth largest market for Apple, after the U.S., China, and Japan, seeing a record 12 million shipments during the quarter, with 35% YoY growth, per IDC. It is expected to cross the 15 million milestone this year. But it wasn't the iPhone SE or iPhone 14 that helped the Cupertino company succeed in the South Asian market. In fact, the iPhone 15 and iPhone 13 were the highest shipped models, with a 6% share of overall smartphone market in Q4. Even as Apple has expanded in India, the iPhone SE has seen a proportional decline. The iPhone SE (2020) represented 18% of overall iPhone shipments in its launch year, while the iPhone SE (2022) made up 6% of total shipments two years later, per IDC data shared exclusively with TechCrunch. In contrast, the iPhone 13 made up nearly 40% of iPhone shipments in 2022. According to IDC, iPhone SE shipments in India and globally declined to negligible volume in 2023 and 2024. Neither year saw a new SE release. Navkendar Singh, associate vice president at IDC India, tells TechCrunch that nearly two-thirds of iPhone volumes in India come from previous-generation models. Android dominates India's smartphone market, with an average smartphone of $259. Chinese brands such as Vivo, Oppo, and Xiaomi have made great strides in the market. However, the iPhone is still top dog in the $600+ market segment, followed by Samsung Galaxy smartphones. This means, in essence, that the iPhone's biggest competitor is other iPhones. The iPhone 16e starts at 59,900 Indian rupees (~$689) and goes up to $1,034. In contrast, the older iPhone 15 starts at $804 and iPhone 16 at $919. In a market like India, where older devices continue to sell, the price difference may not be enough to justify choosing the iPhone 16e over, say, the iPhone 15 given the features the budget phone sacrifices. What new features the 16e does offer may not be substantial enough to attract new buyers, given the popularity of the equated monthly installment (EMI) option, which allows users to purchase a high ticket item via installment payments. Roughly half of customers purchasing a premium handset in India ($400-700) opt to finance their devices this way. \"With EMI offers, the difference in real terms would make many prefer the iPhone 15 or 16 over the iPhone 16Ee\" Singh said. Apple has expanded Apple Intelligence to a more affordable segment with the iPhone 16e. This could help the company drive more Apple Services revenues over time. However, Apple Intelligence is currently in its infancy and in the U.S. and won't arrive in India until April. The 16e is Apple's latest iPhone to be assembled in India — alongside the other iPhone 16 models. However, local assembly isn't likely to impact the pricing — at least in the short term. Sanyam Chaurasia, a senior analyst at Canalys, believed that the iPhone 16e might help Apple attract customers who might otherwise pick up an iPhone 12 or 13 -- both of which are still available through retail channels in India. He added that younger users might also opt for the iPhone 16e, rather than the older 15. \"It's a model which serves a niche audience,\" Chaurasia said. Unlike other emerging markets such as Latin America and Southeast Asia, India is not a telco-driven market where carriers subsidize smartphones by bundling them with their plans. This makes the iPhone 16e a relatively expensive option for Indian buyers. The timing of launching the iPhone 16e also makes it less attractive as this is not an upgrade season, which usually falls around Indian festivals in the later part of the year, Chaurasia said. \"Apple is likely to have discounts on the iPhone 16e during the festive season later this year, but there would also be similar discounts on the existing iPhone models, making them even more attractive than this new model,\" he stated. This article originally appeared on TechCrunch at https://techcrunch.com/2025/02/20/in-india-apples-iphone-16e-faces-stiff-competition-from-older-models/"
    },
    {
        "title": "Apple Inc. (AAPL): Among the Best Long-Term Stocks to Buy According to Ken Fisher",
        "publisher": "Insider Monkey",
        "publish_date": "2025-02-20 19:08:30",
        "link": "https://finance.yahoo.com/news/apple-inc-aapl-among-best-180830245.html",
        "type": "STORY",
        "content": "We recently compiled a list of the 12 Best Long-Term Stocks to Buy According to Ken Fisher. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other long-term stocks. Ken Fisher is a prominent American billionaire investment analyst, author, and the founder of Fisher Asset Management, one of the biggest and most successful hedge funds in the world. Fisher was born in California in 1950. His net worth is estimated at over $11.2 billion, ranking him high on the list of richest Americans and global billionaires. Fisher's early life was influenced by his father, Philip A. Fisher, a renowned stock investor. He pursued higher education at California State Polytechnic University, Humboldt, graduating in 1972 with an associate degree in economics. In 1979, Fisher founded Fisher Investments, which has grown into a global financial advisory firm managing close to $252 billion in 13F securities. Read more about these developments by accessing 10 Best AI Data Center Stocks and 10 Buzzing AI Stocks According to Goldman Sachs. Fisher's influence extends beyond asset management. He authored the Portfolio Strategy column in Forbes from 1984 to 2016, making him the longest continuously running columnist in the magazine's history. Currently, he contributes monthly columns to major publications worldwide, including the New York Post, The Daily Telegraph, and The Australian, among others. In addition to his columns, Fisher has authored 11 books on investing, with four becoming New York Times bestsellers. His work has significantly influenced investment strategies and financial planning. Notably, he popularized the price-to-sales ratio as a stock analysis tool and has been involved in groundbreaking work in behavioral finance. Read more about these developments by accessing 30 Most Important AI Stocks According to BlackRock and Beyond the Tech Giants: 35 Non-Tech AI Opportunities. For this article, we selected stocks by combing through the 13F portfolio of Fisher Asset Management at the end of the fourth quarter of 2024. Only the companies that have been in the 13F portfolio of the fund consistently for the past three years were selected. These stocks are also popular among other hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). A wide view of an Apple store, showing the range of products the company offers. Number of Hedge Fund Holders: 166 Fisher Asset Management’s Stake: $14.8 billion Apple Inc. (NASDAQ:AAPL) is a consumer electronics firm. According to the fourth quarter of 2024, strong business performance in the September quarter generated nearly $27 billion in operating cash flow, enabling the company to return over $29 billion to the shareholders. In mid-February, Forbes reported that the company had released a new budget iPhone. The device comes with a price increase from the current $429 and features Apple Intelligence, along with a design similar to the iPhone 14. It is the first iPhone to include Apple’s in-house modem, a project the company has been working on for years. While Qualcomm has supplied modems for previous models and renewed its contract with Apple in September of the prior year, the company is gradually shifting toward its own technology. Overall AAPL ranks 1st on our list of the best long-term stocks to buy according to Ken Fisher. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.  READ NEXT: 20 Best AI Stocks To Buy Now and Complete List of 59 AI Companies Under $2 Billion in Market Cap  Disclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "title": "Alibaba is 'big beneficiary' of AI with partnerships like Apple",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-02-20 19:01:52",
        "link": "https://finance.yahoo.com/video/alibaba-big-beneficiary-ai-partnerships-180152065.html",
        "type": "VIDEO",
        "content": "Alibaba (BABA) shares gain after announcing strong cloud sales in its fiscal third quarter and highlighting its artificial intelligence (AI) related gains. The Chinese e-commerce tech company is also in focus after announcing a partnership with Apple (AAPL) to bring Apple Intelligence features to iPhones in the Chinese market. Manhattan Venture Partners head of research Santosh Rao joins Catalysts Co-Hosts Seana Smith and Madison Mills to discuss why Alibaba stock is \"definitely\" a Buy in his view as \"a big beneficiary\" of AI. \"AI is going to help [Alibaba's] core business,\" the analyst says, explaining, \"They're using it for their advertising for their e-commerce and all that.\" \"AI is a must. Every company has to use that word ... [Alibaba] has partnerships with many key players\" like its new Apple partnership, Rao explains. \"Competitively [the company is] in a good position and needs to keep innovating, which it is, because the competition is right, nipping at their heels.\" To watch more expert insights and analysis on the latest market action, check out more Catalysts here. This post was written by Naomi Buchanan."
    },
    {
        "title": "American Airlines Joins Rivals in Integrating Apple AirTags to Track Lost Bags",
        "publisher": "Investopedia",
        "publish_date": "2025-02-20 18:57:05",
        "link": "https://finance.yahoo.com/m/f7f74cf9-490d-34b4-aa25-a56ef4054956/american-airlines-joins.html",
        "type": "STORY",
        "content": "Joe Raedle / Getty Images  American Airlines passengers who place Apple AirTags in their luggage will be able to submit location information to the airline. The goal is to reduce the amount of time it takes to reunite passengers with delayed bags, an American Airlines spokesperson said. Less than 1% of bags are mishandled, but American was among the worst offenders in November, according to DOT data.  American Airlines (AAL) has introduced a feature that allows customers who place Apple (AAPL) AirTags in their luggage to help the airline track down their lost bags. Passengers can generate a link through Apple's Share Item feature available on iOS 18.2 or later and share it with the airline if a bag is delayed, an American Airlines spokesperson said. Customers are \"usually reunited with their bag in just over a day\" and this integration is designed to reduce that time, the spokesperson said, adding \"that less than 1% of customers' checked bags are mishandled.\" The service is available for trips ending in the U.S., Puerto Rico, and the U.S. Virgin Islands, American said. American joins rivals Delta Air Lines (DAL) and United Airlines (UAL), which integrated AirTag functionality late last year. United and American were the two worst offenders among U.S. carriers in terms of mishandling bags in November, according to the Department of Transportation's Air Travel Consumer Report last month, mishandling 0.54% and 0.53% of bags, respectively. Shares of American Airlines, which slipped 2% to $15.68 intraday Thursday, are up 7% over the past 12 months. Last month, Jefferies analysts raised their price target to $20 from $12, and said the airline \"could see significant surprise to the upside in 2025.”\" Read the original article on Investopedia"
    },
    {
        "title": "Apple Speeds Up Hardware Shift, Phases Out Broadcom Wi-Fi Chips in iPhone 17",
        "publisher": "GuruFocus.com",
        "publish_date": "2025-02-20 18:42:36",
        "link": "https://finance.yahoo.com/news/apple-speeds-hardware-shift-phases-174236151.html",
        "type": "STORY",
        "content": "Apple (NASDAQ:AAPL) is moving faster toward replacing third-party hardware with its own, according to TF International Securities analyst Ming-Chi Kuo. The company now plans to use in-house Wi-Fi chips in all iPhone 17 models, phasing out chips from Broadcom (NASDAQ:AVGO). This follows Apple's confirmation on Wednesday that its upcoming iPhone 16e will feature an in-house modem chip, the C1, instead of relying on Qualcomm (NASDAQ:QCOM). Qualcomm has supplied Apple's modem chips for more than a decade. \"Following Qualcomm, Broadcom's Wi-Fi chips will also be replaced by Apple's in-house chips at a faster pace,\" Kuo posted on X Thursday. His latest research suggests that while only the slim iPhone 17 model will use Apple's C1 modem, all iPhone 17 models will feature Apple's in-house Wi-Fi chips. Beyond cost savings, Kuo noted the switch would enhance connectivity across Apple devices. However, Apple's shift to its own chips doesn't mean third-party suppliers are entirely out. Many of these components are already patented, and Apple continues to operate under licensing agreements. For instance, even though Apple is moving away from Qualcomm's modems, Qualcomm still earns royalties through a patent deal. This article first appeared on GuruFocus."
    },
    {
        "title": "What Wall Street experts are saying about Alibaba ahead of earnings",
        "publisher": "TipRanks",
        "publish_date": "2025-02-20 18:15:10",
        "link": "https://finance.yahoo.com/news/wall-street-experts-saying-alibaba-171510231.html",
        "type": "STORY",
        "content": "Alibaba Group (BABA) is scheduled to report results of its fiscal third quarter of FY24 before the U.S. market opens on Thursday, February 20, and will hold a conference call to discuss the results at 7:30 a.m. U.S. Eastern Time the same day. What to watch for: See what stocks are receiving strong buy ratings from top-rated analysts. Filter, analyze, and streamline your search for investment opportunities with  TipRanks’ Stock Screener. EXPECTATIONS: Current consensus adjusted EPS and revenue forecasts for Alibaba’s December-end quarter stand at $2.64 and $38.23B, respectively, according to data from Bloomberg. AI: Along with its last earnings report, Alibaba said growth in its Cloud business accelerated from prior quarters, with revenues from public cloud products growing in double digits and AI-related product revenue delivering triple-digit growth. “We are more confident in our core businesses than ever and will continue to invest in supporting long-term growth,” added Eddie Wu, Chief Executive Officer of Alibaba Group. In late January, Alibaba debuted the latest iteration of its artificial intelligence model, “claiming it surpasses DeepSeek’s AI model across various benchmarks,” wrote The Wall Street Journal‘s Kimberley Kao. “The company stated that Qwen2.5 Max “achieves competitive performance against the top-tier models,” referencing OpenAI’s GPT-4o, DeepSeek-V3 and Meta’s Llama-3.1-405B, based on its compiled comparison using various benchmark tests,” noted the WSJ story. Afterward, Goldman Sachs reiterated a Buy rating and $117 price target on Alibaba, noting that after three different Chinese AI model launches, Alibaba Cloud announced the launch of its latest multi-modal vision-language model Qwen2.5-VL, which is open source, just like DeepSeek’s Janus-Pro. The firm believes increasingly agile Chinese models and significant improvement in computing cost efficiencies could drive further room for wider adoption/exploration/proliferation of AI applications and potential for further global expansion for Chinese players. Goldman added that the stock’s then-current market cap had already priced in the unfavorable e-commerce competition. The buzz around DeepSeek, a Chinese-built large-language open-source model that claims to rival offerings from OpenAI’s ChatGPT and Meta Platforms (META) but using a much smaller budget, sent several technology stocks tumbling on January 27. DeepSeek’s new AI model was being praised for being cost-effective and capable of running on less-advanced chips, which raised questions about the high valuations of companies like Nvidia (NVDA). Jefferies views DeepSeek’s launch “as part of an ongoing evolution, not revolution” and called the selloff in software stocks “largely overdone.” Innovations which continue to drive increasing efficiency at inference, but also training, will further improve the return on investment of artificial intelligence, leading to faster software adoption, the analyst argued. Inference efficiency is part of an ongoing trend with DeepSeek and not as incremental as some lead to believe, according to Jefferies. On February 7, Alibaba denied reports that the company plans to invest in DeepSeek, a Chinese-built large-language open-source model that claims to rival offerings from Microsoft-backed (MSFT) OpenAI’s ChatGPT and Meta Platforms but using a much smaller budget, Reuters’ Brenda Goh reported. Citing Chinese news outlet The Paper, Goh said that Yan Qiao, a vice president at Alibaba, wrote on her personal WeChat feed that “as a fellow Chinese and Hangzhou company, we applaud DeepSeek, but news circulating that Alibaba will invest in DeepSeek is fake news.” Previous reports indicated Alibaba planned to invest $1B into DeepSeek. On February 10, after speaking with more than 100 investors over preceding few days, JPMorgan analyst Alex Yao said he sensed an “increasingly positive” sentiment on Alibaba shares, which the firm says was evidenced by a 13% share price rally in the prior five trading days. However, there are still mixed views and positions on the stock, which indicates “room for share price movement on both sides,” the analyst told investors at that time. JPMorgan believes investors are divided on the potential upside from Alibaba’s artificial intelligence initiatives and cloud business. The firm thinks demonstrating a concrete plan for monetizing AI capabilities “could alleviate investor concerns about the sustainability of the current rally.” JPMorgan has an Overweight rating on Alibaba with a $125 price target. APPLE PACT: Earlier this month, Reuters’ Casey Hall reported that Alibaba will partner with Apple (AAPL) to support iPhones’ AI services offering in China, citing confirmation from the Chinese company’s chairman. For Alibaba, the partnership is a major win in China’s competitive AI market that is home to DeepSeek, which made headlines this year with models developed at a fraction of the cost of Western rivals, the author noted. The landmark deal also resolves months of speculation over Apple’s AI strategy in the region as the iPhone maker had been in talks with Chinese tech leaders including Baidu (BIDU), ByteDance and Tencent (TCEHY), Reuters and the Information have reported. After The Information initially reported that Apple partnered with Alibaba to bring Apple Intelligence features to iPhone users in China, Morgan Stanley said that the firm views the pact as “a critical catalyst for Apple’s competitive standing in China.” While acknowledging having no knowledge of Apple’s internal decisions, Alibaba is the largest e-commerce player in China, so it could have “a treasure trove of data that Apple could look to leverage in delivering personalized GenAI features to Chinese consumers,” says the analyst, who adds that the firm could also see a scenario where Apple creates an initial AI partnership with Alibaba that eventually expands to other local Chinese cloud players over time. Meanwhile, BofA analyst Wamsi Mohan noted that Apple’s smartphone share has been pressured in China, and while it was announced last year that Apple was partnering with Baidu for AI in China, Apple ended the project because Baidu’s models developed for Apple Intelligence were not up to Apple’s standards. The Alibaba partnership news shows Apple’s desire to swiftly launch AI features in China, BofA says. SENTIMENT: Among analysts tracked by Bloomberg that have updated their views on Alibaba within the last twelve months, 41 have Buy or equivalent ratings, eight have Hold or equivalent ratings and only one has a Sell or equivalent rating. The average twelve month price target of 30 of those analysts is $124.32. Check out recent Media Buzz Sentiment on Alibaba as measured by TipRanks. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See today’s best-performing stocks on TipRanks >> Read More on BABA: Alibaba price target raised to $125 from $110 at Baird Alibaba (BABA) Shares Climb after Xi Tells Tech Titans He Will Help Them Be “Competitive” Looking for Exposure to RGTI Stock? Try These Two ETFs BIDU Earnings: Baidu Revenues Slide Less than Expected as AI Rivalry Intensifies Alibaba (BABA) Will Report Earnings This Week. Here Is What to Expect"
    },
    {
        "title": "Apple unveils iPhone 16e, Arista reports Q4 beat: Morning Buzz",
        "publisher": "TipRanks",
        "publish_date": "2025-02-20 18:00:59",
        "link": "https://finance.yahoo.com/news/apple-unveils-iphone-16e-arista-170059313.html",
        "type": "STORY",
        "content": "Get caught up quickly on the top news and calls moving stocks with these five Top Five lists. See what stocks are receiving strong buy ratings from top-rated analysts. Filter, analyze, and streamline your search for investment opportunities with  TipRanks’ Stock Screener. 1. STOCK NEWS: Apple (AAPL) announced the iPhone 16e, available starting February 28 Arista Networks (ANET) reported better-than-expected Q4 results and provided upbeat Q1 revenue guidance Howard Hughes (HHH) confirmed receipt of an unsolicited takeover proposal from Pershing Square Analog Devices (ADI) reported upbeat Q1 results, raised its quarterly dividend by 8%, and boosted its share repurchase authorization by $10B Shift4 (FOUR) (GB) for $7.50 per share in cash 2. WALL STREET CALLS: BofA upgraded Capital One (COF) to Buy as it views the company being well positioned to benefit from the pending Discover (DFS) acquisition Mizuho upgraded Glaukos (GKOS) to Outperform Morgan Stanley downgraded Workday (WDAY) to Equal Weight Nomura downgraded Baidu (BIDU) to Neutral DA Davidson initiated coverage of Electronic Arts (EA) with a Neutral rating and Take-Two (TTWO) with a Buy 3. AROUND THE WEB: KKR (KKR) offered to inject $5B into Thames Water for a majority stake, Bloomberg says Milan prosecutors plan to drop a case brought against Google’s (GOOGL) European division after the company agreed to pay $340M to settle a tax claim, Reuters reports Airbnb (ABNB) is suing the City of New Orleans for requiring the company and other short-term rental platforms to ensure the properties they offer are in compliance with city laws, AP News reports Land & Buildings Investment Management is launching a proxy fight at National Health Investors (NHI) and is seeking to oust two board members, WSJ says BP (BP) is said to be weighing a potential sale of its Castrol-branded lubricants unit, which could be worth about $10B, Bloomberg reports 4. MOVERS: Hims & Hers (HIMS) gains after acquiring an at-home lab testing facility ImmunityBio (IBRX) higher after the FDA authorized the company to provide rBCG to urologists amid the shortages Compass (COMP) increases after reporting Q4 results and providing guidance for Q1 and FY25 Cinemark (CNK) and Global-e Online (GLBE) fall after reporting quarterly results Celanese (CE) lower after reporting Q4 results, with EPS and revenue beating consensus 5. EARNINGS/GUIDANCE: Etsy (ETSY) reported Q4 results, with EPS beating consensus Solar Edge (SEDG) reported Q4 results, with CEO Shuki Nir commenting, “We are just getting started on our turnaround story” WingStop (WING) reported Q4 results and provided guidance for FY25 Bumble (BMBL) reported Q4 results and provided guidance for Q1 Capri Holdings (CPRI) provided guidance for FY25 and FY26 INDEXES: Near midday, the Dow was down 0.22%, or 99.90, to 44,456.44, the Nasdaq was down 0.08%, or 15.03, to 20,026.23, and the S&P 500 was up 0.04%, or 2.16, to 6,131.74. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See the top stocks recommended by analysts >> Read More on KKR: KKR offers $5B for majority stake in Thames Water, Bloomberg says KKR clashes with FiberCop over EUR 449M earnings hole, FT says Delta flight crashes in Toronto, Southwest cuts corporate roles: Morning Buzz KKR enters into strategic partnership with EGC KKR enters partnership with EGC"
    },
    {
        "title": "Can the Latest iPhone 16e Push the Apple Stock Higher in 2025?",
        "publisher": "Zacks",
        "publish_date": "2025-02-20 17:32:00",
        "link": "https://finance.yahoo.com/news/latest-iphone-16e-push-apple-163200134.html",
        "type": "STORY",
        "content": "Apple AAPL expanded the iPhone 16 family with the launch of a cheaper iPhone 16e version powered by the latest A18 chip and supporting Apple Intelligence. iPhone 16e features the new Apple C1, the first cellular modem designed by Apple, and a 48MP Fusion camera with an integrated 2x Telephoto option.iPhone 16e is available in a 6.1-inch display size and has the best battery life ever on this display size offered by Apple. The iPhone 16e, available from Feb. 28, will cost $599 compared with $799 for iPhone 16 and $999 for iPhone 16 Pro. The affordable iPhone 16e is expected to boost Apple’s footprint in price-sensitive countries like China and India. Apple has been suffering from sluggish demand for the iPhone in China amid increasing competition from the likes of Huawei and Xiaomi, as well as the lack of Apple Intelligence. Although the iPhone 16e is still way pricier than devices like the Google Pixel 8A and OnePlus 12R, which cost below $500, the availability of Apple Intelligence can be a game changer. Although iPhone sales decreased 0.8% year over year to $69.14 billion in the first quarter of fiscal 2025, Apple saw better iPhone 16 sales in those regions where Apple Intelligence was available. iPhone’s active installed base grew to an all-time high and saw a record level of upgrades in the reported quarter. Per Kantar, the iPhone was a top-selling model in the United States, Urban China, India, the U.K., France, Australia and Japan.Apple launched the first set of Apple Intelligence features in U.S. English for iPhone, iPad and Mac, and introduced more features and expanded to more countries in December. Apple Intelligence is now available in Australia, Canada, New Zealand, South Africa and the U.K. Although Greater China sales decreased 11.1% year over year, Apple benefited from strong sales in a number of emerging markets, including India. In the first quarter of fiscal 2025, the iPhone was the top-selling model in the country. The company saw double-digit growth in the installed base in the emerging markets. Per Canalys’ latest data, Apple benefited from strong sales in emerging markets in the Asia-Pacific region in 2024. AAPL maintained its lead over Samsung for the second consecutive year, with a market share of 23% compared with the latter’s 16%. Xiaomi trailed both Apple and Samsung with 13% market share. According to Canalys, global smartphone shipments increased 7% year over year to $1.22 billion units in 2024. Apple shares have declined 2.3% year to date, underperforming the broader Zacks Computer & Technology sector’s appreciation of 2.1%.  Image Source: Zacks Investment Research  We believe the expanding launch of Apple Intelligence will drive further adoption of iPhone devices. In April, Apple is set to launch the next level of language updates with Apple Intelligence, including French, German, Italian, Portuguese, Spanish, Japanese, Korean, simplified Chinese, and localized English to Singapore and India. AAPL’s Services business is expected to drive top-line growth. It now has more than 1 billion paid subscribers across its Services portfolio, more than double what it had four years ago. The expanding content portfolio of Apple TV+, Apple Music and Apple Arcade, as well as the growing user base of Apple Pay, has helped drive subscriber growth.The Services business benefits from the growing demand for Apple TV+ content and the adoption of Apple Pay. It has expanded Tap to Pay on iPhone to more markets, including the U.A.E., Chile, Japan, Canada, Italy and Germany. Apple Pay is now available in countries like Egypt and Uruguay. The expanding content portfolio of Apple TV+ is noteworthy. Apple expects the March-end quarter’s (second-quarter fiscal 2025) revenues to grow low double digits on a year-over-year basis. The Zacks Consensus Estimate for Apple’s second-quarter fiscal 2025 earnings has declined 4.2% to $1.61 per share over the past 30 days, indicating 5.23% growth from the figure reported in the year-ago quarter.Apple’s earnings beat the Zacks Consensus Estimate in all the trailing four quarters, with the average earnings surprise being 4.39%. Apple Inc. price-consensus-chart | Apple Inc. Quote  Find the latest EPS estimates and surprises on Zacks Earnings Calendar. The AAPL stock is not so cheap, as the Value Score of D suggests a stretched valuation at this moment.Apple is trading at a premium with a forward 12-month P/E of 30.45X compared with the sector’s 26.88X and higher than the median of 29.85X, reflecting a stretched valuation. Image Source: Zacks Investment Research Apple’s AI push with Apple Intelligence is noteworthy. However, it is still playing catch-up with Microsoft MSFT, Alphabet GOOGL and Amazon AMZN.Although the Services business has emerged as AAPL’s new cash cow, with an expanding content portfolio for Apple TV+, we believe that Apple Intelligence will take some time to go mainstream.Hence, we believe that Apple’s near-term growth prospects do not justify a premium valuation.AAPL currently has a Zacks Rank #3 (Hold), suggesting that it may be wise to wait for a more favorable entry point in the stock. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research"
    },
    {
        "title": "In India, Apple's iPhone 16e faces stiff competition from older models",
        "publisher": "TechCrunch",
        "publish_date": "2025-02-20 19:20:17",
        "link": "https://finance.yahoo.com/m/57d649f1-9d08-3c12-8930-54f6bcbc5dd8/in-india%2C-apple%27s-iphone-16e.html",
        "type": "STORY",
        "content": "On Wednesday, Apple unveiled the iPhone 16e. The model replaces both the iPhone SE and iPhone 14 in the company's lineup. The new handset is the least expensive member of the iPhone 16 lineup, aiming at emerging markets including India. The world's second largest smartphone market (behind China) has fueled significant iPhone sales, with Apple recently cracking the top five vendors in India. A week ahead of the iPhone 16e's release, however, it's unclear what impact the device will have on this key market. In 2024, India became the fourth largest market for Apple, after the U.S., China, and Japan, seeing a record 12 million shipments during the quarter, with 35% YoY growth, per IDC. It is expected to cross the 15 million milestone this year. But it wasn't the iPhone SE or iPhone 14 that helped the Cupertino company succeed in the South Asian market. In fact, the iPhone 15 and iPhone 13 were the highest shipped models, with a 6% share of overall smartphone market in Q4. Even as Apple has expanded in India, the iPhone SE has seen a proportional decline. The iPhone SE (2020) represented 18% of overall iPhone shipments in its launch year, while the iPhone SE (2022) made up 6% of total shipments two years later, per IDC data shared exclusively with TechCrunch. In contrast, the iPhone 13 made up nearly 40% of iPhone shipments in 2022. According to IDC, iPhone SE shipments in India and globally declined to negligible volume in 2023 and 2024. Neither year saw a new SE release. Navkendar Singh, associate vice president at IDC India, tells TechCrunch that nearly two-thirds of iPhone volumes in India come from previous-generation models. Android dominates India's smartphone market, with an average smartphone of $259. Chinese brands such as Vivo, Oppo, and Xiaomi have made great strides in the market. However, the iPhone is still top dog in the $600+ market segment, followed by Samsung Galaxy smartphones. This means, in essence, that the iPhone's biggest competitor is other iPhones. The iPhone 16e starts at 59,900 Indian rupees (~$689) and goes up to $1,034. In contrast, the older iPhone 15 starts at $804 and iPhone 16 at $919. In a market like India, where older devices continue to sell, the price difference may not be enough to justify choosing the iPhone 16e over, say, the iPhone 15 given the features the budget phone sacrifices. What new features the 16e does offer may not be substantial enough to attract new buyers, given the popularity of the equated monthly installment (EMI) option, which allows users to purchase a high ticket item via installment payments. Roughly half of customers purchasing a premium handset in India ($400-700) opt to finance their devices this way. \"With EMI offers, the difference in real terms would make many prefer the iPhone 15 or 16 over the iPhone 16Ee\" Singh said. Apple has expanded Apple Intelligence to a more affordable segment with the iPhone 16e. This could help the company drive more Apple Services revenues over time. However, Apple Intelligence is currently in its infancy and in the U.S. and won't arrive in India until April. The 16e is Apple's latest iPhone to be assembled in India — alongside the other iPhone 16 models. However, local assembly isn't likely to impact the pricing — at least in the short term. Sanyam Chaurasia, a senior analyst at Canalys, believed that the iPhone 16e might help Apple attract customers who might otherwise pick up an iPhone 12 or 13 -- both of which are still available through retail channels in India. He added that younger users might also opt for the iPhone 16e, rather than the older 15. \"It's a model which serves a niche audience,\" Chaurasia said. Unlike other emerging markets such as Latin America and Southeast Asia, India is not a telco-driven market where carriers subsidize smartphones by bundling them with their plans. This makes the iPhone 16e a relatively expensive option for Indian buyers. The timing of launching the iPhone 16e also makes it less attractive as this is not an upgrade season, which usually falls around Indian festivals in the later part of the year, Chaurasia said. \"Apple is likely to have discounts on the iPhone 16e during the festive season later this year, but there would also be similar discounts on the existing iPhone models, making them even more attractive than this new model,\" he stated. This article originally appeared on TechCrunch at https://techcrunch.com/2025/02/20/in-india-apples-iphone-16e-faces-stiff-competition-from-older-models/"
    },
    {
        "title": "Apple Inc. (AAPL): Among the Best Long-Term Stocks to Buy According to Ken Fisher",
        "publisher": "Insider Monkey",
        "publish_date": "2025-02-20 19:08:30",
        "link": "https://finance.yahoo.com/news/apple-inc-aapl-among-best-180830245.html",
        "type": "STORY",
        "content": "We recently compiled a list of the 12 Best Long-Term Stocks to Buy According to Ken Fisher. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other long-term stocks. Ken Fisher is a prominent American billionaire investment analyst, author, and the founder of Fisher Asset Management, one of the biggest and most successful hedge funds in the world. Fisher was born in California in 1950. His net worth is estimated at over $11.2 billion, ranking him high on the list of richest Americans and global billionaires. Fisher's early life was influenced by his father, Philip A. Fisher, a renowned stock investor. He pursued higher education at California State Polytechnic University, Humboldt, graduating in 1972 with an associate degree in economics. In 1979, Fisher founded Fisher Investments, which has grown into a global financial advisory firm managing close to $252 billion in 13F securities. Read more about these developments by accessing 10 Best AI Data Center Stocks and 10 Buzzing AI Stocks According to Goldman Sachs. Fisher's influence extends beyond asset management. He authored the Portfolio Strategy column in Forbes from 1984 to 2016, making him the longest continuously running columnist in the magazine's history. Currently, he contributes monthly columns to major publications worldwide, including the New York Post, The Daily Telegraph, and The Australian, among others. In addition to his columns, Fisher has authored 11 books on investing, with four becoming New York Times bestsellers. His work has significantly influenced investment strategies and financial planning. Notably, he popularized the price-to-sales ratio as a stock analysis tool and has been involved in groundbreaking work in behavioral finance. Read more about these developments by accessing 30 Most Important AI Stocks According to BlackRock and Beyond the Tech Giants: 35 Non-Tech AI Opportunities. For this article, we selected stocks by combing through the 13F portfolio of Fisher Asset Management at the end of the fourth quarter of 2024. Only the companies that have been in the 13F portfolio of the fund consistently for the past three years were selected. These stocks are also popular among other hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). A wide view of an Apple store, showing the range of products the company offers. Number of Hedge Fund Holders: 166 Fisher Asset Management’s Stake: $14.8 billion Apple Inc. (NASDAQ:AAPL) is a consumer electronics firm. According to the fourth quarter of 2024, strong business performance in the September quarter generated nearly $27 billion in operating cash flow, enabling the company to return over $29 billion to the shareholders. In mid-February, Forbes reported that the company had released a new budget iPhone. The device comes with a price increase from the current $429 and features Apple Intelligence, along with a design similar to the iPhone 14. It is the first iPhone to include Apple’s in-house modem, a project the company has been working on for years. While Qualcomm has supplied modems for previous models and renewed its contract with Apple in September of the prior year, the company is gradually shifting toward its own technology. Overall AAPL ranks 1st on our list of the best long-term stocks to buy according to Ken Fisher. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.  READ NEXT: 20 Best AI Stocks To Buy Now and Complete List of 59 AI Companies Under $2 Billion in Market Cap  Disclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "title": "Alibaba is 'big beneficiary' of AI with partnerships like Apple",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-02-20 19:01:52",
        "link": "https://finance.yahoo.com/video/alibaba-big-beneficiary-ai-partnerships-180152065.html",
        "type": "VIDEO",
        "content": "Alibaba (BABA) shares gain after announcing strong cloud sales in its fiscal third quarter and highlighting its artificial intelligence (AI) related gains. The Chinese e-commerce tech company is also in focus after announcing a partnership with Apple (AAPL) to bring Apple Intelligence features to iPhones in the Chinese market. Manhattan Venture Partners head of research Santosh Rao joins Catalysts Co-Hosts Seana Smith and Madison Mills to discuss why Alibaba stock is \"definitely\" a Buy in his view as \"a big beneficiary\" of AI. \"AI is going to help [Alibaba's] core business,\" the analyst says, explaining, \"They're using it for their advertising for their e-commerce and all that.\" \"AI is a must. Every company has to use that word ... [Alibaba] has partnerships with many key players\" like its new Apple partnership, Rao explains. \"Competitively [the company is] in a good position and needs to keep innovating, which it is, because the competition is right, nipping at their heels.\" To watch more expert insights and analysis on the latest market action, check out more Catalysts here. This post was written by Naomi Buchanan."
    },
    {
        "title": "American Airlines Joins Rivals in Integrating Apple AirTags to Track Lost Bags",
        "publisher": "Investopedia",
        "publish_date": "2025-02-20 18:57:05",
        "link": "https://finance.yahoo.com/m/f7f74cf9-490d-34b4-aa25-a56ef4054956/american-airlines-joins.html",
        "type": "STORY",
        "content": "Joe Raedle / Getty Images  American Airlines passengers who place Apple AirTags in their luggage will be able to submit location information to the airline. The goal is to reduce the amount of time it takes to reunite passengers with delayed bags, an American Airlines spokesperson said. Less than 1% of bags are mishandled, but American was among the worst offenders in November, according to DOT data.  American Airlines (AAL) has introduced a feature that allows customers who place Apple (AAPL) AirTags in their luggage to help the airline track down their lost bags. Passengers can generate a link through Apple's Share Item feature available on iOS 18.2 or later and share it with the airline if a bag is delayed, an American Airlines spokesperson said. Customers are \"usually reunited with their bag in just over a day\" and this integration is designed to reduce that time, the spokesperson said, adding \"that less than 1% of customers' checked bags are mishandled.\" The service is available for trips ending in the U.S., Puerto Rico, and the U.S. Virgin Islands, American said. American joins rivals Delta Air Lines (DAL) and United Airlines (UAL), which integrated AirTag functionality late last year. United and American were the two worst offenders among U.S. carriers in terms of mishandling bags in November, according to the Department of Transportation's Air Travel Consumer Report last month, mishandling 0.54% and 0.53% of bags, respectively. Shares of American Airlines, which slipped 2% to $15.68 intraday Thursday, are up 7% over the past 12 months. Last month, Jefferies analysts raised their price target to $20 from $12, and said the airline \"could see significant surprise to the upside in 2025.”\" Read the original article on Investopedia"
    },
    {
        "title": "Apple Speeds Up Hardware Shift, Phases Out Broadcom Wi-Fi Chips in iPhone 17",
        "publisher": "GuruFocus.com",
        "publish_date": "2025-02-20 18:42:36",
        "link": "https://finance.yahoo.com/news/apple-speeds-hardware-shift-phases-174236151.html",
        "type": "STORY",
        "content": "Apple (NASDAQ:AAPL) is moving faster toward replacing third-party hardware with its own, according to TF International Securities analyst Ming-Chi Kuo. The company now plans to use in-house Wi-Fi chips in all iPhone 17 models, phasing out chips from Broadcom (NASDAQ:AVGO). This follows Apple's confirmation on Wednesday that its upcoming iPhone 16e will feature an in-house modem chip, the C1, instead of relying on Qualcomm (NASDAQ:QCOM). Qualcomm has supplied Apple's modem chips for more than a decade. \"Following Qualcomm, Broadcom's Wi-Fi chips will also be replaced by Apple's in-house chips at a faster pace,\" Kuo posted on X Thursday. His latest research suggests that while only the slim iPhone 17 model will use Apple's C1 modem, all iPhone 17 models will feature Apple's in-house Wi-Fi chips. Beyond cost savings, Kuo noted the switch would enhance connectivity across Apple devices. However, Apple's shift to its own chips doesn't mean third-party suppliers are entirely out. Many of these components are already patented, and Apple continues to operate under licensing agreements. For instance, even though Apple is moving away from Qualcomm's modems, Qualcomm still earns royalties through a patent deal. This article first appeared on GuruFocus."
    },
    {
        "title": "What Wall Street experts are saying about Alibaba ahead of earnings",
        "publisher": "TipRanks",
        "publish_date": "2025-02-20 18:15:10",
        "link": "https://finance.yahoo.com/news/wall-street-experts-saying-alibaba-171510231.html",
        "type": "STORY",
        "content": "Alibaba Group (BABA) is scheduled to report results of its fiscal third quarter of FY24 before the U.S. market opens on Thursday, February 20, and will hold a conference call to discuss the results at 7:30 a.m. U.S. Eastern Time the same day. What to watch for: See what stocks are receiving strong buy ratings from top-rated analysts. Filter, analyze, and streamline your search for investment opportunities with  TipRanks’ Stock Screener. EXPECTATIONS: Current consensus adjusted EPS and revenue forecasts for Alibaba’s December-end quarter stand at $2.64 and $38.23B, respectively, according to data from Bloomberg. AI: Along with its last earnings report, Alibaba said growth in its Cloud business accelerated from prior quarters, with revenues from public cloud products growing in double digits and AI-related product revenue delivering triple-digit growth. “We are more confident in our core businesses than ever and will continue to invest in supporting long-term growth,” added Eddie Wu, Chief Executive Officer of Alibaba Group. In late January, Alibaba debuted the latest iteration of its artificial intelligence model, “claiming it surpasses DeepSeek’s AI model across various benchmarks,” wrote The Wall Street Journal‘s Kimberley Kao. “The company stated that Qwen2.5 Max “achieves competitive performance against the top-tier models,” referencing OpenAI’s GPT-4o, DeepSeek-V3 and Meta’s Llama-3.1-405B, based on its compiled comparison using various benchmark tests,” noted the WSJ story. Afterward, Goldman Sachs reiterated a Buy rating and $117 price target on Alibaba, noting that after three different Chinese AI model launches, Alibaba Cloud announced the launch of its latest multi-modal vision-language model Qwen2.5-VL, which is open source, just like DeepSeek’s Janus-Pro. The firm believes increasingly agile Chinese models and significant improvement in computing cost efficiencies could drive further room for wider adoption/exploration/proliferation of AI applications and potential for further global expansion for Chinese players. Goldman added that the stock’s then-current market cap had already priced in the unfavorable e-commerce competition. The buzz around DeepSeek, a Chinese-built large-language open-source model that claims to rival offerings from OpenAI’s ChatGPT and Meta Platforms (META) but using a much smaller budget, sent several technology stocks tumbling on January 27. DeepSeek’s new AI model was being praised for being cost-effective and capable of running on less-advanced chips, which raised questions about the high valuations of companies like Nvidia (NVDA). Jefferies views DeepSeek’s launch “as part of an ongoing evolution, not revolution” and called the selloff in software stocks “largely overdone.” Innovations which continue to drive increasing efficiency at inference, but also training, will further improve the return on investment of artificial intelligence, leading to faster software adoption, the analyst argued. Inference efficiency is part of an ongoing trend with DeepSeek and not as incremental as some lead to believe, according to Jefferies. On February 7, Alibaba denied reports that the company plans to invest in DeepSeek, a Chinese-built large-language open-source model that claims to rival offerings from Microsoft-backed (MSFT) OpenAI’s ChatGPT and Meta Platforms but using a much smaller budget, Reuters’ Brenda Goh reported. Citing Chinese news outlet The Paper, Goh said that Yan Qiao, a vice president at Alibaba, wrote on her personal WeChat feed that “as a fellow Chinese and Hangzhou company, we applaud DeepSeek, but news circulating that Alibaba will invest in DeepSeek is fake news.” Previous reports indicated Alibaba planned to invest $1B into DeepSeek. On February 10, after speaking with more than 100 investors over preceding few days, JPMorgan analyst Alex Yao said he sensed an “increasingly positive” sentiment on Alibaba shares, which the firm says was evidenced by a 13% share price rally in the prior five trading days. However, there are still mixed views and positions on the stock, which indicates “room for share price movement on both sides,” the analyst told investors at that time. JPMorgan believes investors are divided on the potential upside from Alibaba’s artificial intelligence initiatives and cloud business. The firm thinks demonstrating a concrete plan for monetizing AI capabilities “could alleviate investor concerns about the sustainability of the current rally.” JPMorgan has an Overweight rating on Alibaba with a $125 price target. APPLE PACT: Earlier this month, Reuters’ Casey Hall reported that Alibaba will partner with Apple (AAPL) to support iPhones’ AI services offering in China, citing confirmation from the Chinese company’s chairman. For Alibaba, the partnership is a major win in China’s competitive AI market that is home to DeepSeek, which made headlines this year with models developed at a fraction of the cost of Western rivals, the author noted. The landmark deal also resolves months of speculation over Apple’s AI strategy in the region as the iPhone maker had been in talks with Chinese tech leaders including Baidu (BIDU), ByteDance and Tencent (TCEHY), Reuters and the Information have reported. After The Information initially reported that Apple partnered with Alibaba to bring Apple Intelligence features to iPhone users in China, Morgan Stanley said that the firm views the pact as “a critical catalyst for Apple’s competitive standing in China.” While acknowledging having no knowledge of Apple’s internal decisions, Alibaba is the largest e-commerce player in China, so it could have “a treasure trove of data that Apple could look to leverage in delivering personalized GenAI features to Chinese consumers,” says the analyst, who adds that the firm could also see a scenario where Apple creates an initial AI partnership with Alibaba that eventually expands to other local Chinese cloud players over time. Meanwhile, BofA analyst Wamsi Mohan noted that Apple’s smartphone share has been pressured in China, and while it was announced last year that Apple was partnering with Baidu for AI in China, Apple ended the project because Baidu’s models developed for Apple Intelligence were not up to Apple’s standards. The Alibaba partnership news shows Apple’s desire to swiftly launch AI features in China, BofA says. SENTIMENT: Among analysts tracked by Bloomberg that have updated their views on Alibaba within the last twelve months, 41 have Buy or equivalent ratings, eight have Hold or equivalent ratings and only one has a Sell or equivalent rating. The average twelve month price target of 30 of those analysts is $124.32. Check out recent Media Buzz Sentiment on Alibaba as measured by TipRanks. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See today’s best-performing stocks on TipRanks >> Read More on BABA: Alibaba price target raised to $125 from $110 at Baird Alibaba (BABA) Shares Climb after Xi Tells Tech Titans He Will Help Them Be “Competitive” Looking for Exposure to RGTI Stock? Try These Two ETFs BIDU Earnings: Baidu Revenues Slide Less than Expected as AI Rivalry Intensifies Alibaba (BABA) Will Report Earnings This Week. Here Is What to Expect"
    },
    {
        "title": "Apple unveils iPhone 16e, Arista reports Q4 beat: Morning Buzz",
        "publisher": "TipRanks",
        "publish_date": "2025-02-20 18:00:59",
        "link": "https://finance.yahoo.com/news/apple-unveils-iphone-16e-arista-170059313.html",
        "type": "STORY",
        "content": "Get caught up quickly on the top news and calls moving stocks with these five Top Five lists. See what stocks are receiving strong buy ratings from top-rated analysts. Filter, analyze, and streamline your search for investment opportunities with  TipRanks’ Stock Screener. 1. STOCK NEWS: Apple (AAPL) announced the iPhone 16e, available starting February 28 Arista Networks (ANET) reported better-than-expected Q4 results and provided upbeat Q1 revenue guidance Howard Hughes (HHH) confirmed receipt of an unsolicited takeover proposal from Pershing Square Analog Devices (ADI) reported upbeat Q1 results, raised its quarterly dividend by 8%, and boosted its share repurchase authorization by $10B Shift4 (FOUR) (GB) for $7.50 per share in cash 2. WALL STREET CALLS: BofA upgraded Capital One (COF) to Buy as it views the company being well positioned to benefit from the pending Discover (DFS) acquisition Mizuho upgraded Glaukos (GKOS) to Outperform Morgan Stanley downgraded Workday (WDAY) to Equal Weight Nomura downgraded Baidu (BIDU) to Neutral DA Davidson initiated coverage of Electronic Arts (EA) with a Neutral rating and Take-Two (TTWO) with a Buy 3. AROUND THE WEB: KKR (KKR) offered to inject $5B into Thames Water for a majority stake, Bloomberg says Milan prosecutors plan to drop a case brought against Google’s (GOOGL) European division after the company agreed to pay $340M to settle a tax claim, Reuters reports Airbnb (ABNB) is suing the City of New Orleans for requiring the company and other short-term rental platforms to ensure the properties they offer are in compliance with city laws, AP News reports Land & Buildings Investment Management is launching a proxy fight at National Health Investors (NHI) and is seeking to oust two board members, WSJ says BP (BP) is said to be weighing a potential sale of its Castrol-branded lubricants unit, which could be worth about $10B, Bloomberg reports 4. MOVERS: Hims & Hers (HIMS) gains after acquiring an at-home lab testing facility ImmunityBio (IBRX) higher after the FDA authorized the company to provide rBCG to urologists amid the shortages Compass (COMP) increases after reporting Q4 results and providing guidance for Q1 and FY25 Cinemark (CNK) and Global-e Online (GLBE) fall after reporting quarterly results Celanese (CE) lower after reporting Q4 results, with EPS and revenue beating consensus 5. EARNINGS/GUIDANCE: Etsy (ETSY) reported Q4 results, with EPS beating consensus Solar Edge (SEDG) reported Q4 results, with CEO Shuki Nir commenting, “We are just getting started on our turnaround story” WingStop (WING) reported Q4 results and provided guidance for FY25 Bumble (BMBL) reported Q4 results and provided guidance for Q1 Capri Holdings (CPRI) provided guidance for FY25 and FY26 INDEXES: Near midday, the Dow was down 0.22%, or 99.90, to 44,456.44, the Nasdaq was down 0.08%, or 15.03, to 20,026.23, and the S&P 500 was up 0.04%, or 2.16, to 6,131.74. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See the top stocks recommended by analysts >> Read More on KKR: KKR offers $5B for majority stake in Thames Water, Bloomberg says KKR clashes with FiberCop over EUR 449M earnings hole, FT says Delta flight crashes in Toronto, Southwest cuts corporate roles: Morning Buzz KKR enters into strategic partnership with EGC KKR enters partnership with EGC"
    },
    {
        "title": "Can the Latest iPhone 16e Push the Apple Stock Higher in 2025?",
        "publisher": "Zacks",
        "publish_date": "2025-02-20 17:32:00",
        "link": "https://finance.yahoo.com/news/latest-iphone-16e-push-apple-163200134.html",
        "type": "STORY",
        "content": "Apple AAPL expanded the iPhone 16 family with the launch of a cheaper iPhone 16e version powered by the latest A18 chip and supporting Apple Intelligence. iPhone 16e features the new Apple C1, the first cellular modem designed by Apple, and a 48MP Fusion camera with an integrated 2x Telephoto option.iPhone 16e is available in a 6.1-inch display size and has the best battery life ever on this display size offered by Apple. The iPhone 16e, available from Feb. 28, will cost $599 compared with $799 for iPhone 16 and $999 for iPhone 16 Pro. The affordable iPhone 16e is expected to boost Apple’s footprint in price-sensitive countries like China and India. Apple has been suffering from sluggish demand for the iPhone in China amid increasing competition from the likes of Huawei and Xiaomi, as well as the lack of Apple Intelligence. Although the iPhone 16e is still way pricier than devices like the Google Pixel 8A and OnePlus 12R, which cost below $500, the availability of Apple Intelligence can be a game changer. Although iPhone sales decreased 0.8% year over year to $69.14 billion in the first quarter of fiscal 2025, Apple saw better iPhone 16 sales in those regions where Apple Intelligence was available. iPhone’s active installed base grew to an all-time high and saw a record level of upgrades in the reported quarter. Per Kantar, the iPhone was a top-selling model in the United States, Urban China, India, the U.K., France, Australia and Japan.Apple launched the first set of Apple Intelligence features in U.S. English for iPhone, iPad and Mac, and introduced more features and expanded to more countries in December. Apple Intelligence is now available in Australia, Canada, New Zealand, South Africa and the U.K. Although Greater China sales decreased 11.1% year over year, Apple benefited from strong sales in a number of emerging markets, including India. In the first quarter of fiscal 2025, the iPhone was the top-selling model in the country. The company saw double-digit growth in the installed base in the emerging markets. Per Canalys’ latest data, Apple benefited from strong sales in emerging markets in the Asia-Pacific region in 2024. AAPL maintained its lead over Samsung for the second consecutive year, with a market share of 23% compared with the latter’s 16%. Xiaomi trailed both Apple and Samsung with 13% market share. According to Canalys, global smartphone shipments increased 7% year over year to $1.22 billion units in 2024. Apple shares have declined 2.3% year to date, underperforming the broader Zacks Computer & Technology sector’s appreciation of 2.1%.  Image Source: Zacks Investment Research  We believe the expanding launch of Apple Intelligence will drive further adoption of iPhone devices. In April, Apple is set to launch the next level of language updates with Apple Intelligence, including French, German, Italian, Portuguese, Spanish, Japanese, Korean, simplified Chinese, and localized English to Singapore and India. AAPL’s Services business is expected to drive top-line growth. It now has more than 1 billion paid subscribers across its Services portfolio, more than double what it had four years ago. The expanding content portfolio of Apple TV+, Apple Music and Apple Arcade, as well as the growing user base of Apple Pay, has helped drive subscriber growth.The Services business benefits from the growing demand for Apple TV+ content and the adoption of Apple Pay. It has expanded Tap to Pay on iPhone to more markets, including the U.A.E., Chile, Japan, Canada, Italy and Germany. Apple Pay is now available in countries like Egypt and Uruguay. The expanding content portfolio of Apple TV+ is noteworthy. Apple expects the March-end quarter’s (second-quarter fiscal 2025) revenues to grow low double digits on a year-over-year basis. The Zacks Consensus Estimate for Apple’s second-quarter fiscal 2025 earnings has declined 4.2% to $1.61 per share over the past 30 days, indicating 5.23% growth from the figure reported in the year-ago quarter.Apple’s earnings beat the Zacks Consensus Estimate in all the trailing four quarters, with the average earnings surprise being 4.39%. Apple Inc. price-consensus-chart | Apple Inc. Quote  Find the latest EPS estimates and surprises on Zacks Earnings Calendar. The AAPL stock is not so cheap, as the Value Score of D suggests a stretched valuation at this moment.Apple is trading at a premium with a forward 12-month P/E of 30.45X compared with the sector’s 26.88X and higher than the median of 29.85X, reflecting a stretched valuation. Image Source: Zacks Investment Research Apple’s AI push with Apple Intelligence is noteworthy. However, it is still playing catch-up with Microsoft MSFT, Alphabet GOOGL and Amazon AMZN.Although the Services business has emerged as AAPL’s new cash cow, with an expanding content portfolio for Apple TV+, we believe that Apple Intelligence will take some time to go mainstream.Hence, we believe that Apple’s near-term growth prospects do not justify a premium valuation.AAPL currently has a Zacks Rank #3 (Hold), suggesting that it may be wise to wait for a more favorable entry point in the stock. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research"
    },
    {
        "title": "In India, Apple's iPhone 16e faces stiff competition from older models",
        "publisher": "TechCrunch",
        "publish_date": "2025-02-20 19:20:17",
        "link": "https://finance.yahoo.com/m/57d649f1-9d08-3c12-8930-54f6bcbc5dd8/in-india%2C-apple%27s-iphone-16e.html",
        "type": "STORY",
        "content": "On Wednesday, Apple unveiled the iPhone 16e. The model replaces both the iPhone SE and iPhone 14 in the company's lineup. The new handset is the least expensive member of the iPhone 16 lineup, aiming at emerging markets including India. The world's second largest smartphone market (behind China) has fueled significant iPhone sales, with Apple recently cracking the top five vendors in India. A week ahead of the iPhone 16e's release, however, it's unclear what impact the device will have on this key market. In 2024, India became the fourth largest market for Apple, after the U.S., China, and Japan, seeing a record 12 million shipments during the quarter, with 35% YoY growth, per IDC. It is expected to cross the 15 million milestone this year. But it wasn't the iPhone SE or iPhone 14 that helped the Cupertino company succeed in the South Asian market. In fact, the iPhone 15 and iPhone 13 were the highest shipped models, with a 6% share of overall smartphone market in Q4. Even as Apple has expanded in India, the iPhone SE has seen a proportional decline. The iPhone SE (2020) represented 18% of overall iPhone shipments in its launch year, while the iPhone SE (2022) made up 6% of total shipments two years later, per IDC data shared exclusively with TechCrunch. In contrast, the iPhone 13 made up nearly 40% of iPhone shipments in 2022. According to IDC, iPhone SE shipments in India and globally declined to negligible volume in 2023 and 2024. Neither year saw a new SE release. Navkendar Singh, associate vice president at IDC India, tells TechCrunch that nearly two-thirds of iPhone volumes in India come from previous-generation models. Android dominates India's smartphone market, with an average smartphone of $259. Chinese brands such as Vivo, Oppo, and Xiaomi have made great strides in the market. However, the iPhone is still top dog in the $600+ market segment, followed by Samsung Galaxy smartphones. This means, in essence, that the iPhone's biggest competitor is other iPhones. The iPhone 16e starts at 59,900 Indian rupees (~$689) and goes up to $1,034. In contrast, the older iPhone 15 starts at $804 and iPhone 16 at $919. In a market like India, where older devices continue to sell, the price difference may not be enough to justify choosing the iPhone 16e over, say, the iPhone 15 given the features the budget phone sacrifices. What new features the 16e does offer may not be substantial enough to attract new buyers, given the popularity of the equated monthly installment (EMI) option, which allows users to purchase a high ticket item via installment payments. Roughly half of customers purchasing a premium handset in India ($400-700) opt to finance their devices this way. \"With EMI offers, the difference in real terms would make many prefer the iPhone 15 or 16 over the iPhone 16Ee\" Singh said. Apple has expanded Apple Intelligence to a more affordable segment with the iPhone 16e. This could help the company drive more Apple Services revenues over time. However, Apple Intelligence is currently in its infancy and in the U.S. and won't arrive in India until April. The 16e is Apple's latest iPhone to be assembled in India — alongside the other iPhone 16 models. However, local assembly isn't likely to impact the pricing — at least in the short term. Sanyam Chaurasia, a senior analyst at Canalys, believed that the iPhone 16e might help Apple attract customers who might otherwise pick up an iPhone 12 or 13 -- both of which are still available through retail channels in India. He added that younger users might also opt for the iPhone 16e, rather than the older 15. \"It's a model which serves a niche audience,\" Chaurasia said. Unlike other emerging markets such as Latin America and Southeast Asia, India is not a telco-driven market where carriers subsidize smartphones by bundling them with their plans. This makes the iPhone 16e a relatively expensive option for Indian buyers. The timing of launching the iPhone 16e also makes it less attractive as this is not an upgrade season, which usually falls around Indian festivals in the later part of the year, Chaurasia said. \"Apple is likely to have discounts on the iPhone 16e during the festive season later this year, but there would also be similar discounts on the existing iPhone models, making them even more attractive than this new model,\" he stated. This article originally appeared on TechCrunch at https://techcrunch.com/2025/02/20/in-india-apples-iphone-16e-faces-stiff-competition-from-older-models/"
    },
    {
        "title": "Apple Inc. (AAPL): Among the Best Long-Term Stocks to Buy According to Ken Fisher",
        "publisher": "Insider Monkey",
        "publish_date": "2025-02-20 19:08:30",
        "link": "https://finance.yahoo.com/news/apple-inc-aapl-among-best-180830245.html",
        "type": "STORY",
        "content": "We recently compiled a list of the 12 Best Long-Term Stocks to Buy According to Ken Fisher. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other long-term stocks. Ken Fisher is a prominent American billionaire investment analyst, author, and the founder of Fisher Asset Management, one of the biggest and most successful hedge funds in the world. Fisher was born in California in 1950. His net worth is estimated at over $11.2 billion, ranking him high on the list of richest Americans and global billionaires. Fisher's early life was influenced by his father, Philip A. Fisher, a renowned stock investor. He pursued higher education at California State Polytechnic University, Humboldt, graduating in 1972 with an associate degree in economics. In 1979, Fisher founded Fisher Investments, which has grown into a global financial advisory firm managing close to $252 billion in 13F securities. Read more about these developments by accessing 10 Best AI Data Center Stocks and 10 Buzzing AI Stocks According to Goldman Sachs. Fisher's influence extends beyond asset management. He authored the Portfolio Strategy column in Forbes from 1984 to 2016, making him the longest continuously running columnist in the magazine's history. Currently, he contributes monthly columns to major publications worldwide, including the New York Post, The Daily Telegraph, and The Australian, among others. In addition to his columns, Fisher has authored 11 books on investing, with four becoming New York Times bestsellers. His work has significantly influenced investment strategies and financial planning. Notably, he popularized the price-to-sales ratio as a stock analysis tool and has been involved in groundbreaking work in behavioral finance. Read more about these developments by accessing 30 Most Important AI Stocks According to BlackRock and Beyond the Tech Giants: 35 Non-Tech AI Opportunities. For this article, we selected stocks by combing through the 13F portfolio of Fisher Asset Management at the end of the fourth quarter of 2024. Only the companies that have been in the 13F portfolio of the fund consistently for the past three years were selected. These stocks are also popular among other hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). A wide view of an Apple store, showing the range of products the company offers. Number of Hedge Fund Holders: 166 Fisher Asset Management’s Stake: $14.8 billion Apple Inc. (NASDAQ:AAPL) is a consumer electronics firm. According to the fourth quarter of 2024, strong business performance in the September quarter generated nearly $27 billion in operating cash flow, enabling the company to return over $29 billion to the shareholders. In mid-February, Forbes reported that the company had released a new budget iPhone. The device comes with a price increase from the current $429 and features Apple Intelligence, along with a design similar to the iPhone 14. It is the first iPhone to include Apple’s in-house modem, a project the company has been working on for years. While Qualcomm has supplied modems for previous models and renewed its contract with Apple in September of the prior year, the company is gradually shifting toward its own technology. Overall AAPL ranks 1st on our list of the best long-term stocks to buy according to Ken Fisher. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.  READ NEXT: 20 Best AI Stocks To Buy Now and Complete List of 59 AI Companies Under $2 Billion in Market Cap  Disclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "title": "Alibaba is 'big beneficiary' of AI with partnerships like Apple",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-02-20 19:01:52",
        "link": "https://finance.yahoo.com/video/alibaba-big-beneficiary-ai-partnerships-180152065.html",
        "type": "VIDEO",
        "content": "Alibaba (BABA) shares gain after announcing strong cloud sales in its fiscal third quarter and highlighting its artificial intelligence (AI) related gains. The Chinese e-commerce tech company is also in focus after announcing a partnership with Apple (AAPL) to bring Apple Intelligence features to iPhones in the Chinese market. Manhattan Venture Partners head of research Santosh Rao joins Catalysts Co-Hosts Seana Smith and Madison Mills to discuss why Alibaba stock is \"definitely\" a Buy in his view as \"a big beneficiary\" of AI. \"AI is going to help [Alibaba's] core business,\" the analyst says, explaining, \"They're using it for their advertising for their e-commerce and all that.\" \"AI is a must. Every company has to use that word ... [Alibaba] has partnerships with many key players\" like its new Apple partnership, Rao explains. \"Competitively [the company is] in a good position and needs to keep innovating, which it is, because the competition is right, nipping at their heels.\" To watch more expert insights and analysis on the latest market action, check out more Catalysts here. This post was written by Naomi Buchanan."
    },
    {
        "title": "American Airlines Joins Rivals in Integrating Apple AirTags to Track Lost Bags",
        "publisher": "Investopedia",
        "publish_date": "2025-02-20 18:57:05",
        "link": "https://finance.yahoo.com/m/f7f74cf9-490d-34b4-aa25-a56ef4054956/american-airlines-joins.html",
        "type": "STORY",
        "content": "Joe Raedle / Getty Images  American Airlines passengers who place Apple AirTags in their luggage will be able to submit location information to the airline. The goal is to reduce the amount of time it takes to reunite passengers with delayed bags, an American Airlines spokesperson said. Less than 1% of bags are mishandled, but American was among the worst offenders in November, according to DOT data.  American Airlines (AAL) has introduced a feature that allows customers who place Apple (AAPL) AirTags in their luggage to help the airline track down their lost bags. Passengers can generate a link through Apple's Share Item feature available on iOS 18.2 or later and share it with the airline if a bag is delayed, an American Airlines spokesperson said. Customers are \"usually reunited with their bag in just over a day\" and this integration is designed to reduce that time, the spokesperson said, adding \"that less than 1% of customers' checked bags are mishandled.\" The service is available for trips ending in the U.S., Puerto Rico, and the U.S. Virgin Islands, American said. American joins rivals Delta Air Lines (DAL) and United Airlines (UAL), which integrated AirTag functionality late last year. United and American were the two worst offenders among U.S. carriers in terms of mishandling bags in November, according to the Department of Transportation's Air Travel Consumer Report last month, mishandling 0.54% and 0.53% of bags, respectively. Shares of American Airlines, which slipped 2% to $15.68 intraday Thursday, are up 7% over the past 12 months. Last month, Jefferies analysts raised their price target to $20 from $12, and said the airline \"could see significant surprise to the upside in 2025.”\" Read the original article on Investopedia"
    },
    {
        "title": "Apple Speeds Up Hardware Shift, Phases Out Broadcom Wi-Fi Chips in iPhone 17",
        "publisher": "GuruFocus.com",
        "publish_date": "2025-02-20 18:42:36",
        "link": "https://finance.yahoo.com/news/apple-speeds-hardware-shift-phases-174236151.html",
        "type": "STORY",
        "content": "Apple (NASDAQ:AAPL) is moving faster toward replacing third-party hardware with its own, according to TF International Securities analyst Ming-Chi Kuo. The company now plans to use in-house Wi-Fi chips in all iPhone 17 models, phasing out chips from Broadcom (NASDAQ:AVGO). This follows Apple's confirmation on Wednesday that its upcoming iPhone 16e will feature an in-house modem chip, the C1, instead of relying on Qualcomm (NASDAQ:QCOM). Qualcomm has supplied Apple's modem chips for more than a decade. \"Following Qualcomm, Broadcom's Wi-Fi chips will also be replaced by Apple's in-house chips at a faster pace,\" Kuo posted on X Thursday. His latest research suggests that while only the slim iPhone 17 model will use Apple's C1 modem, all iPhone 17 models will feature Apple's in-house Wi-Fi chips. Beyond cost savings, Kuo noted the switch would enhance connectivity across Apple devices. However, Apple's shift to its own chips doesn't mean third-party suppliers are entirely out. Many of these components are already patented, and Apple continues to operate under licensing agreements. For instance, even though Apple is moving away from Qualcomm's modems, Qualcomm still earns royalties through a patent deal. This article first appeared on GuruFocus."
    },
    {
        "title": "What Wall Street experts are saying about Alibaba ahead of earnings",
        "publisher": "TipRanks",
        "publish_date": "2025-02-20 18:15:10",
        "link": "https://finance.yahoo.com/news/wall-street-experts-saying-alibaba-171510231.html",
        "type": "STORY",
        "content": "Alibaba Group (BABA) is scheduled to report results of its fiscal third quarter of FY24 before the U.S. market opens on Thursday, February 20, and will hold a conference call to discuss the results at 7:30 a.m. U.S. Eastern Time the same day. What to watch for: See what stocks are receiving strong buy ratings from top-rated analysts. Filter, analyze, and streamline your search for investment opportunities with  TipRanks’ Stock Screener. EXPECTATIONS: Current consensus adjusted EPS and revenue forecasts for Alibaba’s December-end quarter stand at $2.64 and $38.23B, respectively, according to data from Bloomberg. AI: Along with its last earnings report, Alibaba said growth in its Cloud business accelerated from prior quarters, with revenues from public cloud products growing in double digits and AI-related product revenue delivering triple-digit growth. “We are more confident in our core businesses than ever and will continue to invest in supporting long-term growth,” added Eddie Wu, Chief Executive Officer of Alibaba Group. In late January, Alibaba debuted the latest iteration of its artificial intelligence model, “claiming it surpasses DeepSeek’s AI model across various benchmarks,” wrote The Wall Street Journal‘s Kimberley Kao. “The company stated that Qwen2.5 Max “achieves competitive performance against the top-tier models,” referencing OpenAI’s GPT-4o, DeepSeek-V3 and Meta’s Llama-3.1-405B, based on its compiled comparison using various benchmark tests,” noted the WSJ story. Afterward, Goldman Sachs reiterated a Buy rating and $117 price target on Alibaba, noting that after three different Chinese AI model launches, Alibaba Cloud announced the launch of its latest multi-modal vision-language model Qwen2.5-VL, which is open source, just like DeepSeek’s Janus-Pro. The firm believes increasingly agile Chinese models and significant improvement in computing cost efficiencies could drive further room for wider adoption/exploration/proliferation of AI applications and potential for further global expansion for Chinese players. Goldman added that the stock’s then-current market cap had already priced in the unfavorable e-commerce competition. The buzz around DeepSeek, a Chinese-built large-language open-source model that claims to rival offerings from OpenAI’s ChatGPT and Meta Platforms (META) but using a much smaller budget, sent several technology stocks tumbling on January 27. DeepSeek’s new AI model was being praised for being cost-effective and capable of running on less-advanced chips, which raised questions about the high valuations of companies like Nvidia (NVDA). Jefferies views DeepSeek’s launch “as part of an ongoing evolution, not revolution” and called the selloff in software stocks “largely overdone.” Innovations which continue to drive increasing efficiency at inference, but also training, will further improve the return on investment of artificial intelligence, leading to faster software adoption, the analyst argued. Inference efficiency is part of an ongoing trend with DeepSeek and not as incremental as some lead to believe, according to Jefferies. On February 7, Alibaba denied reports that the company plans to invest in DeepSeek, a Chinese-built large-language open-source model that claims to rival offerings from Microsoft-backed (MSFT) OpenAI’s ChatGPT and Meta Platforms but using a much smaller budget, Reuters’ Brenda Goh reported. Citing Chinese news outlet The Paper, Goh said that Yan Qiao, a vice president at Alibaba, wrote on her personal WeChat feed that “as a fellow Chinese and Hangzhou company, we applaud DeepSeek, but news circulating that Alibaba will invest in DeepSeek is fake news.” Previous reports indicated Alibaba planned to invest $1B into DeepSeek. On February 10, after speaking with more than 100 investors over preceding few days, JPMorgan analyst Alex Yao said he sensed an “increasingly positive” sentiment on Alibaba shares, which the firm says was evidenced by a 13% share price rally in the prior five trading days. However, there are still mixed views and positions on the stock, which indicates “room for share price movement on both sides,” the analyst told investors at that time. JPMorgan believes investors are divided on the potential upside from Alibaba’s artificial intelligence initiatives and cloud business. The firm thinks demonstrating a concrete plan for monetizing AI capabilities “could alleviate investor concerns about the sustainability of the current rally.” JPMorgan has an Overweight rating on Alibaba with a $125 price target. APPLE PACT: Earlier this month, Reuters’ Casey Hall reported that Alibaba will partner with Apple (AAPL) to support iPhones’ AI services offering in China, citing confirmation from the Chinese company’s chairman. For Alibaba, the partnership is a major win in China’s competitive AI market that is home to DeepSeek, which made headlines this year with models developed at a fraction of the cost of Western rivals, the author noted. The landmark deal also resolves months of speculation over Apple’s AI strategy in the region as the iPhone maker had been in talks with Chinese tech leaders including Baidu (BIDU), ByteDance and Tencent (TCEHY), Reuters and the Information have reported. After The Information initially reported that Apple partnered with Alibaba to bring Apple Intelligence features to iPhone users in China, Morgan Stanley said that the firm views the pact as “a critical catalyst for Apple’s competitive standing in China.” While acknowledging having no knowledge of Apple’s internal decisions, Alibaba is the largest e-commerce player in China, so it could have “a treasure trove of data that Apple could look to leverage in delivering personalized GenAI features to Chinese consumers,” says the analyst, who adds that the firm could also see a scenario where Apple creates an initial AI partnership with Alibaba that eventually expands to other local Chinese cloud players over time. Meanwhile, BofA analyst Wamsi Mohan noted that Apple’s smartphone share has been pressured in China, and while it was announced last year that Apple was partnering with Baidu for AI in China, Apple ended the project because Baidu’s models developed for Apple Intelligence were not up to Apple’s standards. The Alibaba partnership news shows Apple’s desire to swiftly launch AI features in China, BofA says. SENTIMENT: Among analysts tracked by Bloomberg that have updated their views on Alibaba within the last twelve months, 41 have Buy or equivalent ratings, eight have Hold or equivalent ratings and only one has a Sell or equivalent rating. The average twelve month price target of 30 of those analysts is $124.32. Check out recent Media Buzz Sentiment on Alibaba as measured by TipRanks. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See today’s best-performing stocks on TipRanks >> Read More on BABA: Alibaba price target raised to $125 from $110 at Baird Alibaba (BABA) Shares Climb after Xi Tells Tech Titans He Will Help Them Be “Competitive” Looking for Exposure to RGTI Stock? Try These Two ETFs BIDU Earnings: Baidu Revenues Slide Less than Expected as AI Rivalry Intensifies Alibaba (BABA) Will Report Earnings This Week. Here Is What to Expect"
    },
    {
        "title": "Apple unveils iPhone 16e, Arista reports Q4 beat: Morning Buzz",
        "publisher": "TipRanks",
        "publish_date": "2025-02-20 18:00:59",
        "link": "https://finance.yahoo.com/news/apple-unveils-iphone-16e-arista-170059313.html",
        "type": "STORY",
        "content": "Get caught up quickly on the top news and calls moving stocks with these five Top Five lists. See what stocks are receiving strong buy ratings from top-rated analysts. Filter, analyze, and streamline your search for investment opportunities with  TipRanks’ Stock Screener. 1. STOCK NEWS: Apple (AAPL) announced the iPhone 16e, available starting February 28 Arista Networks (ANET) reported better-than-expected Q4 results and provided upbeat Q1 revenue guidance Howard Hughes (HHH) confirmed receipt of an unsolicited takeover proposal from Pershing Square Analog Devices (ADI) reported upbeat Q1 results, raised its quarterly dividend by 8%, and boosted its share repurchase authorization by $10B Shift4 (FOUR) (GB) for $7.50 per share in cash 2. WALL STREET CALLS: BofA upgraded Capital One (COF) to Buy as it views the company being well positioned to benefit from the pending Discover (DFS) acquisition Mizuho upgraded Glaukos (GKOS) to Outperform Morgan Stanley downgraded Workday (WDAY) to Equal Weight Nomura downgraded Baidu (BIDU) to Neutral DA Davidson initiated coverage of Electronic Arts (EA) with a Neutral rating and Take-Two (TTWO) with a Buy 3. AROUND THE WEB: KKR (KKR) offered to inject $5B into Thames Water for a majority stake, Bloomberg says Milan prosecutors plan to drop a case brought against Google’s (GOOGL) European division after the company agreed to pay $340M to settle a tax claim, Reuters reports Airbnb (ABNB) is suing the City of New Orleans for requiring the company and other short-term rental platforms to ensure the properties they offer are in compliance with city laws, AP News reports Land & Buildings Investment Management is launching a proxy fight at National Health Investors (NHI) and is seeking to oust two board members, WSJ says BP (BP) is said to be weighing a potential sale of its Castrol-branded lubricants unit, which could be worth about $10B, Bloomberg reports 4. MOVERS: Hims & Hers (HIMS) gains after acquiring an at-home lab testing facility ImmunityBio (IBRX) higher after the FDA authorized the company to provide rBCG to urologists amid the shortages Compass (COMP) increases after reporting Q4 results and providing guidance for Q1 and FY25 Cinemark (CNK) and Global-e Online (GLBE) fall after reporting quarterly results Celanese (CE) lower after reporting Q4 results, with EPS and revenue beating consensus 5. EARNINGS/GUIDANCE: Etsy (ETSY) reported Q4 results, with EPS beating consensus Solar Edge (SEDG) reported Q4 results, with CEO Shuki Nir commenting, “We are just getting started on our turnaround story” WingStop (WING) reported Q4 results and provided guidance for FY25 Bumble (BMBL) reported Q4 results and provided guidance for Q1 Capri Holdings (CPRI) provided guidance for FY25 and FY26 INDEXES: Near midday, the Dow was down 0.22%, or 99.90, to 44,456.44, the Nasdaq was down 0.08%, or 15.03, to 20,026.23, and the S&P 500 was up 0.04%, or 2.16, to 6,131.74. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See the top stocks recommended by analysts >> Read More on KKR: KKR offers $5B for majority stake in Thames Water, Bloomberg says KKR clashes with FiberCop over EUR 449M earnings hole, FT says Delta flight crashes in Toronto, Southwest cuts corporate roles: Morning Buzz KKR enters into strategic partnership with EGC KKR enters partnership with EGC"
    },
    {
        "title": "Can the Latest iPhone 16e Push the Apple Stock Higher in 2025?",
        "publisher": "Zacks",
        "publish_date": "2025-02-20 17:32:00",
        "link": "https://finance.yahoo.com/news/latest-iphone-16e-push-apple-163200134.html",
        "type": "STORY",
        "content": "Apple AAPL expanded the iPhone 16 family with the launch of a cheaper iPhone 16e version powered by the latest A18 chip and supporting Apple Intelligence. iPhone 16e features the new Apple C1, the first cellular modem designed by Apple, and a 48MP Fusion camera with an integrated 2x Telephoto option.iPhone 16e is available in a 6.1-inch display size and has the best battery life ever on this display size offered by Apple. The iPhone 16e, available from Feb. 28, will cost $599 compared with $799 for iPhone 16 and $999 for iPhone 16 Pro. The affordable iPhone 16e is expected to boost Apple’s footprint in price-sensitive countries like China and India. Apple has been suffering from sluggish demand for the iPhone in China amid increasing competition from the likes of Huawei and Xiaomi, as well as the lack of Apple Intelligence. Although the iPhone 16e is still way pricier than devices like the Google Pixel 8A and OnePlus 12R, which cost below $500, the availability of Apple Intelligence can be a game changer. Although iPhone sales decreased 0.8% year over year to $69.14 billion in the first quarter of fiscal 2025, Apple saw better iPhone 16 sales in those regions where Apple Intelligence was available. iPhone’s active installed base grew to an all-time high and saw a record level of upgrades in the reported quarter. Per Kantar, the iPhone was a top-selling model in the United States, Urban China, India, the U.K., France, Australia and Japan.Apple launched the first set of Apple Intelligence features in U.S. English for iPhone, iPad and Mac, and introduced more features and expanded to more countries in December. Apple Intelligence is now available in Australia, Canada, New Zealand, South Africa and the U.K. Although Greater China sales decreased 11.1% year over year, Apple benefited from strong sales in a number of emerging markets, including India. In the first quarter of fiscal 2025, the iPhone was the top-selling model in the country. The company saw double-digit growth in the installed base in the emerging markets. Per Canalys’ latest data, Apple benefited from strong sales in emerging markets in the Asia-Pacific region in 2024. AAPL maintained its lead over Samsung for the second consecutive year, with a market share of 23% compared with the latter’s 16%. Xiaomi trailed both Apple and Samsung with 13% market share. According to Canalys, global smartphone shipments increased 7% year over year to $1.22 billion units in 2024. Apple shares have declined 2.3% year to date, underperforming the broader Zacks Computer & Technology sector’s appreciation of 2.1%.  Image Source: Zacks Investment Research  We believe the expanding launch of Apple Intelligence will drive further adoption of iPhone devices. In April, Apple is set to launch the next level of language updates with Apple Intelligence, including French, German, Italian, Portuguese, Spanish, Japanese, Korean, simplified Chinese, and localized English to Singapore and India. AAPL’s Services business is expected to drive top-line growth. It now has more than 1 billion paid subscribers across its Services portfolio, more than double what it had four years ago. The expanding content portfolio of Apple TV+, Apple Music and Apple Arcade, as well as the growing user base of Apple Pay, has helped drive subscriber growth.The Services business benefits from the growing demand for Apple TV+ content and the adoption of Apple Pay. It has expanded Tap to Pay on iPhone to more markets, including the U.A.E., Chile, Japan, Canada, Italy and Germany. Apple Pay is now available in countries like Egypt and Uruguay. The expanding content portfolio of Apple TV+ is noteworthy. Apple expects the March-end quarter’s (second-quarter fiscal 2025) revenues to grow low double digits on a year-over-year basis. The Zacks Consensus Estimate for Apple’s second-quarter fiscal 2025 earnings has declined 4.2% to $1.61 per share over the past 30 days, indicating 5.23% growth from the figure reported in the year-ago quarter.Apple’s earnings beat the Zacks Consensus Estimate in all the trailing four quarters, with the average earnings surprise being 4.39%. Apple Inc. price-consensus-chart | Apple Inc. Quote  Find the latest EPS estimates and surprises on Zacks Earnings Calendar. The AAPL stock is not so cheap, as the Value Score of D suggests a stretched valuation at this moment.Apple is trading at a premium with a forward 12-month P/E of 30.45X compared with the sector’s 26.88X and higher than the median of 29.85X, reflecting a stretched valuation. Image Source: Zacks Investment Research Apple’s AI push with Apple Intelligence is noteworthy. However, it is still playing catch-up with Microsoft MSFT, Alphabet GOOGL and Amazon AMZN.Although the Services business has emerged as AAPL’s new cash cow, with an expanding content portfolio for Apple TV+, we believe that Apple Intelligence will take some time to go mainstream.Hence, we believe that Apple’s near-term growth prospects do not justify a premium valuation.AAPL currently has a Zacks Rank #3 (Hold), suggesting that it may be wise to wait for a more favorable entry point in the stock. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research"
    },
    {
        "title": "In India, Apple's iPhone 16e faces stiff competition from older models",
        "publisher": "TechCrunch",
        "publish_date": "2025-02-20 19:20:17",
        "link": "https://finance.yahoo.com/m/57d649f1-9d08-3c12-8930-54f6bcbc5dd8/in-india%2C-apple%27s-iphone-16e.html",
        "type": "STORY",
        "content": "On Wednesday, Apple unveiled the iPhone 16e. The model replaces both the iPhone SE and iPhone 14 in the company's lineup. The new handset is the least expensive member of the iPhone 16 lineup, aiming at emerging markets including India. The world's second largest smartphone market (behind China) has fueled significant iPhone sales, with Apple recently cracking the top five vendors in India. A week ahead of the iPhone 16e's release, however, it's unclear what impact the device will have on this key market. In 2024, India became the fourth largest market for Apple, after the U.S., China, and Japan, seeing a record 12 million shipments during the quarter, with 35% YoY growth, per IDC. It is expected to cross the 15 million milestone this year. But it wasn't the iPhone SE or iPhone 14 that helped the Cupertino company succeed in the South Asian market. In fact, the iPhone 15 and iPhone 13 were the highest shipped models, with a 6% share of overall smartphone market in Q4. Even as Apple has expanded in India, the iPhone SE has seen a proportional decline. The iPhone SE (2020) represented 18% of overall iPhone shipments in its launch year, while the iPhone SE (2022) made up 6% of total shipments two years later, per IDC data shared exclusively with TechCrunch. In contrast, the iPhone 13 made up nearly 40% of iPhone shipments in 2022. According to IDC, iPhone SE shipments in India and globally declined to negligible volume in 2023 and 2024. Neither year saw a new SE release. Navkendar Singh, associate vice president at IDC India, tells TechCrunch that nearly two-thirds of iPhone volumes in India come from previous-generation models. Android dominates India's smartphone market, with an average smartphone of $259. Chinese brands such as Vivo, Oppo, and Xiaomi have made great strides in the market. However, the iPhone is still top dog in the $600+ market segment, followed by Samsung Galaxy smartphones. This means, in essence, that the iPhone's biggest competitor is other iPhones. The iPhone 16e starts at 59,900 Indian rupees (~$689) and goes up to $1,034. In contrast, the older iPhone 15 starts at $804 and iPhone 16 at $919. In a market like India, where older devices continue to sell, the price difference may not be enough to justify choosing the iPhone 16e over, say, the iPhone 15 given the features the budget phone sacrifices. What new features the 16e does offer may not be substantial enough to attract new buyers, given the popularity of the equated monthly installment (EMI) option, which allows users to purchase a high ticket item via installment payments. Roughly half of customers purchasing a premium handset in India ($400-700) opt to finance their devices this way. \"With EMI offers, the difference in real terms would make many prefer the iPhone 15 or 16 over the iPhone 16Ee\" Singh said. Apple has expanded Apple Intelligence to a more affordable segment with the iPhone 16e. This could help the company drive more Apple Services revenues over time. However, Apple Intelligence is currently in its infancy and in the U.S. and won't arrive in India until April. The 16e is Apple's latest iPhone to be assembled in India — alongside the other iPhone 16 models. However, local assembly isn't likely to impact the pricing — at least in the short term. Sanyam Chaurasia, a senior analyst at Canalys, believed that the iPhone 16e might help Apple attract customers who might otherwise pick up an iPhone 12 or 13 -- both of which are still available through retail channels in India. He added that younger users might also opt for the iPhone 16e, rather than the older 15. \"It's a model which serves a niche audience,\" Chaurasia said. Unlike other emerging markets such as Latin America and Southeast Asia, India is not a telco-driven market where carriers subsidize smartphones by bundling them with their plans. This makes the iPhone 16e a relatively expensive option for Indian buyers. The timing of launching the iPhone 16e also makes it less attractive as this is not an upgrade season, which usually falls around Indian festivals in the later part of the year, Chaurasia said. \"Apple is likely to have discounts on the iPhone 16e during the festive season later this year, but there would also be similar discounts on the existing iPhone models, making them even more attractive than this new model,\" he stated. This article originally appeared on TechCrunch at https://techcrunch.com/2025/02/20/in-india-apples-iphone-16e-faces-stiff-competition-from-older-models/"
    },
    {
        "title": "Apple Inc. (AAPL): Among the Best Long-Term Stocks to Buy According to Ken Fisher",
        "publisher": "Insider Monkey",
        "publish_date": "2025-02-20 19:08:30",
        "link": "https://finance.yahoo.com/news/apple-inc-aapl-among-best-180830245.html",
        "type": "STORY",
        "content": "We recently compiled a list of the 12 Best Long-Term Stocks to Buy According to Ken Fisher. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other long-term stocks. Ken Fisher is a prominent American billionaire investment analyst, author, and the founder of Fisher Asset Management, one of the biggest and most successful hedge funds in the world. Fisher was born in California in 1950. His net worth is estimated at over $11.2 billion, ranking him high on the list of richest Americans and global billionaires. Fisher's early life was influenced by his father, Philip A. Fisher, a renowned stock investor. He pursued higher education at California State Polytechnic University, Humboldt, graduating in 1972 with an associate degree in economics. In 1979, Fisher founded Fisher Investments, which has grown into a global financial advisory firm managing close to $252 billion in 13F securities. Read more about these developments by accessing 10 Best AI Data Center Stocks and 10 Buzzing AI Stocks According to Goldman Sachs. Fisher's influence extends beyond asset management. He authored the Portfolio Strategy column in Forbes from 1984 to 2016, making him the longest continuously running columnist in the magazine's history. Currently, he contributes monthly columns to major publications worldwide, including the New York Post, The Daily Telegraph, and The Australian, among others. In addition to his columns, Fisher has authored 11 books on investing, with four becoming New York Times bestsellers. His work has significantly influenced investment strategies and financial planning. Notably, he popularized the price-to-sales ratio as a stock analysis tool and has been involved in groundbreaking work in behavioral finance. Read more about these developments by accessing 30 Most Important AI Stocks According to BlackRock and Beyond the Tech Giants: 35 Non-Tech AI Opportunities. For this article, we selected stocks by combing through the 13F portfolio of Fisher Asset Management at the end of the fourth quarter of 2024. Only the companies that have been in the 13F portfolio of the fund consistently for the past three years were selected. These stocks are also popular among other hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). A wide view of an Apple store, showing the range of products the company offers. Number of Hedge Fund Holders: 166 Fisher Asset Management’s Stake: $14.8 billion Apple Inc. (NASDAQ:AAPL) is a consumer electronics firm. According to the fourth quarter of 2024, strong business performance in the September quarter generated nearly $27 billion in operating cash flow, enabling the company to return over $29 billion to the shareholders. In mid-February, Forbes reported that the company had released a new budget iPhone. The device comes with a price increase from the current $429 and features Apple Intelligence, along with a design similar to the iPhone 14. It is the first iPhone to include Apple’s in-house modem, a project the company has been working on for years. While Qualcomm has supplied modems for previous models and renewed its contract with Apple in September of the prior year, the company is gradually shifting toward its own technology. Overall AAPL ranks 1st on our list of the best long-term stocks to buy according to Ken Fisher. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.  READ NEXT: 20 Best AI Stocks To Buy Now and Complete List of 59 AI Companies Under $2 Billion in Market Cap  Disclosure: None. This article is originally published at Insider Monkey."
    },
    {
        "title": "Alibaba is 'big beneficiary' of AI with partnerships like Apple",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-02-20 19:01:52",
        "link": "https://finance.yahoo.com/video/alibaba-big-beneficiary-ai-partnerships-180152065.html",
        "type": "VIDEO",
        "content": "Alibaba (BABA) shares gain after announcing strong cloud sales in its fiscal third quarter and highlighting its artificial intelligence (AI) related gains. The Chinese e-commerce tech company is also in focus after announcing a partnership with Apple (AAPL) to bring Apple Intelligence features to iPhones in the Chinese market. Manhattan Venture Partners head of research Santosh Rao joins Catalysts Co-Hosts Seana Smith and Madison Mills to discuss why Alibaba stock is \"definitely\" a Buy in his view as \"a big beneficiary\" of AI. \"AI is going to help [Alibaba's] core business,\" the analyst says, explaining, \"They're using it for their advertising for their e-commerce and all that.\" \"AI is a must. Every company has to use that word ... [Alibaba] has partnerships with many key players\" like its new Apple partnership, Rao explains. \"Competitively [the company is] in a good position and needs to keep innovating, which it is, because the competition is right, nipping at their heels.\" To watch more expert insights and analysis on the latest market action, check out more Catalysts here. This post was written by Naomi Buchanan."
    },
    {
        "title": "American Airlines Joins Rivals in Integrating Apple AirTags to Track Lost Bags",
        "publisher": "Investopedia",
        "publish_date": "2025-02-20 18:57:05",
        "link": "https://finance.yahoo.com/m/f7f74cf9-490d-34b4-aa25-a56ef4054956/american-airlines-joins.html",
        "type": "STORY",
        "content": "Joe Raedle / Getty Images  American Airlines passengers who place Apple AirTags in their luggage will be able to submit location information to the airline. The goal is to reduce the amount of time it takes to reunite passengers with delayed bags, an American Airlines spokesperson said. Less than 1% of bags are mishandled, but American was among the worst offenders in November, according to DOT data.  American Airlines (AAL) has introduced a feature that allows customers who place Apple (AAPL) AirTags in their luggage to help the airline track down their lost bags. Passengers can generate a link through Apple's Share Item feature available on iOS 18.2 or later and share it with the airline if a bag is delayed, an American Airlines spokesperson said. Customers are \"usually reunited with their bag in just over a day\" and this integration is designed to reduce that time, the spokesperson said, adding \"that less than 1% of customers' checked bags are mishandled.\" The service is available for trips ending in the U.S., Puerto Rico, and the U.S. Virgin Islands, American said. American joins rivals Delta Air Lines (DAL) and United Airlines (UAL), which integrated AirTag functionality late last year. United and American were the two worst offenders among U.S. carriers in terms of mishandling bags in November, according to the Department of Transportation's Air Travel Consumer Report last month, mishandling 0.54% and 0.53% of bags, respectively. Shares of American Airlines, which slipped 2% to $15.68 intraday Thursday, are up 7% over the past 12 months. Last month, Jefferies analysts raised their price target to $20 from $12, and said the airline \"could see significant surprise to the upside in 2025.”\" Read the original article on Investopedia"
    },
    {
        "title": "Apple Speeds Up Hardware Shift, Phases Out Broadcom Wi-Fi Chips in iPhone 17",
        "publisher": "GuruFocus.com",
        "publish_date": "2025-02-20 18:42:36",
        "link": "https://finance.yahoo.com/news/apple-speeds-hardware-shift-phases-174236151.html",
        "type": "STORY",
        "content": "Apple (NASDAQ:AAPL) is moving faster toward replacing third-party hardware with its own, according to TF International Securities analyst Ming-Chi Kuo. The company now plans to use in-house Wi-Fi chips in all iPhone 17 models, phasing out chips from Broadcom (NASDAQ:AVGO). This follows Apple's confirmation on Wednesday that its upcoming iPhone 16e will feature an in-house modem chip, the C1, instead of relying on Qualcomm (NASDAQ:QCOM). Qualcomm has supplied Apple's modem chips for more than a decade. \"Following Qualcomm, Broadcom's Wi-Fi chips will also be replaced by Apple's in-house chips at a faster pace,\" Kuo posted on X Thursday. His latest research suggests that while only the slim iPhone 17 model will use Apple's C1 modem, all iPhone 17 models will feature Apple's in-house Wi-Fi chips. Beyond cost savings, Kuo noted the switch would enhance connectivity across Apple devices. However, Apple's shift to its own chips doesn't mean third-party suppliers are entirely out. Many of these components are already patented, and Apple continues to operate under licensing agreements. For instance, even though Apple is moving away from Qualcomm's modems, Qualcomm still earns royalties through a patent deal. This article first appeared on GuruFocus."
    },
    {
        "title": "What Wall Street experts are saying about Alibaba ahead of earnings",
        "publisher": "TipRanks",
        "publish_date": "2025-02-20 18:15:10",
        "link": "https://finance.yahoo.com/news/wall-street-experts-saying-alibaba-171510231.html",
        "type": "STORY",
        "content": "Alibaba Group (BABA) is scheduled to report results of its fiscal third quarter of FY24 before the U.S. market opens on Thursday, February 20, and will hold a conference call to discuss the results at 7:30 a.m. U.S. Eastern Time the same day. What to watch for: See what stocks are receiving strong buy ratings from top-rated analysts. Filter, analyze, and streamline your search for investment opportunities with  TipRanks’ Stock Screener. EXPECTATIONS: Current consensus adjusted EPS and revenue forecasts for Alibaba’s December-end quarter stand at $2.64 and $38.23B, respectively, according to data from Bloomberg. AI: Along with its last earnings report, Alibaba said growth in its Cloud business accelerated from prior quarters, with revenues from public cloud products growing in double digits and AI-related product revenue delivering triple-digit growth. “We are more confident in our core businesses than ever and will continue to invest in supporting long-term growth,” added Eddie Wu, Chief Executive Officer of Alibaba Group. In late January, Alibaba debuted the latest iteration of its artificial intelligence model, “claiming it surpasses DeepSeek’s AI model across various benchmarks,” wrote The Wall Street Journal‘s Kimberley Kao. “The company stated that Qwen2.5 Max “achieves competitive performance against the top-tier models,” referencing OpenAI’s GPT-4o, DeepSeek-V3 and Meta’s Llama-3.1-405B, based on its compiled comparison using various benchmark tests,” noted the WSJ story. Afterward, Goldman Sachs reiterated a Buy rating and $117 price target on Alibaba, noting that after three different Chinese AI model launches, Alibaba Cloud announced the launch of its latest multi-modal vision-language model Qwen2.5-VL, which is open source, just like DeepSeek’s Janus-Pro. The firm believes increasingly agile Chinese models and significant improvement in computing cost efficiencies could drive further room for wider adoption/exploration/proliferation of AI applications and potential for further global expansion for Chinese players. Goldman added that the stock’s then-current market cap had already priced in the unfavorable e-commerce competition. The buzz around DeepSeek, a Chinese-built large-language open-source model that claims to rival offerings from OpenAI’s ChatGPT and Meta Platforms (META) but using a much smaller budget, sent several technology stocks tumbling on January 27. DeepSeek’s new AI model was being praised for being cost-effective and capable of running on less-advanced chips, which raised questions about the high valuations of companies like Nvidia (NVDA). Jefferies views DeepSeek’s launch “as part of an ongoing evolution, not revolution” and called the selloff in software stocks “largely overdone.” Innovations which continue to drive increasing efficiency at inference, but also training, will further improve the return on investment of artificial intelligence, leading to faster software adoption, the analyst argued. Inference efficiency is part of an ongoing trend with DeepSeek and not as incremental as some lead to believe, according to Jefferies. On February 7, Alibaba denied reports that the company plans to invest in DeepSeek, a Chinese-built large-language open-source model that claims to rival offerings from Microsoft-backed (MSFT) OpenAI’s ChatGPT and Meta Platforms but using a much smaller budget, Reuters’ Brenda Goh reported. Citing Chinese news outlet The Paper, Goh said that Yan Qiao, a vice president at Alibaba, wrote on her personal WeChat feed that “as a fellow Chinese and Hangzhou company, we applaud DeepSeek, but news circulating that Alibaba will invest in DeepSeek is fake news.” Previous reports indicated Alibaba planned to invest $1B into DeepSeek. On February 10, after speaking with more than 100 investors over preceding few days, JPMorgan analyst Alex Yao said he sensed an “increasingly positive” sentiment on Alibaba shares, which the firm says was evidenced by a 13% share price rally in the prior five trading days. However, there are still mixed views and positions on the stock, which indicates “room for share price movement on both sides,” the analyst told investors at that time. JPMorgan believes investors are divided on the potential upside from Alibaba’s artificial intelligence initiatives and cloud business. The firm thinks demonstrating a concrete plan for monetizing AI capabilities “could alleviate investor concerns about the sustainability of the current rally.” JPMorgan has an Overweight rating on Alibaba with a $125 price target. APPLE PACT: Earlier this month, Reuters’ Casey Hall reported that Alibaba will partner with Apple (AAPL) to support iPhones’ AI services offering in China, citing confirmation from the Chinese company’s chairman. For Alibaba, the partnership is a major win in China’s competitive AI market that is home to DeepSeek, which made headlines this year with models developed at a fraction of the cost of Western rivals, the author noted. The landmark deal also resolves months of speculation over Apple’s AI strategy in the region as the iPhone maker had been in talks with Chinese tech leaders including Baidu (BIDU), ByteDance and Tencent (TCEHY), Reuters and the Information have reported. After The Information initially reported that Apple partnered with Alibaba to bring Apple Intelligence features to iPhone users in China, Morgan Stanley said that the firm views the pact as “a critical catalyst for Apple’s competitive standing in China.” While acknowledging having no knowledge of Apple’s internal decisions, Alibaba is the largest e-commerce player in China, so it could have “a treasure trove of data that Apple could look to leverage in delivering personalized GenAI features to Chinese consumers,” says the analyst, who adds that the firm could also see a scenario where Apple creates an initial AI partnership with Alibaba that eventually expands to other local Chinese cloud players over time. Meanwhile, BofA analyst Wamsi Mohan noted that Apple’s smartphone share has been pressured in China, and while it was announced last year that Apple was partnering with Baidu for AI in China, Apple ended the project because Baidu’s models developed for Apple Intelligence were not up to Apple’s standards. The Alibaba partnership news shows Apple’s desire to swiftly launch AI features in China, BofA says. SENTIMENT: Among analysts tracked by Bloomberg that have updated their views on Alibaba within the last twelve months, 41 have Buy or equivalent ratings, eight have Hold or equivalent ratings and only one has a Sell or equivalent rating. The average twelve month price target of 30 of those analysts is $124.32. Check out recent Media Buzz Sentiment on Alibaba as measured by TipRanks. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See today’s best-performing stocks on TipRanks >> Read More on BABA: Alibaba price target raised to $125 from $110 at Baird Alibaba (BABA) Shares Climb after Xi Tells Tech Titans He Will Help Them Be “Competitive” Looking for Exposure to RGTI Stock? Try These Two ETFs BIDU Earnings: Baidu Revenues Slide Less than Expected as AI Rivalry Intensifies Alibaba (BABA) Will Report Earnings This Week. Here Is What to Expect"
    },
    {
        "title": "Apple unveils iPhone 16e, Arista reports Q4 beat: Morning Buzz",
        "publisher": "TipRanks",
        "publish_date": "2025-02-20 18:00:59",
        "link": "https://finance.yahoo.com/news/apple-unveils-iphone-16e-arista-170059313.html",
        "type": "STORY",
        "content": "Get caught up quickly on the top news and calls moving stocks with these five Top Five lists. See what stocks are receiving strong buy ratings from top-rated analysts. Filter, analyze, and streamline your search for investment opportunities with  TipRanks’ Stock Screener. 1. STOCK NEWS: Apple (AAPL) announced the iPhone 16e, available starting February 28 Arista Networks (ANET) reported better-than-expected Q4 results and provided upbeat Q1 revenue guidance Howard Hughes (HHH) confirmed receipt of an unsolicited takeover proposal from Pershing Square Analog Devices (ADI) reported upbeat Q1 results, raised its quarterly dividend by 8%, and boosted its share repurchase authorization by $10B Shift4 (FOUR) (GB) for $7.50 per share in cash 2. WALL STREET CALLS: BofA upgraded Capital One (COF) to Buy as it views the company being well positioned to benefit from the pending Discover (DFS) acquisition Mizuho upgraded Glaukos (GKOS) to Outperform Morgan Stanley downgraded Workday (WDAY) to Equal Weight Nomura downgraded Baidu (BIDU) to Neutral DA Davidson initiated coverage of Electronic Arts (EA) with a Neutral rating and Take-Two (TTWO) with a Buy 3. AROUND THE WEB: KKR (KKR) offered to inject $5B into Thames Water for a majority stake, Bloomberg says Milan prosecutors plan to drop a case brought against Google’s (GOOGL) European division after the company agreed to pay $340M to settle a tax claim, Reuters reports Airbnb (ABNB) is suing the City of New Orleans for requiring the company and other short-term rental platforms to ensure the properties they offer are in compliance with city laws, AP News reports Land & Buildings Investment Management is launching a proxy fight at National Health Investors (NHI) and is seeking to oust two board members, WSJ says BP (BP) is said to be weighing a potential sale of its Castrol-branded lubricants unit, which could be worth about $10B, Bloomberg reports 4. MOVERS: Hims & Hers (HIMS) gains after acquiring an at-home lab testing facility ImmunityBio (IBRX) higher after the FDA authorized the company to provide rBCG to urologists amid the shortages Compass (COMP) increases after reporting Q4 results and providing guidance for Q1 and FY25 Cinemark (CNK) and Global-e Online (GLBE) fall after reporting quarterly results Celanese (CE) lower after reporting Q4 results, with EPS and revenue beating consensus 5. EARNINGS/GUIDANCE: Etsy (ETSY) reported Q4 results, with EPS beating consensus Solar Edge (SEDG) reported Q4 results, with CEO Shuki Nir commenting, “We are just getting started on our turnaround story” WingStop (WING) reported Q4 results and provided guidance for FY25 Bumble (BMBL) reported Q4 results and provided guidance for Q1 Capri Holdings (CPRI) provided guidance for FY25 and FY26 INDEXES: Near midday, the Dow was down 0.22%, or 99.90, to 44,456.44, the Nasdaq was down 0.08%, or 15.03, to 20,026.23, and the S&P 500 was up 0.04%, or 2.16, to 6,131.74. Published first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>> See the top stocks recommended by analysts >> Read More on KKR: KKR offers $5B for majority stake in Thames Water, Bloomberg says KKR clashes with FiberCop over EUR 449M earnings hole, FT says Delta flight crashes in Toronto, Southwest cuts corporate roles: Morning Buzz KKR enters into strategic partnership with EGC KKR enters partnership with EGC"
    },
    {
        "title": "Can the Latest iPhone 16e Push the Apple Stock Higher in 2025?",
        "publisher": "Zacks",
        "publish_date": "2025-02-20 17:32:00",
        "link": "https://finance.yahoo.com/news/latest-iphone-16e-push-apple-163200134.html",
        "type": "STORY",
        "content": "Apple AAPL expanded the iPhone 16 family with the launch of a cheaper iPhone 16e version powered by the latest A18 chip and supporting Apple Intelligence. iPhone 16e features the new Apple C1, the first cellular modem designed by Apple, and a 48MP Fusion camera with an integrated 2x Telephoto option.iPhone 16e is available in a 6.1-inch display size and has the best battery life ever on this display size offered by Apple. The iPhone 16e, available from Feb. 28, will cost $599 compared with $799 for iPhone 16 and $999 for iPhone 16 Pro. The affordable iPhone 16e is expected to boost Apple’s footprint in price-sensitive countries like China and India. Apple has been suffering from sluggish demand for the iPhone in China amid increasing competition from the likes of Huawei and Xiaomi, as well as the lack of Apple Intelligence. Although the iPhone 16e is still way pricier than devices like the Google Pixel 8A and OnePlus 12R, which cost below $500, the availability of Apple Intelligence can be a game changer. Although iPhone sales decreased 0.8% year over year to $69.14 billion in the first quarter of fiscal 2025, Apple saw better iPhone 16 sales in those regions where Apple Intelligence was available. iPhone’s active installed base grew to an all-time high and saw a record level of upgrades in the reported quarter. Per Kantar, the iPhone was a top-selling model in the United States, Urban China, India, the U.K., France, Australia and Japan.Apple launched the first set of Apple Intelligence features in U.S. English for iPhone, iPad and Mac, and introduced more features and expanded to more countries in December. Apple Intelligence is now available in Australia, Canada, New Zealand, South Africa and the U.K. Although Greater China sales decreased 11.1% year over year, Apple benefited from strong sales in a number of emerging markets, including India. In the first quarter of fiscal 2025, the iPhone was the top-selling model in the country. The company saw double-digit growth in the installed base in the emerging markets. Per Canalys’ latest data, Apple benefited from strong sales in emerging markets in the Asia-Pacific region in 2024. AAPL maintained its lead over Samsung for the second consecutive year, with a market share of 23% compared with the latter’s 16%. Xiaomi trailed both Apple and Samsung with 13% market share. According to Canalys, global smartphone shipments increased 7% year over year to $1.22 billion units in 2024. Apple shares have declined 2.3% year to date, underperforming the broader Zacks Computer & Technology sector’s appreciation of 2.1%.  Image Source: Zacks Investment Research  We believe the expanding launch of Apple Intelligence will drive further adoption of iPhone devices. In April, Apple is set to launch the next level of language updates with Apple Intelligence, including French, German, Italian, Portuguese, Spanish, Japanese, Korean, simplified Chinese, and localized English to Singapore and India. AAPL’s Services business is expected to drive top-line growth. It now has more than 1 billion paid subscribers across its Services portfolio, more than double what it had four years ago. The expanding content portfolio of Apple TV+, Apple Music and Apple Arcade, as well as the growing user base of Apple Pay, has helped drive subscriber growth.The Services business benefits from the growing demand for Apple TV+ content and the adoption of Apple Pay. It has expanded Tap to Pay on iPhone to more markets, including the U.A.E., Chile, Japan, Canada, Italy and Germany. Apple Pay is now available in countries like Egypt and Uruguay. The expanding content portfolio of Apple TV+ is noteworthy. Apple expects the March-end quarter’s (second-quarter fiscal 2025) revenues to grow low double digits on a year-over-year basis. The Zacks Consensus Estimate for Apple’s second-quarter fiscal 2025 earnings has declined 4.2% to $1.61 per share over the past 30 days, indicating 5.23% growth from the figure reported in the year-ago quarter.Apple’s earnings beat the Zacks Consensus Estimate in all the trailing four quarters, with the average earnings surprise being 4.39%. Apple Inc. price-consensus-chart | Apple Inc. Quote  Find the latest EPS estimates and surprises on Zacks Earnings Calendar. The AAPL stock is not so cheap, as the Value Score of D suggests a stretched valuation at this moment.Apple is trading at a premium with a forward 12-month P/E of 30.45X compared with the sector’s 26.88X and higher than the median of 29.85X, reflecting a stretched valuation. Image Source: Zacks Investment Research Apple’s AI push with Apple Intelligence is noteworthy. However, it is still playing catch-up with Microsoft MSFT, Alphabet GOOGL and Amazon AMZN.Although the Services business has emerged as AAPL’s new cash cow, with an expanding content portfolio for Apple TV+, we believe that Apple Intelligence will take some time to go mainstream.Hence, we believe that Apple’s near-term growth prospects do not justify a premium valuation.AAPL currently has a Zacks Rank #3 (Hold), suggesting that it may be wise to wait for a more favorable entry point in the stock. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here. Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report Amazon.com, Inc. (AMZN) : Free Stock Analysis Report Apple Inc. (AAPL) : Free Stock Analysis Report Microsoft Corporation (MSFT) : Free Stock Analysis Report Alphabet Inc. (GOOGL) : Free Stock Analysis Report To read this article on Zacks.com click here. Zacks Investment Research"
    },
    {
        "title": "In India, Apple's iPhone 16e faces stiff competition from older models",
        "publisher": "TechCrunch",
        "publish_date": "2025-02-20 19:20:17",
        "link": "https://finance.yahoo.com/m/57d649f1-9d08-3c12-8930-54f6bcbc5dd8/in-india%2C-apple%27s-iphone-16e.html",
        "type": "STORY",
        "content": "On Wednesday, Apple unveiled the iPhone 16e. The model replaces both the iPhone SE and iPhone 14 in the company's lineup. The new handset is the least expensive member of the iPhone 16 lineup, aiming at emerging markets including India. The world's second largest smartphone market (behind China) has fueled significant iPhone sales, with Apple recently cracking the top five vendors in India. A week ahead of the iPhone 16e's release, however, it's unclear what impact the device will have on this key market. In 2024, India became the fourth largest market for Apple, after the U.S., China, and Japan, seeing a record 12 million shipments during the quarter, with 35% YoY growth, per IDC. It is expected to cross the 15 million milestone this year. But it wasn't the iPhone SE or iPhone 14 that helped the Cupertino company succeed in the South Asian market. In fact, the iPhone 15 and iPhone 13 were the highest shipped models, with a 6% share of overall smartphone market in Q4. Even as Apple has expanded in India, the iPhone SE has seen a proportional decline. The iPhone SE (2020) represented 18% of overall iPhone shipments in its launch year, while the iPhone SE (2022) made up 6% of total shipments two years later, per IDC data shared exclusively with TechCrunch. In contrast, the iPhone 13 made up nearly 40% of iPhone shipments in 2022. According to IDC, iPhone SE shipments in India and globally declined to negligible volume in 2023 and 2024. Neither year saw a new SE release. Navkendar Singh, associate vice president at IDC India, tells TechCrunch that nearly two-thirds of iPhone volumes in India come from previous-generation models. Android dominates India's smartphone market, with an average smartphone of $259. Chinese brands such as Vivo, Oppo, and Xiaomi have made great strides in the market. However, the iPhone is still top dog in the $600+ market segment, followed by Samsung Galaxy smartphones. This means, in essence, that the iPhone's biggest competitor is other iPhones. The iPhone 16e starts at 59,900 Indian rupees (~$689) and goes up to $1,034. In contrast, the older iPhone 15 starts at $804 and iPhone 16 at $919. In a market like India, where older devices continue to sell, the price difference may not be enough to justify choosing the iPhone 16e over, say, the iPhone 15 given the features the budget phone sacrifices. What new features the 16e does offer may not be substantial enough to attract new buyers, given the popularity of the equated monthly installment (EMI) option, which allows users to purchase a high ticket item via installment payments. Roughly half of customers purchasing a premium handset in India ($400-700) opt to finance their devices this way. \"With EMI offers, the difference in real terms would make many prefer the iPhone 15 or 16 over the iPhone 16Ee\" Singh said. Apple has expanded Apple Intelligence to a more affordable segment with the iPhone 16e. This could help the company drive more Apple Services revenues over time. However, Apple Intelligence is currently in its infancy and in the U.S. and won't arrive in India until April. The 16e is Apple's latest iPhone to be assembled in India — alongside the other iPhone 16 models. However, local assembly isn't likely to impact the pricing — at least in the short term. Sanyam Chaurasia, a senior analyst at Canalys, believed that the iPhone 16e might help Apple attract customers who might otherwise pick up an iPhone 12 or 13 -- both of which are still available through retail channels in India. He added that younger users might also opt for the iPhone 16e, rather than the older 15. \"It's a model which serves a niche audience,\" Chaurasia said. Unlike other emerging markets such as Latin America and Southeast Asia, India is not a telco-driven market where carriers subsidize smartphones by bundling them with their plans. This makes the iPhone 16e a relatively expensive option for Indian buyers. The timing of launching the iPhone 16e also makes it less attractive as this is not an upgrade season, which usually falls around Indian festivals in the later part of the year, Chaurasia said. \"Apple is likely to have discounts on the iPhone 16e during the festive season later this year, but there would also be similar discounts on the existing iPhone models, making them even more attractive than this new model,\" he stated. This article originally appeared on TechCrunch at https://techcrunch.com/2025/02/20/in-india-apples-iphone-16e-faces-stiff-competition-from-older-models/"
    },
    {
        "title": "Apple Inc. (AAPL): Among the Best Long-Term Stocks to Buy According to Ken Fisher",
        "publisher": "Insider Monkey",
        "publish_date": "2025-02-20 19:08:30",
        "link": "https://finance.yahoo.com/news/apple-inc-aapl-among-best-180830245.html",
        "type": "STORY",
        "content": "We recently compiled a list of the 12 Best Long-Term Stocks to Buy According to Ken Fisher. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other long-term stocks. Ken Fisher is a prominent American billionaire investment analyst, author, and the founder of Fisher Asset Management, one of the biggest and most successful hedge funds in the world. Fisher was born in California in 1950. His net worth is estimated at over $11.2 billion, ranking him high on the list of richest Americans and global billionaires. Fisher's early life was influenced by his father, Philip A. Fisher, a renowned stock investor. He pursued higher education at California State Polytechnic University, Humboldt, graduating in 1972 with an associate degree in economics. In 1979, Fisher founded Fisher Investments, which has grown into a global financial advisory firm managing close to $252 billion in 13F securities. Read more about these developments by accessing 10 Best AI Data Center Stocks and 10 Buzzing AI Stocks According to Goldman Sachs. Fisher's influence extends beyond asset management. He authored the Portfolio Strategy column in Forbes from 1984 to 2016, making him the longest continuously running columnist in the magazine's history. Currently, he contributes monthly columns to major publications worldwide, including the New York Post, The Daily Telegraph, and The Australian, among others. In addition to his columns, Fisher has authored 11 books on investing, with four becoming New York Times bestsellers. His work has significantly influenced investment strategies and financial planning. Notably, he popularized the price-to-sales ratio as a stock analysis tool and has been involved in groundbreaking work in behavioral finance. Read more about these developments by accessing 30 Most Important AI Stocks According to BlackRock and Beyond the Tech Giants: 35 Non-Tech AI Opportunities. For this article, we selected stocks by combing through the 13F portfolio of Fisher Asset Management at the end of the fourth quarter of 2024. Only the companies that have been in the 13F portfolio of the fund consistently for the past three years were selected. These stocks are also popular among other hedge funds. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here). A wide view of an Apple store, showing the range of products the company offers. Number of Hedge Fund Holders: 166 Fisher Asset Management’s Stake: $14.8 billion Apple Inc. (NASDAQ:AAPL) is a consumer electronics firm. According to the fourth quarter of 2024, strong business performance in the September quarter generated nearly $27 billion in operating cash flow, enabling the company to return over $29 billion to the shareholders. In mid-February, Forbes reported that the company had released a new budget iPhone. The device comes with a price increase from the current $429 and features Apple Intelligence, along with a design similar to the iPhone 14. It is the first iPhone to include Apple’s in-house modem, a project the company has been working on for years. While Qualcomm has supplied modems for previous models and renewed its contract with Apple in September of the prior year, the company is gradually shifting toward its own technology. Overall AAPL ranks 1st on our list of the best long-term stocks to buy according to Ken Fisher. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for a stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.  READ NEXT: 20 Best AI Stocks To Buy Now and Complete List of 59 AI Companies Under $2 Billion in Market Cap  Disclosure: None. This article is originally published at Insider Monkey."
    }
]