[
    {
        "title": "Nasdaq Seeks SEC Approval for CoinShares' XRP, Litecoin ETFs",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 23:40:34",
        "link": "https://finance.yahoo.com/m/481e0920-ceea-363c-b194-99a6ddd87612/nasdaq-seeks-sec-approval-for.html",
        "type": "STORY",
        "content": "The Nasdaq stock exchange is seeking approval to list and trade XRP and Litecoin exchange-traded funds from CoinShares, adding to a wave of new crypto ETF applications. A Friday filing with the Securities and Exchange Commission comes as multiple firms look to introduce crypto ETFs beyond bitcoin, with Cboe submitting applications the same day for XRP funds from Bitwise, WisdomTree, Canary and 21Shares. The applications reflect financial services firms' efforts to meet rising investor demand for crypto-focused products. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up The push for new products comes amid changing regulatory dynamics at the SEC. Under acting Chair Mark Uyeda, the agency appears more open to considering crypto ETFs than it was under his predecessor, Gary Gensler. This regulatory evolution has prompted asset managers to explore opportunities beyond bitcoin-focused products. XRP's path to ETF approval faces unique challenges. The token has been at the center of a long-running legal battle with the SEC, which claimed it was sold as an unregistered security. While Ripple Labs, the creator and developer of the XRP token, secured a partial victory in 2023 when a federal judge ruled that XRP programmatic sales to exchanges that sell to retail investors did not break securities law (XRP is not a security according to this ruling), regulatory uncertainty persists, potentially complicating the SEC's decision. The filings mark the latest development in crypto's integration with traditional finance. Last week, Grayscale's Solana and Litecoin ETF applications were officially acknowledged by the SEC, following the firm's success in converting its bitcoin trust to an ETF. Under CoinShares' proposal, the XRP ETF would track the Compass Crypto Reference Index XRP while the Litecoin ETF would follow a separate Litecoin index from the same provider. Both funds would allow investors to access these cryptocurrencies through their regular brokerage accounts. According to the filings, both proposed ETFs would hold only their respective cryptocurrencies and cash, prohibiting any yield generation or staking. If approved, these funds could broaden institutional access to alternative cryptocurrencies. Spot bitcoin ETFs have grown at a record pace since they received SEC approval on Jan. 10, 2024, generating nearly $41 billion in inflows, according to UK-based asset manager Farside Investors. Their success has underscored the wider embrace of traditional finance services firms for digital assets and helped send bitcoin and other cryptos to new highs. Bitcoin has been hovering just below $100,000, off its all-time high of roughly $109,000 last month but more than double its level of a year ago, according to crypto markets data provider CoinMarketCap. XRP was recently trading at about $2.43, up more than quadrupled over the past year, while Litecoin was changing hands at roughly $110, a 69% increase from a year ago.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Traders Bet Big on Solana, XRP ETF Approvals in 2025",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 15:00:00",
        "link": "https://finance.yahoo.com/m/487ea23c-182e-30e4-8ce7-f7dcf5edc27a/traders-bet-big-on-solana%2C.html",
        "type": "STORY",
        "content": "This article is the second in a weekly series in February highlighting the growing influence and popularity of cryptocurrency-based ETFs. Traders are pouring money into bets on crypto ETF approvals this year, with prediction markets showing high confidence in multiple digital assets gaining regulatory green-lights. The betting activity reflects market expectations as the Securities and Exchange Commission considers a wave of new cryptocurrency investment products, suggesting traders believe regulatory barriers may ease in the coming months. According to data from Polymarket, a decentralized prediction platform, traders see an 85% chance of a Solana ETF gaining approval in 2025, though near-term odds for July 31 approval sit lower at 39%. These predictions come amid broader changes in the crypto ETF landscape, with the SEC recently acknowledging multiple new applications and showing increased openness to digital asset investment products, based on regulatory filings. For Litecoin, the gap between time frames appears smaller, with a 79% probability for 2025 approval compared to 44% by July 31, according to the Polymarket data. XRP shows a similar divergence in trader confidence, with 80% odds for 2025 approval versus 40% for July 31, highlighting how betting patterns favor year-end over midyear approvals. Memecoins face a more uncertain path, with Dogecoin ETF approval odds at 54% for 2025 and dropping to 29% for July 31, while Pepecoin remains a long shot at just 7% for the year, Polymarket data show. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up Trading volumes on these prediction markets indicate serious money backing these bets, with Solana ETF markets showing a combined $267,000 in volume, while XRP markets have attracted a combined $137,000 in bets, according to Polymarket. Despite lower approval odds, Dogecoin ETF markets lead in trading volume with $450,000 in combined bets. Market activity shows distinct patterns across different cryptocurrency categories, with an unexpected twist—while traders assign higher approval odds to established blockchain platforms, the memecoin Dogecoin has attracted the highest trading volume. This suggests a disconnect between predicted outcomes and trader interest, particularly in more speculative assets. The stark contrast between July and year-end odds suggests traders expect most approvals to come in the latter half of 2025, with probabilities nearly doubling when extending beyond the summer deadline.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Cryptocurrency Futures Exchange for Physical (EFP) Transactions",
        "publisher": "CME Group",
        "publish_date": "2025-02-07 21:51:00",
        "link": "https://finance.yahoo.com/news/cryptocurrency-futures-exchange-physical-efp-205100910.html",
        "type": "STORY",
        "content": "What is an EFP? What else do I need to know about EFPs? Benefits of an EFP Transaction How would this work for cryptocurrency? How do I get started? Why use our futures for cryptocurrency exposure? Exchange for Physical (EFP) transactions are privately negotiated trades between two counterparties allowing them to simultaneously transfer a futures position for an equivalent spot market position or vice versa. Back to Top Governed by Exchange Rule 538. Examples of an equivalent spot market position may include but are not limited to physical cryptocurrency, cryptocurrency ETFs and NDFs, etc. No minimum trade size; price increments must be in appropriate tick size, $5 per bitcoin or $0.50 per ether. Must be executed at commercially reasonable prices that are mutually agreed upon by the parties to the transaction. The futures leg should be reported as soon as possible but not later than the end of the business day on which the EFP was executed. Anyone can trade (no eligible party restriction). Parties to an EFP are required to prepare and maintain all documents in connection with both the futures and related physical cryptocurrency position pursuant to CFTC Regulation 1.35. Participants to an EFP can negotiate directly or can use a broker to help find the other side of the trade. Back to Top Added convenience of private negotiation. Risk management with CME Clearing, one of the world’s leading central counterparty clearing providers. Tried, tested and straightforward trading method for parties with complementary objectives. Available at all times, including weekends. Back to Top Clients can use the mechanism to efficiently transfer their cryptocurrency exposure from a physical to a futures position depending on their specific goals. Working through a broker or directly with each other, two parties agree to trade cryptocurrency between themselves; the two parties also agree to exchange an equivalent position in our Bitcoin/Ether futures that is opposite in direction to their respective physical cryptocurrency transaction. The spot market transaction can be bi-laterally negotiated and consummated on an OTC platform while the futures piece is cleared through CME Direct. Why enter into a cryptocurrency EFP transaction?  Who can benefit?  How can an EFP help? Monetize a long cryptocurrency position Miners, Commercials, All By selling physical cryptocurrency and buying an equivalent futures position, clients are able to free-up capital and yet maintain exposure to cryptocurrency price movements. Unwind a futures – spot cryptocurrency spread trade HFs, Props, CTAs, Retail Clients who are trying to benefit from a price dislocation between the spot and futures markets can use an EFP to close out the position and lock-in the spread. Manage cryptocurrency exposure during weekends/holidays All Futures trade electronically 23 hours a day from Sunday at 5:00 p.m. CT to Friday 4:00 p.m. CT. To manage risk when we are closed, clients can trade cryptocurrency in the spot market and EFP to futures. Cover a short cryptocurrency position OTC Desks, HFs, CTAs, Props A client who is short cryptocurrency and whose borrow has been called can use an EFP to access cryptocurrency to deliver against the short physical position and still remain short through the futures market. Source cryptocurrency to lend out OTC Desks, HFs, CTAs, Props Clients who do not have cryptocurrency inventory to lend out can use an EFP to source physical cryptocurrency, lend it, collect the lending fee and maintain market neutrality. Protect a cryptocurrency loan OTC Desks, Miners, All Clients who have loaned out their cryptocurrency inventory can use an EFP to hedge the risk of their cryptocurrency not being returned. Improved capital efficiencies Miners, All A key benefit of futures is the leverage they offer. By using an EFP, clients are able to free up capital for use in other alpha-generating strategies. Party B agrees to sell 500 bitcoin to Party A and buy 100 bitcoin futures from Party A (economically, both parties are risk neutral). Additionally, the two parties agree to a spread of $5 between the spot and futures price. If bitcoin is at $6,500 Party B receives $3,250,000 on the sale of bitcoin to Party A. Simultaneously, Party B buys the futures contracts from Party A at a price of $6,495 ($6,500 - $5). For the futures contract, Party B would need to maintain, at least, 37% margin* or $1,201,575. The difference between the bitcoin sale price and the margin that needs to be posted is freed up capital and may be used by Party B as needed. By using an EFP, Party B benefits from the leverage offered through the futures contract and is able to free up $2,048,425 while still maintaining exposure to bitcoin. *Represents exchange minimum, subject to change, clearing firms may require a higher amount Back to Top Establish a clearing account with one or more of the two plus dozen FCMs (Futures Commission Merchants) currently supporting the contracts. Download CME Direct platform. Register for ClearPort. Assign traders and brokers. Back to Top No need to establish a wallet; eliminates hacking risk. Easily convert cryptocurrency exposure to USD. No actual movement of cryptocurrency. Do not need possession of cryptocurrency to sell (or to borrow cryptocurrency to sell short). Price transparency, leverage, liquidity and capital efficiencies. Trade on a regulated, established Exchange. USD-settled contracts to reliable benchmark rates. View our suite of Cryptocurrency products. Back to Top Cryptocurrencies   Article   Product Information   Bitcoin All examples in this report are hypothetical interpretations of situations and are used for explanation purposes only. The views in this report reflect solely those of the author and not necessarily those of CME Group or its affiliated institutions. This report and the information herein should not be considered investment advice or the results of actual market experience. Derivatives are not suitable for all investors and involve the risk of losing more than the amount originally deposited and any profit you might have made.  This communication is not a recommendation or offer to buy, sell or retain any specific investment or service. All examples in this report are hypothetical interpretations of situations and are used for explanation purposes only. The views in this report reflect solely those of the author and not necessarily those of CME Group or its affiliated institutions. This report and the information herein should not be considered investment advice or the results of actual market experience. CME Group Inc. does not have control over the content, accuracy, quality, or legality, of any third-party product, service, or content advertised on this webpage. The presence of such advertisements on this webpage does not signify any association, partnership, or endorsement of the third-party or its content by CME Group Inc. Full disclaimer Copyright © 2025 CME Group Inc."
    },
    {
        "title": "Be careful what you wish for on crypto regulation, this bear says",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-28 19:50:00",
        "link": "https://finance.yahoo.com/video/careful-wish-crypto-regulation-bear-185000137.html",
        "type": "VIDEO",
        "content": "Bitcoin (BTC-USD) rebounds from the pricing pullback the cryptocurrency saw over the last two days, the coin now back trading above $100,000. Innovating Capital founder and general partner Anthony Georgiades joins Catalysts with Seana Smith and Alexandra Canal to discuss his outlook on bitcoin and the crypto space. Georgiades explains he's more bearish than some on crypto: \"We're seeing obviously a lot of risk on sentiment. Things are priced to perfection ... It's not to say that I am skeptical or anti [to] the crypto progressive regulation that we're seeing, but I think it's one of those things where we need to be careful what we wish for with respect to things like a strategic reserve and certain legislative oversight.\" He says that while Innovating Capital is a long-term bitcoin holder, \"I do think that the market has priced in a lot of the positive catalysts over the last several months, and there's still a lot of risk on behavior tied to bitcoin as an asset,\" highlighting the crypto asset's downward moves. \"Generally speaking, I think the market's priced in a lot of potential friendly regulation and the probability of certain catalysts like a reserve taking place, whereas frankly speaking, the underlying fundamental behavior for a lot of that to actually make its way and permeate through the market, it's going to take years,\" Georgiades. Watch the video above to hear more about Georgiades' concerns about XRP (XRP-USD) and Ripple's RLUSD (RLUSD-USD) stablecoin. To watch more expert insights and analysis on the latest market action, check out more Catalysts here. This post was written by Naomi Buchanan."
    },
    {
        "title": "JP Morgan: SEC Crypto Shift May Usher in Solana, XRP ETPs",
        "publisher": "etf.com",
        "publish_date": "2025-01-15 15:00:00",
        "link": "https://finance.yahoo.com/m/51fda3bf-9e16-32c1-a2e4-b76d947d26e7/jp-morgan%3A-sec-crypto-shift.html",
        "type": "STORY",
        "content": "Solana and XRP could be next in line for spot cryptocurrency exchange-traded products, though analysts expect more modest asset inflows compared to bitcoin's success, according to a new J.P. Morgan Research report. The anticipated regulatory changes in 2025, including a new Securities and Exchange Commission chair and potential legislation clarifying crypto asset classification, could pave the way for the next wave of cryptocurrency ETPs—though J.P. Morgan analysts Kenneth B. Worthington, Michael Cho, Alexander Bernstein and Madeline Daleiden cautioned that investors demand for these “altcoin” products may be limited compared to bitcoin and Ethereum offerings. After the successful launch of bitcoin ETPs that gathered $36.5 billion in their first year, J.P. Morgan estimates potential Solana ETPs could attract $3 billion to $6 billion in assets, while XRP products might draw $4 billion to $8 billion, according to the report published Monday. These more modest projections reflect the smaller market capitalization of these tokens compared to bitcoin and Ethereum, the report noted, with Ethereum’s market cap roughly three to four times larger than both Solana and XRP. Several firms have already positioned themselves for potential approval, with Grayscale operating a $99 million Solana trust and a $12 million XRP trust that could convert to exchange-traded fundss, similar to its previous bitcoin trust conversion, according to the analysts. The report indicates multiple ETP applications for tokens like Solana have already been rejected by the current SEC, but firms may resubmit under new leadership that could take a more favorable stance toward crypto innovation. The new regulatory environment appears crucial for future approvals, the analysts write, as debate continues at the SEC around what constitutes a security versus a commodity—a key distinction that has delayed \"altcoin\" ETP applications. “Outside of a few primary tokens (i.e BTC, ETH, SOL), the episodic nature of the cryptomarket is driven by varying investor sentiment and trendy new coins that may capture incremental attention for a limited time,” the report stated. BlackRock Inc.’s decision not to pursue a Solona ETP due to uncertain investor demand highlights the challenges ahead, the analysts said, suggesting the broader crypto market’s breadth may outweigh individual token depth beyond the largest cryptocurrencies. The report suggested the recently approved bitcoin and Ethereum hybrid ETP products from Franklin Templeton and Hashdex, possibly set to launch this month with an 80/20 split matching market caps, could provide a template for future multi-token products. Market fundamentals will likely determine the success of new crypto ETPs in 2025, with J.P. Morgan analysts noting that Ethereum ETP assets currently represent just 3% of the token's $12 billion total market cap six months after launch, compared to bitcoin ETP assets reaching 6% of bitcoin’s $108 billion market cap in their first year.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Bitcoin ETFs see a record 4 days of outflows",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-14 17:24:00",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-see-record-4-162400200.html",
        "type": "VIDEO",
        "content": "Bitcoin ETFs see a record four days of outflows. Madison Mills joins Morning Brief to outline what investors need to know. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here. This post was written by Naomi Buchanan."
    },
    {
        "title": "Bitcoin ETFs see $36B in net inflows in first year",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-13 18:34:57",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-see-36b-net-173457022.html",
        "type": "VIDEO",
        "content": "The first spot bitcoin ETFs are approaching their one-year trading anniversary, attracting more than $36 billion in net inflows during this period. Yahoo Finance Markets & Data Editor Jared Blikre analyzes the digital asset's performance over the past year, highlighting the most significant gains and losses within the cryptocurrency space. To watch more expert insights and analysis on the latest market action, check out more Wealth here. This post was written by Angel Smith"
    },
    {
        "title": "Bitcoin ETFs hit $100B in year 1: Bitwise CIO talks 2025 growth",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-10 23:49:26",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-hit-100b-1-224926929.html",
        "type": "VIDEO",
        "content": "One year has passed since the SEC approved spot bitcoin ETFs, with these funds accumulating over $100 billion in total assets during their first year of trading. Bitwise Asset Management CIO Matt Hougan joins to discuss bitcoin's (BTC-USD) outlook for 2025. Bitwise operates several of its own bitcoin (BITB, BITC, BTOP) and crypto (BITQ, BITW) ETFs. \"As we look into 2025, the number of tailwinds pushing this industry forward is just extraordinarily strong,\" Hougan explains, citing ETF inflows, the incoming Trump administration, institutional investments, and other factors. He notes that there are \"too many long-term positives\" driving the market. Discussing the incoming Trump administration, Hougan outlines several key steps for the first 100 days: securing confirmation for crypto-friendly nominees, halting regulatory \"lawfare,\" and implementing enhanced stablecoin and market structure legislation. He suggests these actions could position the US as \"the crypto capital of the world.\" To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Angel Smith"
    },
    {
        "title": "Nasdaq Seeks SEC Approval for CoinShares' XRP, Litecoin ETFs",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 23:40:34",
        "link": "https://finance.yahoo.com/m/481e0920-ceea-363c-b194-99a6ddd87612/nasdaq-seeks-sec-approval-for.html",
        "type": "STORY",
        "content": "The Nasdaq stock exchange is seeking approval to list and trade XRP and Litecoin exchange-traded funds from CoinShares, adding to a wave of new crypto ETF applications. A Friday filing with the Securities and Exchange Commission comes as multiple firms look to introduce crypto ETFs beyond bitcoin, with Cboe submitting applications the same day for XRP funds from Bitwise, WisdomTree, Canary and 21Shares. The applications reflect financial services firms' efforts to meet rising investor demand for crypto-focused products. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up The push for new products comes amid changing regulatory dynamics at the SEC. Under acting Chair Mark Uyeda, the agency appears more open to considering crypto ETFs than it was under his predecessor, Gary Gensler. This regulatory evolution has prompted asset managers to explore opportunities beyond bitcoin-focused products. XRP's path to ETF approval faces unique challenges. The token has been at the center of a long-running legal battle with the SEC, which claimed it was sold as an unregistered security. While Ripple Labs, the creator and developer of the XRP token, secured a partial victory in 2023 when a federal judge ruled that XRP programmatic sales to exchanges that sell to retail investors did not break securities law (XRP is not a security according to this ruling), regulatory uncertainty persists, potentially complicating the SEC's decision. The filings mark the latest development in crypto's integration with traditional finance. Last week, Grayscale's Solana and Litecoin ETF applications were officially acknowledged by the SEC, following the firm's success in converting its bitcoin trust to an ETF. Under CoinShares' proposal, the XRP ETF would track the Compass Crypto Reference Index XRP while the Litecoin ETF would follow a separate Litecoin index from the same provider. Both funds would allow investors to access these cryptocurrencies through their regular brokerage accounts. According to the filings, both proposed ETFs would hold only their respective cryptocurrencies and cash, prohibiting any yield generation or staking. If approved, these funds could broaden institutional access to alternative cryptocurrencies. Spot bitcoin ETFs have grown at a record pace since they received SEC approval on Jan. 10, 2024, generating nearly $41 billion in inflows, according to UK-based asset manager Farside Investors. Their success has underscored the wider embrace of traditional finance services firms for digital assets and helped send bitcoin and other cryptos to new highs. Bitcoin has been hovering just below $100,000, off its all-time high of roughly $109,000 last month but more than double its level of a year ago, according to crypto markets data provider CoinMarketCap. XRP was recently trading at about $2.43, up more than quadrupled over the past year, while Litecoin was changing hands at roughly $110, a 69% increase from a year ago.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Traders Bet Big on Solana, XRP ETF Approvals in 2025",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 15:00:00",
        "link": "https://finance.yahoo.com/m/487ea23c-182e-30e4-8ce7-f7dcf5edc27a/traders-bet-big-on-solana%2C.html",
        "type": "STORY",
        "content": "This article is the second in a weekly series in February highlighting the growing influence and popularity of cryptocurrency-based ETFs. Traders are pouring money into bets on crypto ETF approvals this year, with prediction markets showing high confidence in multiple digital assets gaining regulatory green-lights. The betting activity reflects market expectations as the Securities and Exchange Commission considers a wave of new cryptocurrency investment products, suggesting traders believe regulatory barriers may ease in the coming months. According to data from Polymarket, a decentralized prediction platform, traders see an 85% chance of a Solana ETF gaining approval in 2025, though near-term odds for July 31 approval sit lower at 39%. These predictions come amid broader changes in the crypto ETF landscape, with the SEC recently acknowledging multiple new applications and showing increased openness to digital asset investment products, based on regulatory filings. For Litecoin, the gap between time frames appears smaller, with a 79% probability for 2025 approval compared to 44% by July 31, according to the Polymarket data. XRP shows a similar divergence in trader confidence, with 80% odds for 2025 approval versus 40% for July 31, highlighting how betting patterns favor year-end over midyear approvals. Memecoins face a more uncertain path, with Dogecoin ETF approval odds at 54% for 2025 and dropping to 29% for July 31, while Pepecoin remains a long shot at just 7% for the year, Polymarket data show. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up Trading volumes on these prediction markets indicate serious money backing these bets, with Solana ETF markets showing a combined $267,000 in volume, while XRP markets have attracted a combined $137,000 in bets, according to Polymarket. Despite lower approval odds, Dogecoin ETF markets lead in trading volume with $450,000 in combined bets. Market activity shows distinct patterns across different cryptocurrency categories, with an unexpected twist—while traders assign higher approval odds to established blockchain platforms, the memecoin Dogecoin has attracted the highest trading volume. This suggests a disconnect between predicted outcomes and trader interest, particularly in more speculative assets. The stark contrast between July and year-end odds suggests traders expect most approvals to come in the latter half of 2025, with probabilities nearly doubling when extending beyond the summer deadline.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Cryptocurrency Futures Exchange for Physical (EFP) Transactions",
        "publisher": "CME Group",
        "publish_date": "2025-02-07 21:51:00",
        "link": "https://finance.yahoo.com/news/cryptocurrency-futures-exchange-physical-efp-205100910.html",
        "type": "STORY",
        "content": "What is an EFP? What else do I need to know about EFPs? Benefits of an EFP Transaction How would this work for cryptocurrency? How do I get started? Why use our futures for cryptocurrency exposure? Exchange for Physical (EFP) transactions are privately negotiated trades between two counterparties allowing them to simultaneously transfer a futures position for an equivalent spot market position or vice versa. Back to Top Governed by Exchange Rule 538. Examples of an equivalent spot market position may include but are not limited to physical cryptocurrency, cryptocurrency ETFs and NDFs, etc. No minimum trade size; price increments must be in appropriate tick size, $5 per bitcoin or $0.50 per ether. Must be executed at commercially reasonable prices that are mutually agreed upon by the parties to the transaction. The futures leg should be reported as soon as possible but not later than the end of the business day on which the EFP was executed. Anyone can trade (no eligible party restriction). Parties to an EFP are required to prepare and maintain all documents in connection with both the futures and related physical cryptocurrency position pursuant to CFTC Regulation 1.35. Participants to an EFP can negotiate directly or can use a broker to help find the other side of the trade. Back to Top Added convenience of private negotiation. Risk management with CME Clearing, one of the world’s leading central counterparty clearing providers. Tried, tested and straightforward trading method for parties with complementary objectives. Available at all times, including weekends. Back to Top Clients can use the mechanism to efficiently transfer their cryptocurrency exposure from a physical to a futures position depending on their specific goals. Working through a broker or directly with each other, two parties agree to trade cryptocurrency between themselves; the two parties also agree to exchange an equivalent position in our Bitcoin/Ether futures that is opposite in direction to their respective physical cryptocurrency transaction. The spot market transaction can be bi-laterally negotiated and consummated on an OTC platform while the futures piece is cleared through CME Direct. Why enter into a cryptocurrency EFP transaction?  Who can benefit?  How can an EFP help? Monetize a long cryptocurrency position Miners, Commercials, All By selling physical cryptocurrency and buying an equivalent futures position, clients are able to free-up capital and yet maintain exposure to cryptocurrency price movements. Unwind a futures – spot cryptocurrency spread trade HFs, Props, CTAs, Retail Clients who are trying to benefit from a price dislocation between the spot and futures markets can use an EFP to close out the position and lock-in the spread. Manage cryptocurrency exposure during weekends/holidays All Futures trade electronically 23 hours a day from Sunday at 5:00 p.m. CT to Friday 4:00 p.m. CT. To manage risk when we are closed, clients can trade cryptocurrency in the spot market and EFP to futures. Cover a short cryptocurrency position OTC Desks, HFs, CTAs, Props A client who is short cryptocurrency and whose borrow has been called can use an EFP to access cryptocurrency to deliver against the short physical position and still remain short through the futures market. Source cryptocurrency to lend out OTC Desks, HFs, CTAs, Props Clients who do not have cryptocurrency inventory to lend out can use an EFP to source physical cryptocurrency, lend it, collect the lending fee and maintain market neutrality. Protect a cryptocurrency loan OTC Desks, Miners, All Clients who have loaned out their cryptocurrency inventory can use an EFP to hedge the risk of their cryptocurrency not being returned. Improved capital efficiencies Miners, All A key benefit of futures is the leverage they offer. By using an EFP, clients are able to free up capital for use in other alpha-generating strategies. Party B agrees to sell 500 bitcoin to Party A and buy 100 bitcoin futures from Party A (economically, both parties are risk neutral). Additionally, the two parties agree to a spread of $5 between the spot and futures price. If bitcoin is at $6,500 Party B receives $3,250,000 on the sale of bitcoin to Party A. Simultaneously, Party B buys the futures contracts from Party A at a price of $6,495 ($6,500 - $5). For the futures contract, Party B would need to maintain, at least, 37% margin* or $1,201,575. The difference between the bitcoin sale price and the margin that needs to be posted is freed up capital and may be used by Party B as needed. By using an EFP, Party B benefits from the leverage offered through the futures contract and is able to free up $2,048,425 while still maintaining exposure to bitcoin. *Represents exchange minimum, subject to change, clearing firms may require a higher amount Back to Top Establish a clearing account with one or more of the two plus dozen FCMs (Futures Commission Merchants) currently supporting the contracts. Download CME Direct platform. Register for ClearPort. Assign traders and brokers. Back to Top No need to establish a wallet; eliminates hacking risk. Easily convert cryptocurrency exposure to USD. No actual movement of cryptocurrency. Do not need possession of cryptocurrency to sell (or to borrow cryptocurrency to sell short). Price transparency, leverage, liquidity and capital efficiencies. Trade on a regulated, established Exchange. USD-settled contracts to reliable benchmark rates. View our suite of Cryptocurrency products. Back to Top Cryptocurrencies   Article   Product Information   Bitcoin All examples in this report are hypothetical interpretations of situations and are used for explanation purposes only. The views in this report reflect solely those of the author and not necessarily those of CME Group or its affiliated institutions. This report and the information herein should not be considered investment advice or the results of actual market experience. Derivatives are not suitable for all investors and involve the risk of losing more than the amount originally deposited and any profit you might have made.  This communication is not a recommendation or offer to buy, sell or retain any specific investment or service. All examples in this report are hypothetical interpretations of situations and are used for explanation purposes only. The views in this report reflect solely those of the author and not necessarily those of CME Group or its affiliated institutions. This report and the information herein should not be considered investment advice or the results of actual market experience. CME Group Inc. does not have control over the content, accuracy, quality, or legality, of any third-party product, service, or content advertised on this webpage. The presence of such advertisements on this webpage does not signify any association, partnership, or endorsement of the third-party or its content by CME Group Inc. Full disclaimer Copyright © 2025 CME Group Inc."
    },
    {
        "title": "Be careful what you wish for on crypto regulation, this bear says",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-28 19:50:00",
        "link": "https://finance.yahoo.com/video/careful-wish-crypto-regulation-bear-185000137.html",
        "type": "VIDEO",
        "content": "Bitcoin (BTC-USD) rebounds from the pricing pullback the cryptocurrency saw over the last two days, the coin now back trading above $100,000. Innovating Capital founder and general partner Anthony Georgiades joins Catalysts with Seana Smith and Alexandra Canal to discuss his outlook on bitcoin and the crypto space. Georgiades explains he's more bearish than some on crypto: \"We're seeing obviously a lot of risk on sentiment. Things are priced to perfection ... It's not to say that I am skeptical or anti [to] the crypto progressive regulation that we're seeing, but I think it's one of those things where we need to be careful what we wish for with respect to things like a strategic reserve and certain legislative oversight.\" He says that while Innovating Capital is a long-term bitcoin holder, \"I do think that the market has priced in a lot of the positive catalysts over the last several months, and there's still a lot of risk on behavior tied to bitcoin as an asset,\" highlighting the crypto asset's downward moves. \"Generally speaking, I think the market's priced in a lot of potential friendly regulation and the probability of certain catalysts like a reserve taking place, whereas frankly speaking, the underlying fundamental behavior for a lot of that to actually make its way and permeate through the market, it's going to take years,\" Georgiades. Watch the video above to hear more about Georgiades' concerns about XRP (XRP-USD) and Ripple's RLUSD (RLUSD-USD) stablecoin. To watch more expert insights and analysis on the latest market action, check out more Catalysts here. This post was written by Naomi Buchanan."
    },
    {
        "title": "JP Morgan: SEC Crypto Shift May Usher in Solana, XRP ETPs",
        "publisher": "etf.com",
        "publish_date": "2025-01-15 15:00:00",
        "link": "https://finance.yahoo.com/m/51fda3bf-9e16-32c1-a2e4-b76d947d26e7/jp-morgan%3A-sec-crypto-shift.html",
        "type": "STORY",
        "content": "Solana and XRP could be next in line for spot cryptocurrency exchange-traded products, though analysts expect more modest asset inflows compared to bitcoin's success, according to a new J.P. Morgan Research report. The anticipated regulatory changes in 2025, including a new Securities and Exchange Commission chair and potential legislation clarifying crypto asset classification, could pave the way for the next wave of cryptocurrency ETPs—though J.P. Morgan analysts Kenneth B. Worthington, Michael Cho, Alexander Bernstein and Madeline Daleiden cautioned that investors demand for these “altcoin” products may be limited compared to bitcoin and Ethereum offerings. After the successful launch of bitcoin ETPs that gathered $36.5 billion in their first year, J.P. Morgan estimates potential Solana ETPs could attract $3 billion to $6 billion in assets, while XRP products might draw $4 billion to $8 billion, according to the report published Monday. These more modest projections reflect the smaller market capitalization of these tokens compared to bitcoin and Ethereum, the report noted, with Ethereum’s market cap roughly three to four times larger than both Solana and XRP. Several firms have already positioned themselves for potential approval, with Grayscale operating a $99 million Solana trust and a $12 million XRP trust that could convert to exchange-traded fundss, similar to its previous bitcoin trust conversion, according to the analysts. The report indicates multiple ETP applications for tokens like Solana have already been rejected by the current SEC, but firms may resubmit under new leadership that could take a more favorable stance toward crypto innovation. The new regulatory environment appears crucial for future approvals, the analysts write, as debate continues at the SEC around what constitutes a security versus a commodity—a key distinction that has delayed \"altcoin\" ETP applications. “Outside of a few primary tokens (i.e BTC, ETH, SOL), the episodic nature of the cryptomarket is driven by varying investor sentiment and trendy new coins that may capture incremental attention for a limited time,” the report stated. BlackRock Inc.’s decision not to pursue a Solona ETP due to uncertain investor demand highlights the challenges ahead, the analysts said, suggesting the broader crypto market’s breadth may outweigh individual token depth beyond the largest cryptocurrencies. The report suggested the recently approved bitcoin and Ethereum hybrid ETP products from Franklin Templeton and Hashdex, possibly set to launch this month with an 80/20 split matching market caps, could provide a template for future multi-token products. Market fundamentals will likely determine the success of new crypto ETPs in 2025, with J.P. Morgan analysts noting that Ethereum ETP assets currently represent just 3% of the token's $12 billion total market cap six months after launch, compared to bitcoin ETP assets reaching 6% of bitcoin’s $108 billion market cap in their first year.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Bitcoin ETFs see a record 4 days of outflows",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-14 17:24:00",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-see-record-4-162400200.html",
        "type": "VIDEO",
        "content": "Bitcoin ETFs see a record four days of outflows. Madison Mills joins Morning Brief to outline what investors need to know. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here. This post was written by Naomi Buchanan."
    },
    {
        "title": "Bitcoin ETFs see $36B in net inflows in first year",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-13 18:34:57",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-see-36b-net-173457022.html",
        "type": "VIDEO",
        "content": "The first spot bitcoin ETFs are approaching their one-year trading anniversary, attracting more than $36 billion in net inflows during this period. Yahoo Finance Markets & Data Editor Jared Blikre analyzes the digital asset's performance over the past year, highlighting the most significant gains and losses within the cryptocurrency space. To watch more expert insights and analysis on the latest market action, check out more Wealth here. This post was written by Angel Smith"
    },
    {
        "title": "Bitcoin ETFs hit $100B in year 1: Bitwise CIO talks 2025 growth",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-10 23:49:26",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-hit-100b-1-224926929.html",
        "type": "VIDEO",
        "content": "One year has passed since the SEC approved spot bitcoin ETFs, with these funds accumulating over $100 billion in total assets during their first year of trading. Bitwise Asset Management CIO Matt Hougan joins to discuss bitcoin's (BTC-USD) outlook for 2025. Bitwise operates several of its own bitcoin (BITB, BITC, BTOP) and crypto (BITQ, BITW) ETFs. \"As we look into 2025, the number of tailwinds pushing this industry forward is just extraordinarily strong,\" Hougan explains, citing ETF inflows, the incoming Trump administration, institutional investments, and other factors. He notes that there are \"too many long-term positives\" driving the market. Discussing the incoming Trump administration, Hougan outlines several key steps for the first 100 days: securing confirmation for crypto-friendly nominees, halting regulatory \"lawfare,\" and implementing enhanced stablecoin and market structure legislation. He suggests these actions could position the US as \"the crypto capital of the world.\" To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Angel Smith"
    },
    {
        "title": "Nasdaq Seeks SEC Approval for CoinShares' XRP, Litecoin ETFs",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 23:40:34",
        "link": "https://finance.yahoo.com/m/481e0920-ceea-363c-b194-99a6ddd87612/nasdaq-seeks-sec-approval-for.html",
        "type": "STORY",
        "content": "The Nasdaq stock exchange is seeking approval to list and trade XRP and Litecoin exchange-traded funds from CoinShares, adding to a wave of new crypto ETF applications. A Friday filing with the Securities and Exchange Commission comes as multiple firms look to introduce crypto ETFs beyond bitcoin, with Cboe submitting applications the same day for XRP funds from Bitwise, WisdomTree, Canary and 21Shares. The applications reflect financial services firms' efforts to meet rising investor demand for crypto-focused products. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up The push for new products comes amid changing regulatory dynamics at the SEC. Under acting Chair Mark Uyeda, the agency appears more open to considering crypto ETFs than it was under his predecessor, Gary Gensler. This regulatory evolution has prompted asset managers to explore opportunities beyond bitcoin-focused products. XRP's path to ETF approval faces unique challenges. The token has been at the center of a long-running legal battle with the SEC, which claimed it was sold as an unregistered security. While Ripple Labs, the creator and developer of the XRP token, secured a partial victory in 2023 when a federal judge ruled that XRP programmatic sales to exchanges that sell to retail investors did not break securities law (XRP is not a security according to this ruling), regulatory uncertainty persists, potentially complicating the SEC's decision. The filings mark the latest development in crypto's integration with traditional finance. Last week, Grayscale's Solana and Litecoin ETF applications were officially acknowledged by the SEC, following the firm's success in converting its bitcoin trust to an ETF. Under CoinShares' proposal, the XRP ETF would track the Compass Crypto Reference Index XRP while the Litecoin ETF would follow a separate Litecoin index from the same provider. Both funds would allow investors to access these cryptocurrencies through their regular brokerage accounts. According to the filings, both proposed ETFs would hold only their respective cryptocurrencies and cash, prohibiting any yield generation or staking. If approved, these funds could broaden institutional access to alternative cryptocurrencies. Spot bitcoin ETFs have grown at a record pace since they received SEC approval on Jan. 10, 2024, generating nearly $41 billion in inflows, according to UK-based asset manager Farside Investors. Their success has underscored the wider embrace of traditional finance services firms for digital assets and helped send bitcoin and other cryptos to new highs. Bitcoin has been hovering just below $100,000, off its all-time high of roughly $109,000 last month but more than double its level of a year ago, according to crypto markets data provider CoinMarketCap. XRP was recently trading at about $2.43, up more than quadrupled over the past year, while Litecoin was changing hands at roughly $110, a 69% increase from a year ago.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Traders Bet Big on Solana, XRP ETF Approvals in 2025",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 15:00:00",
        "link": "https://finance.yahoo.com/m/487ea23c-182e-30e4-8ce7-f7dcf5edc27a/traders-bet-big-on-solana%2C.html",
        "type": "STORY",
        "content": "This article is the second in a weekly series in February highlighting the growing influence and popularity of cryptocurrency-based ETFs. Traders are pouring money into bets on crypto ETF approvals this year, with prediction markets showing high confidence in multiple digital assets gaining regulatory green-lights. The betting activity reflects market expectations as the Securities and Exchange Commission considers a wave of new cryptocurrency investment products, suggesting traders believe regulatory barriers may ease in the coming months. According to data from Polymarket, a decentralized prediction platform, traders see an 85% chance of a Solana ETF gaining approval in 2025, though near-term odds for July 31 approval sit lower at 39%. These predictions come amid broader changes in the crypto ETF landscape, with the SEC recently acknowledging multiple new applications and showing increased openness to digital asset investment products, based on regulatory filings. For Litecoin, the gap between time frames appears smaller, with a 79% probability for 2025 approval compared to 44% by July 31, according to the Polymarket data. XRP shows a similar divergence in trader confidence, with 80% odds for 2025 approval versus 40% for July 31, highlighting how betting patterns favor year-end over midyear approvals. Memecoins face a more uncertain path, with Dogecoin ETF approval odds at 54% for 2025 and dropping to 29% for July 31, while Pepecoin remains a long shot at just 7% for the year, Polymarket data show. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up Trading volumes on these prediction markets indicate serious money backing these bets, with Solana ETF markets showing a combined $267,000 in volume, while XRP markets have attracted a combined $137,000 in bets, according to Polymarket. Despite lower approval odds, Dogecoin ETF markets lead in trading volume with $450,000 in combined bets. Market activity shows distinct patterns across different cryptocurrency categories, with an unexpected twist—while traders assign higher approval odds to established blockchain platforms, the memecoin Dogecoin has attracted the highest trading volume. This suggests a disconnect between predicted outcomes and trader interest, particularly in more speculative assets. The stark contrast between July and year-end odds suggests traders expect most approvals to come in the latter half of 2025, with probabilities nearly doubling when extending beyond the summer deadline.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Cryptocurrency Futures Exchange for Physical (EFP) Transactions",
        "publisher": "CME Group",
        "publish_date": "2025-02-07 21:51:00",
        "link": "https://finance.yahoo.com/news/cryptocurrency-futures-exchange-physical-efp-205100910.html",
        "type": "STORY",
        "content": "What is an EFP? What else do I need to know about EFPs? Benefits of an EFP Transaction How would this work for cryptocurrency? How do I get started? Why use our futures for cryptocurrency exposure? Exchange for Physical (EFP) transactions are privately negotiated trades between two counterparties allowing them to simultaneously transfer a futures position for an equivalent spot market position or vice versa. Back to Top Governed by Exchange Rule 538. Examples of an equivalent spot market position may include but are not limited to physical cryptocurrency, cryptocurrency ETFs and NDFs, etc. No minimum trade size; price increments must be in appropriate tick size, $5 per bitcoin or $0.50 per ether. Must be executed at commercially reasonable prices that are mutually agreed upon by the parties to the transaction. The futures leg should be reported as soon as possible but not later than the end of the business day on which the EFP was executed. Anyone can trade (no eligible party restriction). Parties to an EFP are required to prepare and maintain all documents in connection with both the futures and related physical cryptocurrency position pursuant to CFTC Regulation 1.35. Participants to an EFP can negotiate directly or can use a broker to help find the other side of the trade. Back to Top Added convenience of private negotiation. Risk management with CME Clearing, one of the world’s leading central counterparty clearing providers. Tried, tested and straightforward trading method for parties with complementary objectives. Available at all times, including weekends. Back to Top Clients can use the mechanism to efficiently transfer their cryptocurrency exposure from a physical to a futures position depending on their specific goals. Working through a broker or directly with each other, two parties agree to trade cryptocurrency between themselves; the two parties also agree to exchange an equivalent position in our Bitcoin/Ether futures that is opposite in direction to their respective physical cryptocurrency transaction. The spot market transaction can be bi-laterally negotiated and consummated on an OTC platform while the futures piece is cleared through CME Direct. Why enter into a cryptocurrency EFP transaction?  Who can benefit?  How can an EFP help? Monetize a long cryptocurrency position Miners, Commercials, All By selling physical cryptocurrency and buying an equivalent futures position, clients are able to free-up capital and yet maintain exposure to cryptocurrency price movements. Unwind a futures – spot cryptocurrency spread trade HFs, Props, CTAs, Retail Clients who are trying to benefit from a price dislocation between the spot and futures markets can use an EFP to close out the position and lock-in the spread. Manage cryptocurrency exposure during weekends/holidays All Futures trade electronically 23 hours a day from Sunday at 5:00 p.m. CT to Friday 4:00 p.m. CT. To manage risk when we are closed, clients can trade cryptocurrency in the spot market and EFP to futures. Cover a short cryptocurrency position OTC Desks, HFs, CTAs, Props A client who is short cryptocurrency and whose borrow has been called can use an EFP to access cryptocurrency to deliver against the short physical position and still remain short through the futures market. Source cryptocurrency to lend out OTC Desks, HFs, CTAs, Props Clients who do not have cryptocurrency inventory to lend out can use an EFP to source physical cryptocurrency, lend it, collect the lending fee and maintain market neutrality. Protect a cryptocurrency loan OTC Desks, Miners, All Clients who have loaned out their cryptocurrency inventory can use an EFP to hedge the risk of their cryptocurrency not being returned. Improved capital efficiencies Miners, All A key benefit of futures is the leverage they offer. By using an EFP, clients are able to free up capital for use in other alpha-generating strategies. Party B agrees to sell 500 bitcoin to Party A and buy 100 bitcoin futures from Party A (economically, both parties are risk neutral). Additionally, the two parties agree to a spread of $5 between the spot and futures price. If bitcoin is at $6,500 Party B receives $3,250,000 on the sale of bitcoin to Party A. Simultaneously, Party B buys the futures contracts from Party A at a price of $6,495 ($6,500 - $5). For the futures contract, Party B would need to maintain, at least, 37% margin* or $1,201,575. The difference between the bitcoin sale price and the margin that needs to be posted is freed up capital and may be used by Party B as needed. By using an EFP, Party B benefits from the leverage offered through the futures contract and is able to free up $2,048,425 while still maintaining exposure to bitcoin. *Represents exchange minimum, subject to change, clearing firms may require a higher amount Back to Top Establish a clearing account with one or more of the two plus dozen FCMs (Futures Commission Merchants) currently supporting the contracts. Download CME Direct platform. Register for ClearPort. Assign traders and brokers. Back to Top No need to establish a wallet; eliminates hacking risk. Easily convert cryptocurrency exposure to USD. No actual movement of cryptocurrency. Do not need possession of cryptocurrency to sell (or to borrow cryptocurrency to sell short). Price transparency, leverage, liquidity and capital efficiencies. Trade on a regulated, established Exchange. USD-settled contracts to reliable benchmark rates. View our suite of Cryptocurrency products. Back to Top Cryptocurrencies   Article   Product Information   Bitcoin All examples in this report are hypothetical interpretations of situations and are used for explanation purposes only. The views in this report reflect solely those of the author and not necessarily those of CME Group or its affiliated institutions. This report and the information herein should not be considered investment advice or the results of actual market experience. Derivatives are not suitable for all investors and involve the risk of losing more than the amount originally deposited and any profit you might have made.  This communication is not a recommendation or offer to buy, sell or retain any specific investment or service. All examples in this report are hypothetical interpretations of situations and are used for explanation purposes only. The views in this report reflect solely those of the author and not necessarily those of CME Group or its affiliated institutions. This report and the information herein should not be considered investment advice or the results of actual market experience. CME Group Inc. does not have control over the content, accuracy, quality, or legality, of any third-party product, service, or content advertised on this webpage. The presence of such advertisements on this webpage does not signify any association, partnership, or endorsement of the third-party or its content by CME Group Inc. Full disclaimer Copyright © 2025 CME Group Inc."
    },
    {
        "title": "Be careful what you wish for on crypto regulation, this bear says",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-28 19:50:00",
        "link": "https://finance.yahoo.com/video/careful-wish-crypto-regulation-bear-185000137.html",
        "type": "VIDEO",
        "content": "Bitcoin (BTC-USD) rebounds from the pricing pullback the cryptocurrency saw over the last two days, the coin now back trading above $100,000. Innovating Capital founder and general partner Anthony Georgiades joins Catalysts with Seana Smith and Alexandra Canal to discuss his outlook on bitcoin and the crypto space. Georgiades explains he's more bearish than some on crypto: \"We're seeing obviously a lot of risk on sentiment. Things are priced to perfection ... It's not to say that I am skeptical or anti [to] the crypto progressive regulation that we're seeing, but I think it's one of those things where we need to be careful what we wish for with respect to things like a strategic reserve and certain legislative oversight.\" He says that while Innovating Capital is a long-term bitcoin holder, \"I do think that the market has priced in a lot of the positive catalysts over the last several months, and there's still a lot of risk on behavior tied to bitcoin as an asset,\" highlighting the crypto asset's downward moves. \"Generally speaking, I think the market's priced in a lot of potential friendly regulation and the probability of certain catalysts like a reserve taking place, whereas frankly speaking, the underlying fundamental behavior for a lot of that to actually make its way and permeate through the market, it's going to take years,\" Georgiades. Watch the video above to hear more about Georgiades' concerns about XRP (XRP-USD) and Ripple's RLUSD (RLUSD-USD) stablecoin. To watch more expert insights and analysis on the latest market action, check out more Catalysts here. This post was written by Naomi Buchanan."
    },
    {
        "title": "JP Morgan: SEC Crypto Shift May Usher in Solana, XRP ETPs",
        "publisher": "etf.com",
        "publish_date": "2025-01-15 15:00:00",
        "link": "https://finance.yahoo.com/m/51fda3bf-9e16-32c1-a2e4-b76d947d26e7/jp-morgan%3A-sec-crypto-shift.html",
        "type": "STORY",
        "content": "Solana and XRP could be next in line for spot cryptocurrency exchange-traded products, though analysts expect more modest asset inflows compared to bitcoin's success, according to a new J.P. Morgan Research report. The anticipated regulatory changes in 2025, including a new Securities and Exchange Commission chair and potential legislation clarifying crypto asset classification, could pave the way for the next wave of cryptocurrency ETPs—though J.P. Morgan analysts Kenneth B. Worthington, Michael Cho, Alexander Bernstein and Madeline Daleiden cautioned that investors demand for these “altcoin” products may be limited compared to bitcoin and Ethereum offerings. After the successful launch of bitcoin ETPs that gathered $36.5 billion in their first year, J.P. Morgan estimates potential Solana ETPs could attract $3 billion to $6 billion in assets, while XRP products might draw $4 billion to $8 billion, according to the report published Monday. These more modest projections reflect the smaller market capitalization of these tokens compared to bitcoin and Ethereum, the report noted, with Ethereum’s market cap roughly three to four times larger than both Solana and XRP. Several firms have already positioned themselves for potential approval, with Grayscale operating a $99 million Solana trust and a $12 million XRP trust that could convert to exchange-traded fundss, similar to its previous bitcoin trust conversion, according to the analysts. The report indicates multiple ETP applications for tokens like Solana have already been rejected by the current SEC, but firms may resubmit under new leadership that could take a more favorable stance toward crypto innovation. The new regulatory environment appears crucial for future approvals, the analysts write, as debate continues at the SEC around what constitutes a security versus a commodity—a key distinction that has delayed \"altcoin\" ETP applications. “Outside of a few primary tokens (i.e BTC, ETH, SOL), the episodic nature of the cryptomarket is driven by varying investor sentiment and trendy new coins that may capture incremental attention for a limited time,” the report stated. BlackRock Inc.’s decision not to pursue a Solona ETP due to uncertain investor demand highlights the challenges ahead, the analysts said, suggesting the broader crypto market’s breadth may outweigh individual token depth beyond the largest cryptocurrencies. The report suggested the recently approved bitcoin and Ethereum hybrid ETP products from Franklin Templeton and Hashdex, possibly set to launch this month with an 80/20 split matching market caps, could provide a template for future multi-token products. Market fundamentals will likely determine the success of new crypto ETPs in 2025, with J.P. Morgan analysts noting that Ethereum ETP assets currently represent just 3% of the token's $12 billion total market cap six months after launch, compared to bitcoin ETP assets reaching 6% of bitcoin’s $108 billion market cap in their first year.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Bitcoin ETFs see a record 4 days of outflows",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-14 17:24:00",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-see-record-4-162400200.html",
        "type": "VIDEO",
        "content": "Bitcoin ETFs see a record four days of outflows. Madison Mills joins Morning Brief to outline what investors need to know. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here. This post was written by Naomi Buchanan."
    },
    {
        "title": "Bitcoin ETFs see $36B in net inflows in first year",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-13 18:34:57",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-see-36b-net-173457022.html",
        "type": "VIDEO",
        "content": "The first spot bitcoin ETFs are approaching their one-year trading anniversary, attracting more than $36 billion in net inflows during this period. Yahoo Finance Markets & Data Editor Jared Blikre analyzes the digital asset's performance over the past year, highlighting the most significant gains and losses within the cryptocurrency space. To watch more expert insights and analysis on the latest market action, check out more Wealth here. This post was written by Angel Smith"
    },
    {
        "title": "Bitcoin ETFs hit $100B in year 1: Bitwise CIO talks 2025 growth",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-10 23:49:26",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-hit-100b-1-224926929.html",
        "type": "VIDEO",
        "content": "One year has passed since the SEC approved spot bitcoin ETFs, with these funds accumulating over $100 billion in total assets during their first year of trading. Bitwise Asset Management CIO Matt Hougan joins to discuss bitcoin's (BTC-USD) outlook for 2025. Bitwise operates several of its own bitcoin (BITB, BITC, BTOP) and crypto (BITQ, BITW) ETFs. \"As we look into 2025, the number of tailwinds pushing this industry forward is just extraordinarily strong,\" Hougan explains, citing ETF inflows, the incoming Trump administration, institutional investments, and other factors. He notes that there are \"too many long-term positives\" driving the market. Discussing the incoming Trump administration, Hougan outlines several key steps for the first 100 days: securing confirmation for crypto-friendly nominees, halting regulatory \"lawfare,\" and implementing enhanced stablecoin and market structure legislation. He suggests these actions could position the US as \"the crypto capital of the world.\" To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Angel Smith"
    },
    {
        "title": "Nasdaq Seeks SEC Approval for CoinShares' XRP, Litecoin ETFs",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 23:40:34",
        "link": "https://finance.yahoo.com/m/481e0920-ceea-363c-b194-99a6ddd87612/nasdaq-seeks-sec-approval-for.html",
        "type": "STORY",
        "content": "The Nasdaq stock exchange is seeking approval to list and trade XRP and Litecoin exchange-traded funds from CoinShares, adding to a wave of new crypto ETF applications. A Friday filing with the Securities and Exchange Commission comes as multiple firms look to introduce crypto ETFs beyond bitcoin, with Cboe submitting applications the same day for XRP funds from Bitwise, WisdomTree, Canary and 21Shares. The applications reflect financial services firms' efforts to meet rising investor demand for crypto-focused products. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up The push for new products comes amid changing regulatory dynamics at the SEC. Under acting Chair Mark Uyeda, the agency appears more open to considering crypto ETFs than it was under his predecessor, Gary Gensler. This regulatory evolution has prompted asset managers to explore opportunities beyond bitcoin-focused products. XRP's path to ETF approval faces unique challenges. The token has been at the center of a long-running legal battle with the SEC, which claimed it was sold as an unregistered security. While Ripple Labs, the creator and developer of the XRP token, secured a partial victory in 2023 when a federal judge ruled that XRP programmatic sales to exchanges that sell to retail investors did not break securities law (XRP is not a security according to this ruling), regulatory uncertainty persists, potentially complicating the SEC's decision. The filings mark the latest development in crypto's integration with traditional finance. Last week, Grayscale's Solana and Litecoin ETF applications were officially acknowledged by the SEC, following the firm's success in converting its bitcoin trust to an ETF. Under CoinShares' proposal, the XRP ETF would track the Compass Crypto Reference Index XRP while the Litecoin ETF would follow a separate Litecoin index from the same provider. Both funds would allow investors to access these cryptocurrencies through their regular brokerage accounts. According to the filings, both proposed ETFs would hold only their respective cryptocurrencies and cash, prohibiting any yield generation or staking. If approved, these funds could broaden institutional access to alternative cryptocurrencies. Spot bitcoin ETFs have grown at a record pace since they received SEC approval on Jan. 10, 2024, generating nearly $41 billion in inflows, according to UK-based asset manager Farside Investors. Their success has underscored the wider embrace of traditional finance services firms for digital assets and helped send bitcoin and other cryptos to new highs. Bitcoin has been hovering just below $100,000, off its all-time high of roughly $109,000 last month but more than double its level of a year ago, according to crypto markets data provider CoinMarketCap. XRP was recently trading at about $2.43, up more than quadrupled over the past year, while Litecoin was changing hands at roughly $110, a 69% increase from a year ago.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Traders Bet Big on Solana, XRP ETF Approvals in 2025",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 15:00:00",
        "link": "https://finance.yahoo.com/m/487ea23c-182e-30e4-8ce7-f7dcf5edc27a/traders-bet-big-on-solana%2C.html",
        "type": "STORY",
        "content": "This article is the second in a weekly series in February highlighting the growing influence and popularity of cryptocurrency-based ETFs. Traders are pouring money into bets on crypto ETF approvals this year, with prediction markets showing high confidence in multiple digital assets gaining regulatory green-lights. The betting activity reflects market expectations as the Securities and Exchange Commission considers a wave of new cryptocurrency investment products, suggesting traders believe regulatory barriers may ease in the coming months. According to data from Polymarket, a decentralized prediction platform, traders see an 85% chance of a Solana ETF gaining approval in 2025, though near-term odds for July 31 approval sit lower at 39%. These predictions come amid broader changes in the crypto ETF landscape, with the SEC recently acknowledging multiple new applications and showing increased openness to digital asset investment products, based on regulatory filings. For Litecoin, the gap between time frames appears smaller, with a 79% probability for 2025 approval compared to 44% by July 31, according to the Polymarket data. XRP shows a similar divergence in trader confidence, with 80% odds for 2025 approval versus 40% for July 31, highlighting how betting patterns favor year-end over midyear approvals. Memecoins face a more uncertain path, with Dogecoin ETF approval odds at 54% for 2025 and dropping to 29% for July 31, while Pepecoin remains a long shot at just 7% for the year, Polymarket data show. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up Trading volumes on these prediction markets indicate serious money backing these bets, with Solana ETF markets showing a combined $267,000 in volume, while XRP markets have attracted a combined $137,000 in bets, according to Polymarket. Despite lower approval odds, Dogecoin ETF markets lead in trading volume with $450,000 in combined bets. Market activity shows distinct patterns across different cryptocurrency categories, with an unexpected twist—while traders assign higher approval odds to established blockchain platforms, the memecoin Dogecoin has attracted the highest trading volume. This suggests a disconnect between predicted outcomes and trader interest, particularly in more speculative assets. The stark contrast between July and year-end odds suggests traders expect most approvals to come in the latter half of 2025, with probabilities nearly doubling when extending beyond the summer deadline.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Cryptocurrency Futures Exchange for Physical (EFP) Transactions",
        "publisher": "CME Group",
        "publish_date": "2025-02-07 21:51:00",
        "link": "https://finance.yahoo.com/news/cryptocurrency-futures-exchange-physical-efp-205100910.html",
        "type": "STORY",
        "content": "What is an EFP? What else do I need to know about EFPs? Benefits of an EFP Transaction How would this work for cryptocurrency? How do I get started? Why use our futures for cryptocurrency exposure? Exchange for Physical (EFP) transactions are privately negotiated trades between two counterparties allowing them to simultaneously transfer a futures position for an equivalent spot market position or vice versa. Back to Top Governed by Exchange Rule 538. Examples of an equivalent spot market position may include but are not limited to physical cryptocurrency, cryptocurrency ETFs and NDFs, etc. No minimum trade size; price increments must be in appropriate tick size, $5 per bitcoin or $0.50 per ether. Must be executed at commercially reasonable prices that are mutually agreed upon by the parties to the transaction. The futures leg should be reported as soon as possible but not later than the end of the business day on which the EFP was executed. Anyone can trade (no eligible party restriction). Parties to an EFP are required to prepare and maintain all documents in connection with both the futures and related physical cryptocurrency position pursuant to CFTC Regulation 1.35. Participants to an EFP can negotiate directly or can use a broker to help find the other side of the trade. Back to Top Added convenience of private negotiation. Risk management with CME Clearing, one of the world’s leading central counterparty clearing providers. Tried, tested and straightforward trading method for parties with complementary objectives. Available at all times, including weekends. Back to Top Clients can use the mechanism to efficiently transfer their cryptocurrency exposure from a physical to a futures position depending on their specific goals. Working through a broker or directly with each other, two parties agree to trade cryptocurrency between themselves; the two parties also agree to exchange an equivalent position in our Bitcoin/Ether futures that is opposite in direction to their respective physical cryptocurrency transaction. The spot market transaction can be bi-laterally negotiated and consummated on an OTC platform while the futures piece is cleared through CME Direct. Why enter into a cryptocurrency EFP transaction?  Who can benefit?  How can an EFP help? Monetize a long cryptocurrency position Miners, Commercials, All By selling physical cryptocurrency and buying an equivalent futures position, clients are able to free-up capital and yet maintain exposure to cryptocurrency price movements. Unwind a futures – spot cryptocurrency spread trade HFs, Props, CTAs, Retail Clients who are trying to benefit from a price dislocation between the spot and futures markets can use an EFP to close out the position and lock-in the spread. Manage cryptocurrency exposure during weekends/holidays All Futures trade electronically 23 hours a day from Sunday at 5:00 p.m. CT to Friday 4:00 p.m. CT. To manage risk when we are closed, clients can trade cryptocurrency in the spot market and EFP to futures. Cover a short cryptocurrency position OTC Desks, HFs, CTAs, Props A client who is short cryptocurrency and whose borrow has been called can use an EFP to access cryptocurrency to deliver against the short physical position and still remain short through the futures market. Source cryptocurrency to lend out OTC Desks, HFs, CTAs, Props Clients who do not have cryptocurrency inventory to lend out can use an EFP to source physical cryptocurrency, lend it, collect the lending fee and maintain market neutrality. Protect a cryptocurrency loan OTC Desks, Miners, All Clients who have loaned out their cryptocurrency inventory can use an EFP to hedge the risk of their cryptocurrency not being returned. Improved capital efficiencies Miners, All A key benefit of futures is the leverage they offer. By using an EFP, clients are able to free up capital for use in other alpha-generating strategies. Party B agrees to sell 500 bitcoin to Party A and buy 100 bitcoin futures from Party A (economically, both parties are risk neutral). Additionally, the two parties agree to a spread of $5 between the spot and futures price. If bitcoin is at $6,500 Party B receives $3,250,000 on the sale of bitcoin to Party A. Simultaneously, Party B buys the futures contracts from Party A at a price of $6,495 ($6,500 - $5). For the futures contract, Party B would need to maintain, at least, 37% margin* or $1,201,575. The difference between the bitcoin sale price and the margin that needs to be posted is freed up capital and may be used by Party B as needed. By using an EFP, Party B benefits from the leverage offered through the futures contract and is able to free up $2,048,425 while still maintaining exposure to bitcoin. *Represents exchange minimum, subject to change, clearing firms may require a higher amount Back to Top Establish a clearing account with one or more of the two plus dozen FCMs (Futures Commission Merchants) currently supporting the contracts. Download CME Direct platform. Register for ClearPort. Assign traders and brokers. Back to Top No need to establish a wallet; eliminates hacking risk. Easily convert cryptocurrency exposure to USD. No actual movement of cryptocurrency. Do not need possession of cryptocurrency to sell (or to borrow cryptocurrency to sell short). Price transparency, leverage, liquidity and capital efficiencies. Trade on a regulated, established Exchange. USD-settled contracts to reliable benchmark rates. View our suite of Cryptocurrency products. Back to Top Cryptocurrencies   Article   Product Information   Bitcoin All examples in this report are hypothetical interpretations of situations and are used for explanation purposes only. The views in this report reflect solely those of the author and not necessarily those of CME Group or its affiliated institutions. This report and the information herein should not be considered investment advice or the results of actual market experience. Derivatives are not suitable for all investors and involve the risk of losing more than the amount originally deposited and any profit you might have made.  This communication is not a recommendation or offer to buy, sell or retain any specific investment or service. All examples in this report are hypothetical interpretations of situations and are used for explanation purposes only. The views in this report reflect solely those of the author and not necessarily those of CME Group or its affiliated institutions. This report and the information herein should not be considered investment advice or the results of actual market experience. CME Group Inc. does not have control over the content, accuracy, quality, or legality, of any third-party product, service, or content advertised on this webpage. The presence of such advertisements on this webpage does not signify any association, partnership, or endorsement of the third-party or its content by CME Group Inc. Full disclaimer Copyright © 2025 CME Group Inc."
    },
    {
        "title": "Be careful what you wish for on crypto regulation, this bear says",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-28 19:50:00",
        "link": "https://finance.yahoo.com/video/careful-wish-crypto-regulation-bear-185000137.html",
        "type": "VIDEO",
        "content": "Bitcoin (BTC-USD) rebounds from the pricing pullback the cryptocurrency saw over the last two days, the coin now back trading above $100,000. Innovating Capital founder and general partner Anthony Georgiades joins Catalysts with Seana Smith and Alexandra Canal to discuss his outlook on bitcoin and the crypto space. Georgiades explains he's more bearish than some on crypto: \"We're seeing obviously a lot of risk on sentiment. Things are priced to perfection ... It's not to say that I am skeptical or anti [to] the crypto progressive regulation that we're seeing, but I think it's one of those things where we need to be careful what we wish for with respect to things like a strategic reserve and certain legislative oversight.\" He says that while Innovating Capital is a long-term bitcoin holder, \"I do think that the market has priced in a lot of the positive catalysts over the last several months, and there's still a lot of risk on behavior tied to bitcoin as an asset,\" highlighting the crypto asset's downward moves. \"Generally speaking, I think the market's priced in a lot of potential friendly regulation and the probability of certain catalysts like a reserve taking place, whereas frankly speaking, the underlying fundamental behavior for a lot of that to actually make its way and permeate through the market, it's going to take years,\" Georgiades. Watch the video above to hear more about Georgiades' concerns about XRP (XRP-USD) and Ripple's RLUSD (RLUSD-USD) stablecoin. To watch more expert insights and analysis on the latest market action, check out more Catalysts here. This post was written by Naomi Buchanan."
    },
    {
        "title": "JP Morgan: SEC Crypto Shift May Usher in Solana, XRP ETPs",
        "publisher": "etf.com",
        "publish_date": "2025-01-15 15:00:00",
        "link": "https://finance.yahoo.com/m/51fda3bf-9e16-32c1-a2e4-b76d947d26e7/jp-morgan%3A-sec-crypto-shift.html",
        "type": "STORY",
        "content": "Solana and XRP could be next in line for spot cryptocurrency exchange-traded products, though analysts expect more modest asset inflows compared to bitcoin's success, according to a new J.P. Morgan Research report. The anticipated regulatory changes in 2025, including a new Securities and Exchange Commission chair and potential legislation clarifying crypto asset classification, could pave the way for the next wave of cryptocurrency ETPs—though J.P. Morgan analysts Kenneth B. Worthington, Michael Cho, Alexander Bernstein and Madeline Daleiden cautioned that investors demand for these “altcoin” products may be limited compared to bitcoin and Ethereum offerings. After the successful launch of bitcoin ETPs that gathered $36.5 billion in their first year, J.P. Morgan estimates potential Solana ETPs could attract $3 billion to $6 billion in assets, while XRP products might draw $4 billion to $8 billion, according to the report published Monday. These more modest projections reflect the smaller market capitalization of these tokens compared to bitcoin and Ethereum, the report noted, with Ethereum’s market cap roughly three to four times larger than both Solana and XRP. Several firms have already positioned themselves for potential approval, with Grayscale operating a $99 million Solana trust and a $12 million XRP trust that could convert to exchange-traded fundss, similar to its previous bitcoin trust conversion, according to the analysts. The report indicates multiple ETP applications for tokens like Solana have already been rejected by the current SEC, but firms may resubmit under new leadership that could take a more favorable stance toward crypto innovation. The new regulatory environment appears crucial for future approvals, the analysts write, as debate continues at the SEC around what constitutes a security versus a commodity—a key distinction that has delayed \"altcoin\" ETP applications. “Outside of a few primary tokens (i.e BTC, ETH, SOL), the episodic nature of the cryptomarket is driven by varying investor sentiment and trendy new coins that may capture incremental attention for a limited time,” the report stated. BlackRock Inc.’s decision not to pursue a Solona ETP due to uncertain investor demand highlights the challenges ahead, the analysts said, suggesting the broader crypto market’s breadth may outweigh individual token depth beyond the largest cryptocurrencies. The report suggested the recently approved bitcoin and Ethereum hybrid ETP products from Franklin Templeton and Hashdex, possibly set to launch this month with an 80/20 split matching market caps, could provide a template for future multi-token products. Market fundamentals will likely determine the success of new crypto ETPs in 2025, with J.P. Morgan analysts noting that Ethereum ETP assets currently represent just 3% of the token's $12 billion total market cap six months after launch, compared to bitcoin ETP assets reaching 6% of bitcoin’s $108 billion market cap in their first year.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Bitcoin ETFs see a record 4 days of outflows",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-14 17:24:00",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-see-record-4-162400200.html",
        "type": "VIDEO",
        "content": "Bitcoin ETFs see a record four days of outflows. Madison Mills joins Morning Brief to outline what investors need to know. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here. This post was written by Naomi Buchanan."
    },
    {
        "title": "Bitcoin ETFs see $36B in net inflows in first year",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-13 18:34:57",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-see-36b-net-173457022.html",
        "type": "VIDEO",
        "content": "The first spot bitcoin ETFs are approaching their one-year trading anniversary, attracting more than $36 billion in net inflows during this period. Yahoo Finance Markets & Data Editor Jared Blikre analyzes the digital asset's performance over the past year, highlighting the most significant gains and losses within the cryptocurrency space. To watch more expert insights and analysis on the latest market action, check out more Wealth here. This post was written by Angel Smith"
    },
    {
        "title": "Bitcoin ETFs hit $100B in year 1: Bitwise CIO talks 2025 growth",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-10 23:49:26",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-hit-100b-1-224926929.html",
        "type": "VIDEO",
        "content": "One year has passed since the SEC approved spot bitcoin ETFs, with these funds accumulating over $100 billion in total assets during their first year of trading. Bitwise Asset Management CIO Matt Hougan joins to discuss bitcoin's (BTC-USD) outlook for 2025. Bitwise operates several of its own bitcoin (BITB, BITC, BTOP) and crypto (BITQ, BITW) ETFs. \"As we look into 2025, the number of tailwinds pushing this industry forward is just extraordinarily strong,\" Hougan explains, citing ETF inflows, the incoming Trump administration, institutional investments, and other factors. He notes that there are \"too many long-term positives\" driving the market. Discussing the incoming Trump administration, Hougan outlines several key steps for the first 100 days: securing confirmation for crypto-friendly nominees, halting regulatory \"lawfare,\" and implementing enhanced stablecoin and market structure legislation. He suggests these actions could position the US as \"the crypto capital of the world.\" To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Angel Smith"
    },
    {
        "title": "Nasdaq Seeks SEC Approval for CoinShares' XRP, Litecoin ETFs",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 23:40:34",
        "link": "https://finance.yahoo.com/m/481e0920-ceea-363c-b194-99a6ddd87612/nasdaq-seeks-sec-approval-for.html",
        "type": "STORY",
        "content": "The Nasdaq stock exchange is seeking approval to list and trade XRP and Litecoin exchange-traded funds from CoinShares, adding to a wave of new crypto ETF applications. A Friday filing with the Securities and Exchange Commission comes as multiple firms look to introduce crypto ETFs beyond bitcoin, with Cboe submitting applications the same day for XRP funds from Bitwise, WisdomTree, Canary and 21Shares. The applications reflect financial services firms' efforts to meet rising investor demand for crypto-focused products. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up The push for new products comes amid changing regulatory dynamics at the SEC. Under acting Chair Mark Uyeda, the agency appears more open to considering crypto ETFs than it was under his predecessor, Gary Gensler. This regulatory evolution has prompted asset managers to explore opportunities beyond bitcoin-focused products. XRP's path to ETF approval faces unique challenges. The token has been at the center of a long-running legal battle with the SEC, which claimed it was sold as an unregistered security. While Ripple Labs, the creator and developer of the XRP token, secured a partial victory in 2023 when a federal judge ruled that XRP programmatic sales to exchanges that sell to retail investors did not break securities law (XRP is not a security according to this ruling), regulatory uncertainty persists, potentially complicating the SEC's decision. The filings mark the latest development in crypto's integration with traditional finance. Last week, Grayscale's Solana and Litecoin ETF applications were officially acknowledged by the SEC, following the firm's success in converting its bitcoin trust to an ETF. Under CoinShares' proposal, the XRP ETF would track the Compass Crypto Reference Index XRP while the Litecoin ETF would follow a separate Litecoin index from the same provider. Both funds would allow investors to access these cryptocurrencies through their regular brokerage accounts. According to the filings, both proposed ETFs would hold only their respective cryptocurrencies and cash, prohibiting any yield generation or staking. If approved, these funds could broaden institutional access to alternative cryptocurrencies. Spot bitcoin ETFs have grown at a record pace since they received SEC approval on Jan. 10, 2024, generating nearly $41 billion in inflows, according to UK-based asset manager Farside Investors. Their success has underscored the wider embrace of traditional finance services firms for digital assets and helped send bitcoin and other cryptos to new highs. Bitcoin has been hovering just below $100,000, off its all-time high of roughly $109,000 last month but more than double its level of a year ago, according to crypto markets data provider CoinMarketCap. XRP was recently trading at about $2.43, up more than quadrupled over the past year, while Litecoin was changing hands at roughly $110, a 69% increase from a year ago.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Traders Bet Big on Solana, XRP ETF Approvals in 2025",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 15:00:00",
        "link": "https://finance.yahoo.com/m/487ea23c-182e-30e4-8ce7-f7dcf5edc27a/traders-bet-big-on-solana%2C.html",
        "type": "STORY",
        "content": "This article is the second in a weekly series in February highlighting the growing influence and popularity of cryptocurrency-based ETFs. Traders are pouring money into bets on crypto ETF approvals this year, with prediction markets showing high confidence in multiple digital assets gaining regulatory green-lights. The betting activity reflects market expectations as the Securities and Exchange Commission considers a wave of new cryptocurrency investment products, suggesting traders believe regulatory barriers may ease in the coming months. According to data from Polymarket, a decentralized prediction platform, traders see an 85% chance of a Solana ETF gaining approval in 2025, though near-term odds for July 31 approval sit lower at 39%. These predictions come amid broader changes in the crypto ETF landscape, with the SEC recently acknowledging multiple new applications and showing increased openness to digital asset investment products, based on regulatory filings. For Litecoin, the gap between time frames appears smaller, with a 79% probability for 2025 approval compared to 44% by July 31, according to the Polymarket data. XRP shows a similar divergence in trader confidence, with 80% odds for 2025 approval versus 40% for July 31, highlighting how betting patterns favor year-end over midyear approvals. Memecoins face a more uncertain path, with Dogecoin ETF approval odds at 54% for 2025 and dropping to 29% for July 31, while Pepecoin remains a long shot at just 7% for the year, Polymarket data show. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up Trading volumes on these prediction markets indicate serious money backing these bets, with Solana ETF markets showing a combined $267,000 in volume, while XRP markets have attracted a combined $137,000 in bets, according to Polymarket. Despite lower approval odds, Dogecoin ETF markets lead in trading volume with $450,000 in combined bets. Market activity shows distinct patterns across different cryptocurrency categories, with an unexpected twist—while traders assign higher approval odds to established blockchain platforms, the memecoin Dogecoin has attracted the highest trading volume. This suggests a disconnect between predicted outcomes and trader interest, particularly in more speculative assets. The stark contrast between July and year-end odds suggests traders expect most approvals to come in the latter half of 2025, with probabilities nearly doubling when extending beyond the summer deadline.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Cryptocurrency Futures Exchange for Physical (EFP) Transactions",
        "publisher": "CME Group",
        "publish_date": "2025-02-07 21:51:00",
        "link": "https://finance.yahoo.com/news/cryptocurrency-futures-exchange-physical-efp-205100910.html",
        "type": "STORY",
        "content": "What is an EFP? What else do I need to know about EFPs? Benefits of an EFP Transaction How would this work for cryptocurrency? How do I get started? Why use our futures for cryptocurrency exposure? Exchange for Physical (EFP) transactions are privately negotiated trades between two counterparties allowing them to simultaneously transfer a futures position for an equivalent spot market position or vice versa. Back to Top Governed by Exchange Rule 538. Examples of an equivalent spot market position may include but are not limited to physical cryptocurrency, cryptocurrency ETFs and NDFs, etc. No minimum trade size; price increments must be in appropriate tick size, $5 per bitcoin or $0.50 per ether. Must be executed at commercially reasonable prices that are mutually agreed upon by the parties to the transaction. The futures leg should be reported as soon as possible but not later than the end of the business day on which the EFP was executed. Anyone can trade (no eligible party restriction). Parties to an EFP are required to prepare and maintain all documents in connection with both the futures and related physical cryptocurrency position pursuant to CFTC Regulation 1.35. Participants to an EFP can negotiate directly or can use a broker to help find the other side of the trade. Back to Top Added convenience of private negotiation. Risk management with CME Clearing, one of the world’s leading central counterparty clearing providers. Tried, tested and straightforward trading method for parties with complementary objectives. Available at all times, including weekends. Back to Top Clients can use the mechanism to efficiently transfer their cryptocurrency exposure from a physical to a futures position depending on their specific goals. Working through a broker or directly with each other, two parties agree to trade cryptocurrency between themselves; the two parties also agree to exchange an equivalent position in our Bitcoin/Ether futures that is opposite in direction to their respective physical cryptocurrency transaction. The spot market transaction can be bi-laterally negotiated and consummated on an OTC platform while the futures piece is cleared through CME Direct. Why enter into a cryptocurrency EFP transaction?  Who can benefit?  How can an EFP help? Monetize a long cryptocurrency position Miners, Commercials, All By selling physical cryptocurrency and buying an equivalent futures position, clients are able to free-up capital and yet maintain exposure to cryptocurrency price movements. Unwind a futures – spot cryptocurrency spread trade HFs, Props, CTAs, Retail Clients who are trying to benefit from a price dislocation between the spot and futures markets can use an EFP to close out the position and lock-in the spread. Manage cryptocurrency exposure during weekends/holidays All Futures trade electronically 23 hours a day from Sunday at 5:00 p.m. CT to Friday 4:00 p.m. CT. To manage risk when we are closed, clients can trade cryptocurrency in the spot market and EFP to futures. Cover a short cryptocurrency position OTC Desks, HFs, CTAs, Props A client who is short cryptocurrency and whose borrow has been called can use an EFP to access cryptocurrency to deliver against the short physical position and still remain short through the futures market. Source cryptocurrency to lend out OTC Desks, HFs, CTAs, Props Clients who do not have cryptocurrency inventory to lend out can use an EFP to source physical cryptocurrency, lend it, collect the lending fee and maintain market neutrality. Protect a cryptocurrency loan OTC Desks, Miners, All Clients who have loaned out their cryptocurrency inventory can use an EFP to hedge the risk of their cryptocurrency not being returned. Improved capital efficiencies Miners, All A key benefit of futures is the leverage they offer. By using an EFP, clients are able to free up capital for use in other alpha-generating strategies. Party B agrees to sell 500 bitcoin to Party A and buy 100 bitcoin futures from Party A (economically, both parties are risk neutral). Additionally, the two parties agree to a spread of $5 between the spot and futures price. If bitcoin is at $6,500 Party B receives $3,250,000 on the sale of bitcoin to Party A. Simultaneously, Party B buys the futures contracts from Party A at a price of $6,495 ($6,500 - $5). For the futures contract, Party B would need to maintain, at least, 37% margin* or $1,201,575. The difference between the bitcoin sale price and the margin that needs to be posted is freed up capital and may be used by Party B as needed. By using an EFP, Party B benefits from the leverage offered through the futures contract and is able to free up $2,048,425 while still maintaining exposure to bitcoin. *Represents exchange minimum, subject to change, clearing firms may require a higher amount Back to Top Establish a clearing account with one or more of the two plus dozen FCMs (Futures Commission Merchants) currently supporting the contracts. Download CME Direct platform. Register for ClearPort. Assign traders and brokers. Back to Top No need to establish a wallet; eliminates hacking risk. Easily convert cryptocurrency exposure to USD. No actual movement of cryptocurrency. Do not need possession of cryptocurrency to sell (or to borrow cryptocurrency to sell short). Price transparency, leverage, liquidity and capital efficiencies. Trade on a regulated, established Exchange. USD-settled contracts to reliable benchmark rates. View our suite of Cryptocurrency products. Back to Top Cryptocurrencies   Article   Product Information   Bitcoin All examples in this report are hypothetical interpretations of situations and are used for explanation purposes only. The views in this report reflect solely those of the author and not necessarily those of CME Group or its affiliated institutions. This report and the information herein should not be considered investment advice or the results of actual market experience. Derivatives are not suitable for all investors and involve the risk of losing more than the amount originally deposited and any profit you might have made.  This communication is not a recommendation or offer to buy, sell or retain any specific investment or service. All examples in this report are hypothetical interpretations of situations and are used for explanation purposes only. The views in this report reflect solely those of the author and not necessarily those of CME Group or its affiliated institutions. This report and the information herein should not be considered investment advice or the results of actual market experience. CME Group Inc. does not have control over the content, accuracy, quality, or legality, of any third-party product, service, or content advertised on this webpage. The presence of such advertisements on this webpage does not signify any association, partnership, or endorsement of the third-party or its content by CME Group Inc. Full disclaimer Copyright © 2025 CME Group Inc."
    },
    {
        "title": "Be careful what you wish for on crypto regulation, this bear says",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-28 19:50:00",
        "link": "https://finance.yahoo.com/video/careful-wish-crypto-regulation-bear-185000137.html",
        "type": "VIDEO",
        "content": "Bitcoin (BTC-USD) rebounds from the pricing pullback the cryptocurrency saw over the last two days, the coin now back trading above $100,000. Innovating Capital founder and general partner Anthony Georgiades joins Catalysts with Seana Smith and Alexandra Canal to discuss his outlook on bitcoin and the crypto space. Georgiades explains he's more bearish than some on crypto: \"We're seeing obviously a lot of risk on sentiment. Things are priced to perfection ... It's not to say that I am skeptical or anti [to] the crypto progressive regulation that we're seeing, but I think it's one of those things where we need to be careful what we wish for with respect to things like a strategic reserve and certain legislative oversight.\" He says that while Innovating Capital is a long-term bitcoin holder, \"I do think that the market has priced in a lot of the positive catalysts over the last several months, and there's still a lot of risk on behavior tied to bitcoin as an asset,\" highlighting the crypto asset's downward moves. \"Generally speaking, I think the market's priced in a lot of potential friendly regulation and the probability of certain catalysts like a reserve taking place, whereas frankly speaking, the underlying fundamental behavior for a lot of that to actually make its way and permeate through the market, it's going to take years,\" Georgiades. Watch the video above to hear more about Georgiades' concerns about XRP (XRP-USD) and Ripple's RLUSD (RLUSD-USD) stablecoin. To watch more expert insights and analysis on the latest market action, check out more Catalysts here. This post was written by Naomi Buchanan."
    },
    {
        "title": "JP Morgan: SEC Crypto Shift May Usher in Solana, XRP ETPs",
        "publisher": "etf.com",
        "publish_date": "2025-01-15 15:00:00",
        "link": "https://finance.yahoo.com/m/51fda3bf-9e16-32c1-a2e4-b76d947d26e7/jp-morgan%3A-sec-crypto-shift.html",
        "type": "STORY",
        "content": "Solana and XRP could be next in line for spot cryptocurrency exchange-traded products, though analysts expect more modest asset inflows compared to bitcoin's success, according to a new J.P. Morgan Research report. The anticipated regulatory changes in 2025, including a new Securities and Exchange Commission chair and potential legislation clarifying crypto asset classification, could pave the way for the next wave of cryptocurrency ETPs—though J.P. Morgan analysts Kenneth B. Worthington, Michael Cho, Alexander Bernstein and Madeline Daleiden cautioned that investors demand for these “altcoin” products may be limited compared to bitcoin and Ethereum offerings. After the successful launch of bitcoin ETPs that gathered $36.5 billion in their first year, J.P. Morgan estimates potential Solana ETPs could attract $3 billion to $6 billion in assets, while XRP products might draw $4 billion to $8 billion, according to the report published Monday. These more modest projections reflect the smaller market capitalization of these tokens compared to bitcoin and Ethereum, the report noted, with Ethereum’s market cap roughly three to four times larger than both Solana and XRP. Several firms have already positioned themselves for potential approval, with Grayscale operating a $99 million Solana trust and a $12 million XRP trust that could convert to exchange-traded fundss, similar to its previous bitcoin trust conversion, according to the analysts. The report indicates multiple ETP applications for tokens like Solana have already been rejected by the current SEC, but firms may resubmit under new leadership that could take a more favorable stance toward crypto innovation. The new regulatory environment appears crucial for future approvals, the analysts write, as debate continues at the SEC around what constitutes a security versus a commodity—a key distinction that has delayed \"altcoin\" ETP applications. “Outside of a few primary tokens (i.e BTC, ETH, SOL), the episodic nature of the cryptomarket is driven by varying investor sentiment and trendy new coins that may capture incremental attention for a limited time,” the report stated. BlackRock Inc.’s decision not to pursue a Solona ETP due to uncertain investor demand highlights the challenges ahead, the analysts said, suggesting the broader crypto market’s breadth may outweigh individual token depth beyond the largest cryptocurrencies. The report suggested the recently approved bitcoin and Ethereum hybrid ETP products from Franklin Templeton and Hashdex, possibly set to launch this month with an 80/20 split matching market caps, could provide a template for future multi-token products. Market fundamentals will likely determine the success of new crypto ETPs in 2025, with J.P. Morgan analysts noting that Ethereum ETP assets currently represent just 3% of the token's $12 billion total market cap six months after launch, compared to bitcoin ETP assets reaching 6% of bitcoin’s $108 billion market cap in their first year.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Bitcoin ETFs see a record 4 days of outflows",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-14 17:24:00",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-see-record-4-162400200.html",
        "type": "VIDEO",
        "content": "Bitcoin ETFs see a record four days of outflows. Madison Mills joins Morning Brief to outline what investors need to know. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here. This post was written by Naomi Buchanan."
    },
    {
        "title": "Bitcoin ETFs see $36B in net inflows in first year",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-13 18:34:57",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-see-36b-net-173457022.html",
        "type": "VIDEO",
        "content": "The first spot bitcoin ETFs are approaching their one-year trading anniversary, attracting more than $36 billion in net inflows during this period. Yahoo Finance Markets & Data Editor Jared Blikre analyzes the digital asset's performance over the past year, highlighting the most significant gains and losses within the cryptocurrency space. To watch more expert insights and analysis on the latest market action, check out more Wealth here. This post was written by Angel Smith"
    },
    {
        "title": "Bitcoin ETFs hit $100B in year 1: Bitwise CIO talks 2025 growth",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-10 23:49:26",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-hit-100b-1-224926929.html",
        "type": "VIDEO",
        "content": "One year has passed since the SEC approved spot bitcoin ETFs, with these funds accumulating over $100 billion in total assets during their first year of trading. Bitwise Asset Management CIO Matt Hougan joins to discuss bitcoin's (BTC-USD) outlook for 2025. Bitwise operates several of its own bitcoin (BITB, BITC, BTOP) and crypto (BITQ, BITW) ETFs. \"As we look into 2025, the number of tailwinds pushing this industry forward is just extraordinarily strong,\" Hougan explains, citing ETF inflows, the incoming Trump administration, institutional investments, and other factors. He notes that there are \"too many long-term positives\" driving the market. Discussing the incoming Trump administration, Hougan outlines several key steps for the first 100 days: securing confirmation for crypto-friendly nominees, halting regulatory \"lawfare,\" and implementing enhanced stablecoin and market structure legislation. He suggests these actions could position the US as \"the crypto capital of the world.\" To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Angel Smith"
    },
    {
        "title": "Nasdaq Seeks SEC Approval for CoinShares' XRP, Litecoin ETFs",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 23:40:34",
        "link": "https://finance.yahoo.com/m/481e0920-ceea-363c-b194-99a6ddd87612/nasdaq-seeks-sec-approval-for.html",
        "type": "STORY",
        "content": "The Nasdaq stock exchange is seeking approval to list and trade XRP and Litecoin exchange-traded funds from CoinShares, adding to a wave of new crypto ETF applications. A Friday filing with the Securities and Exchange Commission comes as multiple firms look to introduce crypto ETFs beyond bitcoin, with Cboe submitting applications the same day for XRP funds from Bitwise, WisdomTree, Canary and 21Shares. The applications reflect financial services firms' efforts to meet rising investor demand for crypto-focused products. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up The push for new products comes amid changing regulatory dynamics at the SEC. Under acting Chair Mark Uyeda, the agency appears more open to considering crypto ETFs than it was under his predecessor, Gary Gensler. This regulatory evolution has prompted asset managers to explore opportunities beyond bitcoin-focused products. XRP's path to ETF approval faces unique challenges. The token has been at the center of a long-running legal battle with the SEC, which claimed it was sold as an unregistered security. While Ripple Labs, the creator and developer of the XRP token, secured a partial victory in 2023 when a federal judge ruled that XRP programmatic sales to exchanges that sell to retail investors did not break securities law (XRP is not a security according to this ruling), regulatory uncertainty persists, potentially complicating the SEC's decision. The filings mark the latest development in crypto's integration with traditional finance. Last week, Grayscale's Solana and Litecoin ETF applications were officially acknowledged by the SEC, following the firm's success in converting its bitcoin trust to an ETF. Under CoinShares' proposal, the XRP ETF would track the Compass Crypto Reference Index XRP while the Litecoin ETF would follow a separate Litecoin index from the same provider. Both funds would allow investors to access these cryptocurrencies through their regular brokerage accounts. According to the filings, both proposed ETFs would hold only their respective cryptocurrencies and cash, prohibiting any yield generation or staking. If approved, these funds could broaden institutional access to alternative cryptocurrencies. Spot bitcoin ETFs have grown at a record pace since they received SEC approval on Jan. 10, 2024, generating nearly $41 billion in inflows, according to UK-based asset manager Farside Investors. Their success has underscored the wider embrace of traditional finance services firms for digital assets and helped send bitcoin and other cryptos to new highs. Bitcoin has been hovering just below $100,000, off its all-time high of roughly $109,000 last month but more than double its level of a year ago, according to crypto markets data provider CoinMarketCap. XRP was recently trading at about $2.43, up more than quadrupled over the past year, while Litecoin was changing hands at roughly $110, a 69% increase from a year ago.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Traders Bet Big on Solana, XRP ETF Approvals in 2025",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 15:00:00",
        "link": "https://finance.yahoo.com/m/487ea23c-182e-30e4-8ce7-f7dcf5edc27a/traders-bet-big-on-solana%2C.html",
        "type": "STORY",
        "content": "This article is the second in a weekly series in February highlighting the growing influence and popularity of cryptocurrency-based ETFs. Traders are pouring money into bets on crypto ETF approvals this year, with prediction markets showing high confidence in multiple digital assets gaining regulatory green-lights. The betting activity reflects market expectations as the Securities and Exchange Commission considers a wave of new cryptocurrency investment products, suggesting traders believe regulatory barriers may ease in the coming months. According to data from Polymarket, a decentralized prediction platform, traders see an 85% chance of a Solana ETF gaining approval in 2025, though near-term odds for July 31 approval sit lower at 39%. These predictions come amid broader changes in the crypto ETF landscape, with the SEC recently acknowledging multiple new applications and showing increased openness to digital asset investment products, based on regulatory filings. For Litecoin, the gap between time frames appears smaller, with a 79% probability for 2025 approval compared to 44% by July 31, according to the Polymarket data. XRP shows a similar divergence in trader confidence, with 80% odds for 2025 approval versus 40% for July 31, highlighting how betting patterns favor year-end over midyear approvals. Memecoins face a more uncertain path, with Dogecoin ETF approval odds at 54% for 2025 and dropping to 29% for July 31, while Pepecoin remains a long shot at just 7% for the year, Polymarket data show. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up Trading volumes on these prediction markets indicate serious money backing these bets, with Solana ETF markets showing a combined $267,000 in volume, while XRP markets have attracted a combined $137,000 in bets, according to Polymarket. Despite lower approval odds, Dogecoin ETF markets lead in trading volume with $450,000 in combined bets. Market activity shows distinct patterns across different cryptocurrency categories, with an unexpected twist—while traders assign higher approval odds to established blockchain platforms, the memecoin Dogecoin has attracted the highest trading volume. This suggests a disconnect between predicted outcomes and trader interest, particularly in more speculative assets. The stark contrast between July and year-end odds suggests traders expect most approvals to come in the latter half of 2025, with probabilities nearly doubling when extending beyond the summer deadline.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Cryptocurrency Futures Exchange for Physical (EFP) Transactions",
        "publisher": "CME Group",
        "publish_date": "2025-02-07 21:51:00",
        "link": "https://finance.yahoo.com/news/cryptocurrency-futures-exchange-physical-efp-205100910.html",
        "type": "STORY",
        "content": "What is an EFP? What else do I need to know about EFPs? Benefits of an EFP Transaction How would this work for cryptocurrency? How do I get started? Why use our futures for cryptocurrency exposure? Exchange for Physical (EFP) transactions are privately negotiated trades between two counterparties allowing them to simultaneously transfer a futures position for an equivalent spot market position or vice versa. Back to Top Governed by Exchange Rule 538. Examples of an equivalent spot market position may include but are not limited to physical cryptocurrency, cryptocurrency ETFs and NDFs, etc. No minimum trade size; price increments must be in appropriate tick size, $5 per bitcoin or $0.50 per ether. Must be executed at commercially reasonable prices that are mutually agreed upon by the parties to the transaction. The futures leg should be reported as soon as possible but not later than the end of the business day on which the EFP was executed. Anyone can trade (no eligible party restriction). Parties to an EFP are required to prepare and maintain all documents in connection with both the futures and related physical cryptocurrency position pursuant to CFTC Regulation 1.35. Participants to an EFP can negotiate directly or can use a broker to help find the other side of the trade. Back to Top Added convenience of private negotiation. Risk management with CME Clearing, one of the world’s leading central counterparty clearing providers. Tried, tested and straightforward trading method for parties with complementary objectives. Available at all times, including weekends. Back to Top Clients can use the mechanism to efficiently transfer their cryptocurrency exposure from a physical to a futures position depending on their specific goals. Working through a broker or directly with each other, two parties agree to trade cryptocurrency between themselves; the two parties also agree to exchange an equivalent position in our Bitcoin/Ether futures that is opposite in direction to their respective physical cryptocurrency transaction. The spot market transaction can be bi-laterally negotiated and consummated on an OTC platform while the futures piece is cleared through CME Direct. Why enter into a cryptocurrency EFP transaction?  Who can benefit?  How can an EFP help? Monetize a long cryptocurrency position Miners, Commercials, All By selling physical cryptocurrency and buying an equivalent futures position, clients are able to free-up capital and yet maintain exposure to cryptocurrency price movements. Unwind a futures – spot cryptocurrency spread trade HFs, Props, CTAs, Retail Clients who are trying to benefit from a price dislocation between the spot and futures markets can use an EFP to close out the position and lock-in the spread. Manage cryptocurrency exposure during weekends/holidays All Futures trade electronically 23 hours a day from Sunday at 5:00 p.m. CT to Friday 4:00 p.m. CT. To manage risk when we are closed, clients can trade cryptocurrency in the spot market and EFP to futures. Cover a short cryptocurrency position OTC Desks, HFs, CTAs, Props A client who is short cryptocurrency and whose borrow has been called can use an EFP to access cryptocurrency to deliver against the short physical position and still remain short through the futures market. Source cryptocurrency to lend out OTC Desks, HFs, CTAs, Props Clients who do not have cryptocurrency inventory to lend out can use an EFP to source physical cryptocurrency, lend it, collect the lending fee and maintain market neutrality. Protect a cryptocurrency loan OTC Desks, Miners, All Clients who have loaned out their cryptocurrency inventory can use an EFP to hedge the risk of their cryptocurrency not being returned. Improved capital efficiencies Miners, All A key benefit of futures is the leverage they offer. By using an EFP, clients are able to free up capital for use in other alpha-generating strategies. Party B agrees to sell 500 bitcoin to Party A and buy 100 bitcoin futures from Party A (economically, both parties are risk neutral). Additionally, the two parties agree to a spread of $5 between the spot and futures price. If bitcoin is at $6,500 Party B receives $3,250,000 on the sale of bitcoin to Party A. Simultaneously, Party B buys the futures contracts from Party A at a price of $6,495 ($6,500 - $5). For the futures contract, Party B would need to maintain, at least, 37% margin* or $1,201,575. The difference between the bitcoin sale price and the margin that needs to be posted is freed up capital and may be used by Party B as needed. By using an EFP, Party B benefits from the leverage offered through the futures contract and is able to free up $2,048,425 while still maintaining exposure to bitcoin. *Represents exchange minimum, subject to change, clearing firms may require a higher amount Back to Top Establish a clearing account with one or more of the two plus dozen FCMs (Futures Commission Merchants) currently supporting the contracts. Download CME Direct platform. Register for ClearPort. Assign traders and brokers. Back to Top No need to establish a wallet; eliminates hacking risk. Easily convert cryptocurrency exposure to USD. No actual movement of cryptocurrency. Do not need possession of cryptocurrency to sell (or to borrow cryptocurrency to sell short). Price transparency, leverage, liquidity and capital efficiencies. Trade on a regulated, established Exchange. USD-settled contracts to reliable benchmark rates. View our suite of Cryptocurrency products. Back to Top Cryptocurrencies   Article   Product Information   Bitcoin All examples in this report are hypothetical interpretations of situations and are used for explanation purposes only. The views in this report reflect solely those of the author and not necessarily those of CME Group or its affiliated institutions. This report and the information herein should not be considered investment advice or the results of actual market experience. Derivatives are not suitable for all investors and involve the risk of losing more than the amount originally deposited and any profit you might have made.  This communication is not a recommendation or offer to buy, sell or retain any specific investment or service. All examples in this report are hypothetical interpretations of situations and are used for explanation purposes only. The views in this report reflect solely those of the author and not necessarily those of CME Group or its affiliated institutions. This report and the information herein should not be considered investment advice or the results of actual market experience. CME Group Inc. does not have control over the content, accuracy, quality, or legality, of any third-party product, service, or content advertised on this webpage. The presence of such advertisements on this webpage does not signify any association, partnership, or endorsement of the third-party or its content by CME Group Inc. Full disclaimer Copyright © 2025 CME Group Inc."
    },
    {
        "title": "Be careful what you wish for on crypto regulation, this bear says",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-28 19:50:00",
        "link": "https://finance.yahoo.com/video/careful-wish-crypto-regulation-bear-185000137.html",
        "type": "VIDEO",
        "content": "Bitcoin (BTC-USD) rebounds from the pricing pullback the cryptocurrency saw over the last two days, the coin now back trading above $100,000. Innovating Capital founder and general partner Anthony Georgiades joins Catalysts with Seana Smith and Alexandra Canal to discuss his outlook on bitcoin and the crypto space. Georgiades explains he's more bearish than some on crypto: \"We're seeing obviously a lot of risk on sentiment. Things are priced to perfection ... It's not to say that I am skeptical or anti [to] the crypto progressive regulation that we're seeing, but I think it's one of those things where we need to be careful what we wish for with respect to things like a strategic reserve and certain legislative oversight.\" He says that while Innovating Capital is a long-term bitcoin holder, \"I do think that the market has priced in a lot of the positive catalysts over the last several months, and there's still a lot of risk on behavior tied to bitcoin as an asset,\" highlighting the crypto asset's downward moves. \"Generally speaking, I think the market's priced in a lot of potential friendly regulation and the probability of certain catalysts like a reserve taking place, whereas frankly speaking, the underlying fundamental behavior for a lot of that to actually make its way and permeate through the market, it's going to take years,\" Georgiades. Watch the video above to hear more about Georgiades' concerns about XRP (XRP-USD) and Ripple's RLUSD (RLUSD-USD) stablecoin. To watch more expert insights and analysis on the latest market action, check out more Catalysts here. This post was written by Naomi Buchanan."
    },
    {
        "title": "JP Morgan: SEC Crypto Shift May Usher in Solana, XRP ETPs",
        "publisher": "etf.com",
        "publish_date": "2025-01-15 15:00:00",
        "link": "https://finance.yahoo.com/m/51fda3bf-9e16-32c1-a2e4-b76d947d26e7/jp-morgan%3A-sec-crypto-shift.html",
        "type": "STORY",
        "content": "Solana and XRP could be next in line for spot cryptocurrency exchange-traded products, though analysts expect more modest asset inflows compared to bitcoin's success, according to a new J.P. Morgan Research report. The anticipated regulatory changes in 2025, including a new Securities and Exchange Commission chair and potential legislation clarifying crypto asset classification, could pave the way for the next wave of cryptocurrency ETPs—though J.P. Morgan analysts Kenneth B. Worthington, Michael Cho, Alexander Bernstein and Madeline Daleiden cautioned that investors demand for these “altcoin” products may be limited compared to bitcoin and Ethereum offerings. After the successful launch of bitcoin ETPs that gathered $36.5 billion in their first year, J.P. Morgan estimates potential Solana ETPs could attract $3 billion to $6 billion in assets, while XRP products might draw $4 billion to $8 billion, according to the report published Monday. These more modest projections reflect the smaller market capitalization of these tokens compared to bitcoin and Ethereum, the report noted, with Ethereum’s market cap roughly three to four times larger than both Solana and XRP. Several firms have already positioned themselves for potential approval, with Grayscale operating a $99 million Solana trust and a $12 million XRP trust that could convert to exchange-traded fundss, similar to its previous bitcoin trust conversion, according to the analysts. The report indicates multiple ETP applications for tokens like Solana have already been rejected by the current SEC, but firms may resubmit under new leadership that could take a more favorable stance toward crypto innovation. The new regulatory environment appears crucial for future approvals, the analysts write, as debate continues at the SEC around what constitutes a security versus a commodity—a key distinction that has delayed \"altcoin\" ETP applications. “Outside of a few primary tokens (i.e BTC, ETH, SOL), the episodic nature of the cryptomarket is driven by varying investor sentiment and trendy new coins that may capture incremental attention for a limited time,” the report stated. BlackRock Inc.’s decision not to pursue a Solona ETP due to uncertain investor demand highlights the challenges ahead, the analysts said, suggesting the broader crypto market’s breadth may outweigh individual token depth beyond the largest cryptocurrencies. The report suggested the recently approved bitcoin and Ethereum hybrid ETP products from Franklin Templeton and Hashdex, possibly set to launch this month with an 80/20 split matching market caps, could provide a template for future multi-token products. Market fundamentals will likely determine the success of new crypto ETPs in 2025, with J.P. Morgan analysts noting that Ethereum ETP assets currently represent just 3% of the token's $12 billion total market cap six months after launch, compared to bitcoin ETP assets reaching 6% of bitcoin’s $108 billion market cap in their first year.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Bitcoin ETFs see a record 4 days of outflows",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-14 17:24:00",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-see-record-4-162400200.html",
        "type": "VIDEO",
        "content": "Bitcoin ETFs see a record four days of outflows. Madison Mills joins Morning Brief to outline what investors need to know. To watch more expert insights and analysis on the latest market action, check out more Morning Brief here. This post was written by Naomi Buchanan."
    },
    {
        "title": "Bitcoin ETFs see $36B in net inflows in first year",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-13 18:34:57",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-see-36b-net-173457022.html",
        "type": "VIDEO",
        "content": "The first spot bitcoin ETFs are approaching their one-year trading anniversary, attracting more than $36 billion in net inflows during this period. Yahoo Finance Markets & Data Editor Jared Blikre analyzes the digital asset's performance over the past year, highlighting the most significant gains and losses within the cryptocurrency space. To watch more expert insights and analysis on the latest market action, check out more Wealth here. This post was written by Angel Smith"
    },
    {
        "title": "Bitcoin ETFs hit $100B in year 1: Bitwise CIO talks 2025 growth",
        "publisher": "Yahoo Finance Video",
        "publish_date": "2025-01-10 23:49:26",
        "link": "https://finance.yahoo.com/video/bitcoin-etfs-hit-100b-1-224926929.html",
        "type": "VIDEO",
        "content": "One year has passed since the SEC approved spot bitcoin ETFs, with these funds accumulating over $100 billion in total assets during their first year of trading. Bitwise Asset Management CIO Matt Hougan joins to discuss bitcoin's (BTC-USD) outlook for 2025. Bitwise operates several of its own bitcoin (BITB, BITC, BTOP) and crypto (BITQ, BITW) ETFs. \"As we look into 2025, the number of tailwinds pushing this industry forward is just extraordinarily strong,\" Hougan explains, citing ETF inflows, the incoming Trump administration, institutional investments, and other factors. He notes that there are \"too many long-term positives\" driving the market. Discussing the incoming Trump administration, Hougan outlines several key steps for the first 100 days: securing confirmation for crypto-friendly nominees, halting regulatory \"lawfare,\" and implementing enhanced stablecoin and market structure legislation. He suggests these actions could position the US as \"the crypto capital of the world.\" To watch more expert insights and analysis on the latest market action, check out more Asking for a Trend here. This post was written by Angel Smith"
    },
    {
        "title": "Nasdaq Seeks SEC Approval for CoinShares' XRP, Litecoin ETFs",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 23:40:34",
        "link": "https://finance.yahoo.com/m/481e0920-ceea-363c-b194-99a6ddd87612/nasdaq-seeks-sec-approval-for.html",
        "type": "STORY",
        "content": "The Nasdaq stock exchange is seeking approval to list and trade XRP and Litecoin exchange-traded funds from CoinShares, adding to a wave of new crypto ETF applications. A Friday filing with the Securities and Exchange Commission comes as multiple firms look to introduce crypto ETFs beyond bitcoin, with Cboe submitting applications the same day for XRP funds from Bitwise, WisdomTree, Canary and 21Shares. The applications reflect financial services firms' efforts to meet rising investor demand for crypto-focused products. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up The push for new products comes amid changing regulatory dynamics at the SEC. Under acting Chair Mark Uyeda, the agency appears more open to considering crypto ETFs than it was under his predecessor, Gary Gensler. This regulatory evolution has prompted asset managers to explore opportunities beyond bitcoin-focused products. XRP's path to ETF approval faces unique challenges. The token has been at the center of a long-running legal battle with the SEC, which claimed it was sold as an unregistered security. While Ripple Labs, the creator and developer of the XRP token, secured a partial victory in 2023 when a federal judge ruled that XRP programmatic sales to exchanges that sell to retail investors did not break securities law (XRP is not a security according to this ruling), regulatory uncertainty persists, potentially complicating the SEC's decision. The filings mark the latest development in crypto's integration with traditional finance. Last week, Grayscale's Solana and Litecoin ETF applications were officially acknowledged by the SEC, following the firm's success in converting its bitcoin trust to an ETF. Under CoinShares' proposal, the XRP ETF would track the Compass Crypto Reference Index XRP while the Litecoin ETF would follow a separate Litecoin index from the same provider. Both funds would allow investors to access these cryptocurrencies through their regular brokerage accounts. According to the filings, both proposed ETFs would hold only their respective cryptocurrencies and cash, prohibiting any yield generation or staking. If approved, these funds could broaden institutional access to alternative cryptocurrencies. Spot bitcoin ETFs have grown at a record pace since they received SEC approval on Jan. 10, 2024, generating nearly $41 billion in inflows, according to UK-based asset manager Farside Investors. Their success has underscored the wider embrace of traditional finance services firms for digital assets and helped send bitcoin and other cryptos to new highs. Bitcoin has been hovering just below $100,000, off its all-time high of roughly $109,000 last month but more than double its level of a year ago, according to crypto markets data provider CoinMarketCap. XRP was recently trading at about $2.43, up more than quadrupled over the past year, while Litecoin was changing hands at roughly $110, a 69% increase from a year ago.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    },
    {
        "title": "Traders Bet Big on Solana, XRP ETF Approvals in 2025",
        "publisher": "etf.com",
        "publish_date": "2025-02-10 15:00:00",
        "link": "https://finance.yahoo.com/m/487ea23c-182e-30e4-8ce7-f7dcf5edc27a/traders-bet-big-on-solana%2C.html",
        "type": "STORY",
        "content": "This article is the second in a weekly series in February highlighting the growing influence and popularity of cryptocurrency-based ETFs. Traders are pouring money into bets on crypto ETF approvals this year, with prediction markets showing high confidence in multiple digital assets gaining regulatory green-lights. The betting activity reflects market expectations as the Securities and Exchange Commission considers a wave of new cryptocurrency investment products, suggesting traders believe regulatory barriers may ease in the coming months. According to data from Polymarket, a decentralized prediction platform, traders see an 85% chance of a Solana ETF gaining approval in 2025, though near-term odds for July 31 approval sit lower at 39%. These predictions come amid broader changes in the crypto ETF landscape, with the SEC recently acknowledging multiple new applications and showing increased openness to digital asset investment products, based on regulatory filings. For Litecoin, the gap between time frames appears smaller, with a 79% probability for 2025 approval compared to 44% by July 31, according to the Polymarket data. XRP shows a similar divergence in trader confidence, with 80% odds for 2025 approval versus 40% for July 31, highlighting how betting patterns favor year-end over midyear approvals. Memecoins face a more uncertain path, with Dogecoin ETF approval odds at 54% for 2025 and dropping to 29% for July 31, while Pepecoin remains a long shot at just 7% for the year, Polymarket data show. Read More: Crypto-Focused ETF Applications Surge as SEC Lightens Up Trading volumes on these prediction markets indicate serious money backing these bets, with Solana ETF markets showing a combined $267,000 in volume, while XRP markets have attracted a combined $137,000 in bets, according to Polymarket. Despite lower approval odds, Dogecoin ETF markets lead in trading volume with $450,000 in combined bets. Market activity shows distinct patterns across different cryptocurrency categories, with an unexpected twist—while traders assign higher approval odds to established blockchain platforms, the memecoin Dogecoin has attracted the highest trading volume. This suggests a disconnect between predicted outcomes and trader interest, particularly in more speculative assets. The stark contrast between July and year-end odds suggests traders expect most approvals to come in the latter half of 2025, with probabilities nearly doubling when extending beyond the summer deadline.  Permalink | © Copyright 2025 etf.com. All rights reserved"
    }
]