{
    "status": "ok",
    "totalResults": 1404,
    "page": 1,
    "pageSize": 20,
    "articles": [
        {
            "link": "https://finance.yahoo.com/news/bitcoin-price-faces-volatility-market-075724949.html",
            "source": "finance.yahoo.com",
            "title": "Bitcoin Price Faces Volatility as Market Braces for Potential $85K Breakdown Following August 2023 Pattern",
            "summary": "",
            "authors": "Ayesha Aziz, Wed, Feb, Min Read",
            "publishDate": "2025-02-19T07:57:24+00:00",
            "content": "Bitcoin Price Faces Volatility as Market Braces for Potential $85K Breakdown Following August 2023 Pattern\n\nBitcoin's price is showing signs of volatility, with recent fluctuations sparking comparisons to its movements in August 2023. On Feb. 17, research from on-chain analytics platform CryptoQuant pointed out that Bitcoin's price action has become increasingly rangebound, signaling a potential shift in market behavior. The Choppiness Index, a measure of market volatility, has reached high levels, indicating that a significant price movement could be imminent.\n\nThe current range for Bitcoin has been hovering around 16% over the last 90 days, with a noticeable lack of trend in its price action. The Choppiness Index, which stands at 62 on the daily chart and 72 on the weekly chart, shows instability and an urgent need for Bitcoin to break out of its stagnant price range. According to CryptoQuant contributor Percival, such conditions often precede a larger market move. He notes that similar behavior was observed in August 2023 when Bitcoin experienced a sharp drop before beginning a sustained uptrend.\n\nIn 2023, before Bitcoin's price surged, the market had seen relatively low volatility, which caused many traders to abandon their positions. Percival suggests that the current situation could lead to a liquidity grab, where market participants holding positions on the wrong side of the trade are cleared out before a potential price rise. His analysis highlights that Bitcoin's price movements are currently erratic, with alternating periods of rapid gains and consolidations.\n\nWhile Bitcoin is facing short-term uncertainty, long-term prospects remain positive. The increasing adoption of cryptocurrencies and institutional interest in digital assets like Bitcoin has led to an overall bullish sentiment. However, Bitcoin's price action is still subject to significant volatility, and investors are advised to remain cautious and well-informed about market developments.\n\nRegarding potential price levels, the short-term holder (STH) cost basis of $92,000 is being closely monitored as a key level of support. If Bitcoin fails to hold this level, attention will shift to the 200-day exponential moving average (EMA), which is currently at $85,000. This could serve as a critical support zone if the market continues to experience downward pressure.\n\nBitcoin’s price action is in a highly volatile phase, with significant potential for movement in either direction. While market sentiment is mixed, some analysts believe a major price move is on the horizon. Investors are advised to watch key levels like the $92,000 cost basis and the $85,000 EMA as critical indicators of Bitcoin’s next move. As the situation develops, staying updated on market trends and adjusting strategies accordingly will be essential for navigating the unpredictable nature of Bitcoin's price.",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9168668389320374"
        },
        {
            "link": "https://finance.yahoo.com/news/hong-kong-issues-nine-digital-020957208.html",
            "source": "finance.yahoo.com",
            "title": "Hong Kong eyes crypto derivatives, margin lending in digital asset push",
            "summary": "",
            "authors": "Summer Zhen, Jiaxing Li, Wed, Feb, Min Read",
            "publishDate": "2025-02-19T02:09:57+00:00",
            "content": "By Summer Zhen and Jiaxing Li\n\nHONG KONG (Reuters) - Hong Kong is considering approving derivatives and margin lending in virtual assets for some investors, its financial regulator said on Wednesday, as the city seeks to boost its competitiveness as a digital assets hub and attract capital.\n\nHong Kong first drew up a plan to become a virtual asset trading centre in 2022 - an effort that followed Beijing's sweeping ban on all cryptocurrency transactions in mainland China the previous year.\n\nIt has since launched the first spot crypto exchange-traded funds in Asia and other initiatives.\n\n\"We are considering derivative products for professional investors, margin lending for certain customers,\" Securities and Futures Commission (SFC) CEO Julia Leung told CoinDesk's Consensus Hong Kong 2025 conference, referring to digital assets.\n\nThe city's financial secretary, Paul Chan, told the event the city's regulators have so far issued nine virtual asset trading platform (VATP) licences.\n\nBullish Group, a cryptocurrency exchange which owns crypto news website CoinDesk, said it had been granted one of the licences on Tuesday.\n\nLeung said there are eight more applications being considered, and Chan said the government was also working to advance the regulation of stablecoin cryptocurrencies.\n\nHong Kong's SFC will release a virtual asset roadmap later on Wednesday with detailed growth plans, Leung added.\n\nAlongside Hong Kong, Singapore and Dubai are also aiming to become global hubs for virtual assets.\n\nConsensus Hong Kong is the first major crypto industry gathering since U.S. President Donald Trump took office last month, promising crypto-friendly policies, and speakers expressed a bullish view on the regulatory environment.\n\n\"There's a big shift in sentiment in the U.S.,\" said Richard Teng, chief executive of Binance Holdings.\n\nHe said some sovereign wealth funds and institutional investors have gone from debating whether they should invest in crypto to considering how much they should invest.\n\nSeparately, Justin Sun, founder of the Tron blockchain network, told a panel he had invested in World Liberty Financial - a newly launched crypto company partly owned by Trump - because it focuses \"on bridging traditional finance with the crypto world\".\n\nThe price of bitcoin more than doubled last year. It hit an all-time high of $109,071 on January 20 this year, the day of Trump's inauguration, but has since pulled back to stand at about $96,000.\n\n(Reporting by Summer Zhen and Jiaxing Li in Hong Kong; Writing by Scott Murdoch; Editing by Edwina Gibbs, Sonali Paul and Helen Popper)",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9999650716781616"
        },
        {
            "link": "https://finance.yahoo.com/news/elon-musk-wonders-us-gold-193014705.html",
            "source": "finance.yahoo.com",
            "title": "Elon Musk Wonders If US Gold Reserves Are Regularly Audited—Cynthia Lummis Tells DOGE Lead It's Time To Add Bitcoin For Transparency",
            "summary": "",
            "authors": "Aniket Verma, Mon, Feb, Min Read",
            "publishDate": "2025-02-17T19:30:14+00:00",
            "content": "Benzinga and Yahoo Finance LLC may earn commission or revenue on some items through the links below.\n\nSenator Cynthia Lummis (R-WY) suggested adding Bitcoin (CRYPTO: BTC) to the U.S. reserves on Sunday, highlighting the transparency and accessibility of the blockchain network\n\nWhat Happened: Lummis posted her proposal in response to concerns shared by Elon Musk, the lead of the Department of Government Efficiency, over auditing of the U.S.’s gold reserves.\n\nThe senator emphasized the ease of auditing Bitcoin reserves, which can be done anytime using a basic computer. “It's time to upgrade our reserves,” the long-standing Bitcoin advocate said.\n\n\n\n\n\nDon't Miss:\n\nMusk’s concerns arose after an X user asked him to inspect Fort Knox, a heavily guarded U.S. Army base that houses about 147 million ounces of gold, according to the U. S. Mint website. Musk curiously asked, “Surely it's reviewed at least every year?\n\nA group of journalists and a congressional delegation were allowed to visit the site in 1974 over rumors the gold was removed from the vaults. The vaults were then opened in 2017 during the last Donald Trump administration, with Treasury Secretary Steve Mnuchin visiting along with a congressional delegation.\n\nTrending: If there was a new fund backed by Jeff Bezos offering a 7-9% target yield with monthly dividends would you invest in it?\n\nWhy It Matters: Lummis’ suggestion comes in the wake of Musk’s support for blockchain technology. The Tesla and SpaceX CEO has been vocal about the potential of blockchain to streamline operations and combat “fraudulent” activities within the U.S. Treasury Department.\n\nMusk has also reportedly considered using a blockchain ledger to track spending, secure data, and make payments to support his federal spending plans at the Department of Government Efficiency, also called DOGE.",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9986566305160522"
        },
        {
            "link": "https://www.reuters.com/world/americas/argentina-main-stock-index-falls-after-milei-crypto-scandal-2025-02-17/",
            "source": "www.reuters.com",
            "title": "Argentina main stock index falls after Milei crypto scandal",
            "summary": "Argentina's benchmark S&P Merval stock index tumbled close to 4% on Monday, after libertarian President Javier Milei touted a cryptocurrency which crashed soon after, in a case the country's fintech chamber said could amount to a \"rug pull.\"",
            "authors": "Reuters",
            "publishDate": "2025-02-17T15:00:37.872000+00:00",
            "content": "Argentina's benchmark S&P Merval <a href=\"https://www.reuters.com/markets/quote/.MERV\" target=\"_blank\">(.MERV)</a> stock index tumbled close to 4% on Monday, after libertarian President Javier Milei touted a cryptocurrency which crashed soon after, in a case the country's fintech chamber said could amount to a \"rug pull.\"\nMilei later deleted his X post recommending the little-known crypto coin $LIBRA and said he had no relation to the cryptocurrency, but opposition lawmakers have said <a href=\"/world/americas/argentinas-opposition-threatens-impeachment-trial-after-milei-touts-crypto-coin-2025-02-16/\">Milei could face an impeachment trial</a> in Congress.\nA judge was assigned to evaluate the legal cases against Milei on Monday.\nAnalysts said the opposition is unlikely to garner the votes to push through an impeachment proceeding but the accusations of fraud and Milei's direct involvement should have an important political impact on his government, which faces mid-term elections later this year and has championed taking a chainsaw to red tape.\nSome investors reacted on social media over the weekend in anger, saying they had been scammed out of their savings by the president of Argentina, while Milei's supporters defended him as the victim of politically-motivated attacks.\n\"Irresponsible promotion of assets puts thousands of people at risk,\" ONG Bitcoin Argentina, a local educational non-profit, said over the weekend. \"We take a stand against this fact and reaffirm the importance of education and transparency.\"\nIn a regular morning conference, Mexican President Claudia Sheinbaum responded to questions on the scandal saying the public would have to see what comes out of the investigations.\n\"It is extremely serious if confirmed, especially in terms of a president's powers to promote something private,\" she said. \"If as a president of a country you propose something for private benefit there is an obvious conflict of interest.\"\nMilei himself came out swinging in face of criticisms.\n\"To the filthy rats of the political caste who want to take advantage of this situation to do harm, I want to say that they confirm every day how vile politicians are, and this increases our conviction to kick them in the ass,\" Milei said in a post on Friday in which he said he had deleted his original post.",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9999535083770752"
        },
        {
            "link": "https://www.yahoo.com/news/feckless-civil-servants-wasting-money-110000491.html",
            "source": "www.yahoo.com",
            "title": "Our feckless civil servants are wasting money on tech fads",
            "summary": "",
            "authors": "",
            "publishDate": "2025-02-17T11:00:00+00:00",
            "content": "In the tale of One Thousand and One Nights, a young woman called Scheherazade is to be executed by the king she is due to marry on the next morning after their wedding.\n\nSo she tells him a story that never ends. Every night the king returns to hear a new tale from her, and every night she leaves him on a cliffhanger.\n\nVery much the same thing happens in the world of perpetual government technology funding, where officials are also enthralled by fantastic yarns. Here too, without fail, new ones appear the very next day – the “next big thing” – and the public purse opens once again.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nRight now, Elon Musk’s Department of Government Efficiency (Doge) team is rampaging through Washington, shining a light on billions of dollars of dubious funding that American taxpayers didn’t know anything about.\n\nThe team has highlighted schemes that stoke the culture wars, terminating contracts for “inclusion onboarding specialists” and “diversity dialogue workshops”.\n\nSo where’s our Doge?\n\nElon Musk’s Department of Government Efficiency is shining a light on billions of dollars of dubious government funding - REUTERS/Benoit Tessier\n\nFor over a year, the independent journalist Charlotte Gill has been exploring academic and arts funding, and sharing the surreal results on social media. Now we have several projects doing that, none of which seem to credit her, which seems rather churlish: move over and let the boys take over, young lady.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nBut look beyond the woke waste and another picture of extravagance emerges. Let me give you some examples.\n\nRemember Mark Zuckerberg’s Metaverse, where we would hold meetings and socialise as silly 3D cartoon avatars of ourselves? Zuckerberg thought this was so important, he even changed Facebook’s name to Meta.\n\nBut no one ever went there, not even Meta staff. Nevertheless, it created a buzz that other businesses jumped on.\n\nFor instance, over half a million pounds of European Union money went to a project called “Training younG researchers On shaping MetaveRse for business and social vAlue”. The taxpayer was even indulging a private chiropractor for curing cartoon backaches – cost: £49,994.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nBefore the Metaverse, funding rained down on anyone who wanted to explore the blockchain, the distributed ledger that is part of the Bitcoin cryptocurrency protocol. This sought to replace battle-hardened databases with a very slow cryptographic version.\n\nSo yet another wheel could be reinvented, slightly squarer than before. Blockchain was wildly fashionable for a while, and the government didn’t want to miss out. UK Research and Innovation, a quango that distributes government funding, alone lists 287 projects.\n\nIn turn, blockchain spawned “smart contracts”. Another lucrative seam opened up with “digital twins”.\n\nFad follows fad in the technology industry, and leaves no trace but a further dent in the national debt.\n\nAdvertisement Advertisement\n\nAdvertisement\n\nAnother trick is to slap a fashionable woke concern on to a passing tech trend, as with a project I found called “Intersectional Approaches to Design and Deployment of Trustworthy Autonomous Systems”.\n\nThen there are the vast avalanches of funding hidden in plain sight. The Ministry of Fun – the Department of Culture, Media and Sport – wasted more than £200m over the years to promote the adoption of 5G to “help spread the benefits of technology across the country and allow the UK to grasp an early advantage by using the new applications 5G networks can enable”.\n\nGreat, but surely this was a task for the telecoms industry itself if thought that 5G was any good. Technology companies already fund a lots of things for marketing and testing anyway. 5G was rather like blockchain in that opened the doors to chancers from a vast range of industries.\n\nIn reality, it never made sense.\n\nAdvertisement Advertisement\n\nVery few open heart surgery operations are conducted in an open field. WiFi and broadband are more reliable, work indoors and already exist on a businesses’ premises, so there was little incentive for an organisation to switch, let alone install a private 5G network on site as well, using equipment that was ten times as expensive as WiFi, and which required a licence from Ofcom.\n\nNevertheless, Sherwood Forest got a “virtual Robin Hood”, and the Digital Catapult staged a lavish 5G Festival (the world’s first “live immersive hybrid concert”) costing £5m.\n\nIt seems remarkable that many Conservatives shun any kind of industrial policy because “we don’t want government picking winners”. But every year they spent vast amounts picking losers: UKRI burns through almost £9bn annually. When it advertised for executive leaders, I noted last year, it wanted candidates from “business, civil society, academia and government.”. But it did not specify science or engineering, or innovators with a proven track record of technical or scientific innovation.\n\nWhat’s going on here? Partly, I think, funding bodies and civil servants just don’t want to say no – they fear being called a Luddite, which is another way of being cancelled.\n\nAdvertisement Advertisement\n\nBut I think the best explanation is sociological: lame tech trends keep being funded because the gravy train simply benefits so many people. Intimacy with the latest big thing adds sparkle and vim to a lacklustre CV, whether you are the giver or the recipient.\n\nIf you were a public sector manager, what would you rather see at the top of your CV: “social services administrator”, or “digital officer”?\n\nLinkedIn is full of such people, zeitgeist surfers who skip from firm to firm. Helping them do so is another welfare payment, really – a very inefficient way of increasing labour market liquidity.\n\nBut they all know what Scheherazade knew, that you must always spin a new tale tomorrow. Surfing the technology bandwagon is just too lucrative, and the taxpayer will foot the bill for every new fad.\n\nBroaden your horizons with award-winning British journalism. Try The Telegraph free for 1 month with unlimited access to our award-winning website, exclusive app, money-saving offers and more.",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9988051652908325"
        },
        {
            "link": "https://finance.yahoo.com/news/u-crypto-task-force-focus-093455444.html",
            "source": "finance.yahoo.com",
            "title": "U.S. Crypto Task Force to Focus on Delivering National Bitcoin Reserve: Bernstein",
            "summary": "",
            "authors": "Will Canny, Mon, Feb, Min Read",
            "publishDate": "2025-02-17T09:34:55+00:00",
            "content": "The U.S. crypto task force will focus on starting up a national bitcoin (BTC) reserve, a move that is likely to spur similar efforts worldwide, broker Bernstein said in a research report Monday.\n\n\"A creation of a U.S. bitcoin reserve could lead to a global race amongst sovereigns to buy bitcoin as one of the reserve assets,\" analysts led by Gautam Chhugani wrote.\n\nThe formation of a strategic reserve poses a number of structural questions, the report said.\n\nWill the U.S. Federal Reserve or the Treasury buy bitcoin? If the Fed, that would require legislative approval, the report noted.\n\nHow would the Fed fund cryptocurrency purchases? Bernstein said it could issue debt or sell some of its gold reserves.\n\nThe U.S. government could add the $20 billion in bitcoin it has seized from criminal enterprises to any national reserve, the report added.\n\nThe broker noted that the Trump administration also announced the creation of a sovereign wealth fund (SWF).\n\nSuch a fund \"would consider key U.S. crypto companies/market leaders, as strategic assets to own,\" Bernstein said. \"Investors should position themselves for the next leg of the bull market across bitcoin and bitcoin linked equities.\"\n\nRead more: Crypto Ecosystem Growth Slowed in January Even as Total Market Cap Rose, JPMorgan Says",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9999912977218628"
        },
        {
            "link": "https://www.reuters.com/technology/hk-comments-leave-door-open-use-cryptocurrencies-proof-wealth-2025-02-17/",
            "source": "www.reuters.com",
            "title": "HK comments leave the door open to use of cryptocurrencies as proof of wealth",
            "summary": "The Hong Kong government has responded for the first time to questions about the use of cryptocurrencies as proof of wealth for an immigration scheme after a local accountant talked publicly about two cases that had accepted the digital assets.",
            "authors": "Summer Zhen",
            "publishDate": "2025-02-17T08:45:08.430000+00:00",
            "content": "The Hong Kong government has responded for the first time to questions about the use of cryptocurrencies as proof of wealth for an immigration scheme after a local accountant talked publicly about two cases that had accepted the digital assets.\nClement Siu, a Hong Kong-based certified public accountant, told media he had handled two cases where bitcoin and ether were used as proof of clients' assets.\nCryptocurriences are not approved assets for direct investment under the immigration scheme, but Siu's cases suggested they can be used as proof of a potential immigrant's wealth, underscoring their growing recognition as a mainstream asset.\nHong Kong's investment promotion department, InvestHK, which handles applications for the New Capital Investment Entrant Scheme (New CIES), said there were \"no specific requirements\" around asset classes when asked if cryptocurrencies were acceptable assets.\nHong Kong relaunched an investment immigration scheme in March 2024 to attract capital. Applicants must show they control assets worth at least HK$30 million ($3.9 million), and then invest that in some approved assets in order to obtain residency.\n\"InvestHK has never said whether crypto assets are acceptable or not, but they encouraged us to give it a try, so we just tried,\" Siu, a deputy managing partner at Global Vision CPA Limited, which issues accountant reports for immigration applicants, told Reuters.\nInvestHK did not comment specifically on the cases Siu highlighted and did not say how many immigration applications had been accepted using cryptocurrencies as proof of wealth.\nHong Kong is competing against regional rivals such as Singapore and Dubai to become the global hub for virtual assets.\n\"Accepting virtual assets as proof of assets shows that virtual assets have the same status as traditional assets in Hong Kong, this is an important step in promoting the mainstreaming of virtual assets,\" said Jupiter Zheng, a partner at HashKey Capital.\nHong Kong's investment immigration scheme is not open to mainland Chinese, but they can circumvent this restriction if they obtain permanent residence in a third country, analysts say. That could raise concerns about potential evasion of China's capital controls.\nSiu said one of his clients who used ether as proof of wealth was a Chinese national holding Guinea-Bissau residency.\nHong Kong government data for June showed that nearly 80% of more than 250 New CIES applicants were from Guinea-Bissau or Vanuatu.\n($1=7.78 Hong Kong dollars)",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9999551773071289"
        },
        {
            "link": "https://finance.yahoo.com/news/hk-comments-leave-door-open-084446447.html",
            "source": "finance.yahoo.com",
            "title": "HK comments leave the door open to use of cryptocurrencies as proof of wealth",
            "summary": "",
            "authors": "Summer Zhen, Mon, Feb, Min Read",
            "publishDate": "2025-02-17T08:44:46+00:00",
            "content": "By Summer Zhen\n\nHONG KONG (Reuters) - The Hong Kong government has responded for the first time to questions about the use of cryptocurrencies as proof of wealth for an immigration scheme after a local accountant talked publicly about two cases that had accepted the digital assets.\n\nClement Siu, a Hong Kong-based certified public accountant, told media he had handled two cases where bitcoin and ether were used as proof of clients' assets.\n\nCryptocurriences are not approved assets for direct investment under the immigration scheme, but Siu's cases suggested they can be used as proof of a potential immigrant's wealth, underscoring their growing recognition as a mainstream asset.\n\nHong Kong's investment promotion department, InvestHK, which handles applications for the New Capital Investment Entrant Scheme (New CIES), said there were \"no specific requirements\" around asset classes when asked if cryptocurrencies were acceptable assets.\n\nHong Kong relaunched an investment immigration scheme in March 2024 to attract capital. Applicants must show they control assets worth at least HK$30 million ($3.9 million), and then invest that in some approved assets in order to obtain residency.\n\n\"InvestHK has never said whether crypto assets are acceptable or not, but they encouraged us to give it a try, so we just tried,\" Siu, a deputy managing partner at Global Vision CPA Limited, which issues accountant reports for immigration applicants, told Reuters.\n\nInvestHK did not comment specifically on the cases Siu highlighted and did not say how many immigration applications had been accepted using cryptocurrencies as proof of wealth.\n\nHong Kong is competing against regional rivals such as Singapore and Dubai to become the global hub for virtual assets.\n\n\"Accepting virtual assets as proof of assets shows that virtual assets have the same status as traditional assets in Hong Kong, this is an important step in promoting the mainstreaming of virtual assets,\" said Jupiter Zheng, a partner at HashKey Capital.\n\nHong Kong's investment immigration scheme is not open to mainland Chinese, but they can circumvent this restriction if they obtain permanent residence in a third country, analysts say. That could raise concerns about potential evasion of China's capital controls.\n\nSiu said one of his clients who used ether as proof of wealth was a Chinese national holding Guinea-Bissau residency.\n\nHong Kong government data for June showed that nearly 80% of more than 250 New CIES applicants were from Guinea-Bissau or Vanuatu.\n\nStory Continues",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9999551773071289"
        },
        {
            "link": "https://finance.yahoo.com/news/trump-trades-dollar-bitcoin-stalling-210600978.html",
            "source": "finance.yahoo.com",
            "title": "‘Trump trades’ like the dollar and bitcoin are stalling, while Chinese stocks are racing ahead",
            "summary": "",
            "authors": "Joseph Adinolfi, Sun, Feb, Min Read",
            "publishDate": "2025-02-16T21:06:00+00:00",
            "content": "The U.S. dollar has weakened, and bitcoin has retreated from its record high. Is the “Trump trade” fizzling out? - MarketWatch photo illustration/Getty Images, iStockphoto\n\nThat didn’t take long.\n\nPresident Donald Trump has been back in the White House for less than a month. Yet many of the most popular “Trump trades” have already seen their momentum wane, while Chinese and European stocks — which had struggled in the aftermath of his electoral victory — are racing ahead.\n\nMost Read from MarketWatch\n\nAfter surging through the first half of January, the U.S. dollar DXY has softened against both developed and emerging-market rivals over the past few weeks, as currency traders come around to the idea that Trump’s threats for universal tariffs might simply be the opening salvo in a negotiation to wring economic and political concessions from other nations.\n\n“It’s definitely a negotiating tactic,” said Brian Mulberry, a portfolio manager at Zacks Investment Management, about Trump’s tariff plans.\n\nIn other instances, the shift could be a sign that the speculative fervor ignited by Trump’s decisive victory has started to cool. Cryptocurrencies, one of the most successful Trump trades, have mostly moved sideways since the inauguration. The price of bitcoin BTCUSD, the pioneering digital currency, has struggled to reclaim $100,000.\n\nAnd popular “meme” tokens, like Trump’s own crypto TRUMPUSD and the infamous fartcoin, have fallen dramatically. On the campaign trail, Trump often spoke about plans to create a strategic bitcoin reserve. But so far, the administration hasn’t announced any plans to follow through.\n\nMany U.S. stocks closely associated with the Trump trade have also struggled. Shares of Geo Group Inc. GEO, a private-prison company expected to benefit from mass deportations, have fallen about 25% since the inauguration. As of Friday, they were trading just shy of $27 a share.\n\nTesla Inc. TSLA, which appeared to benefit from Chief Executive Elon Musk’s close association with Trump, has slumped since the start of 2025, while shares of Trump Media & Technology Group Corp. DJT have also turned lower recently.\n\nBut it isn’t just individual stocks: Broad U.S. stock indexes like the S&P 500 SPX have drifted aimlessly over the past three weeks. The index ultimately finished lower Friday after making a run at a fresh record high.\n\nStory Continues",
            "language": "en",
            "sentiment": "negative",
            "confidence": "0.9975854158401489"
        },
        {
            "link": "https://finance.yahoo.com/news/2-bitcoin-etfs-buy-100-150500924.html",
            "source": "finance.yahoo.com",
            "title": "2 Bitcoin ETFs to Buy With $100 and Hold Forever",
            "summary": "",
            "authors": "Chris Neiger, The Motley Fool, Sun, Feb, Min Read",
            "publishDate": "2025-02-16T15:05:00+00:00",
            "content": "Investing in Bitcoin is a bit risky, considering that real-world uses for the digital token are still limited, and its price can be very volatile. But Bitcoin continues to gain more widespread acceptance among investors, and financial institutions are warming to the cryptocurrency with their launch of spot Bitcoin exchange-traded funds (ETFs) last year.\n\nThese ETFs have made it easy for investors to dip their toes into the sometimes wild world of cryptocurrencies. If you're bullish on Bitcoin's long-term prospects, here are two ETFs that are a great place to put $100.\n\nImage source: Getty Images.\n\n1. iShares Bitcoin Trust\n\nThe iShares Bitcoin Trust (NASDAQ: IBIT) was one of the first Bitcoin ETFs to launch last year, and it has quickly become one of the most popular among investors. After about a year of existence, the ETF has about $56 billion in assets.\n\nThe size of the iShares Bitcoin ETF is notable because it means there's plenty of people buying and selling the ETF shares, allowing for easy liquidity and potentially lower transaction costs. The ETF's backing by BlackRock, a prominent investment company, and Coinbase, a top cryptocurrency exchange for Bitcoin custody, is also noteworthy.\n\nThe Bitcoin fund has become popular among some billionaires, too, with Millennium Management's Israel Englander adding 12.6 million shares of the ETF late last year, bringing his total up to 23.5 million shares.\n\nIt's also fairly inexpensive to own the iShares Bitcoin Trust. The ETF charges an expense ratio of just 0.25%, which means you'll pay $2.50 annually for every $1,000 invested. That's not the lowest fee available for a Bitcoin ETF, but it's competitive.\n\n2. Grayscale Bitcoin Mini Trust ETF\n\nAnother popular option for Bitcoin investors is the Grayscale Bitcoin Mini Trust ETF (NYSEMKT: BTC). If you're wondering why it has \"mini\" in its name, it's because the ETF was spun off from one of Grayscale's larger Bitcoin ETFs, with 10% of its holdings going to the new, smaller ETF.\n\nOne of the most notable things about the Grayscale Bitcoin Mini Trust ETF is that it has one of the lowest fees of Bitcoin ETFs, charging just 0.15%, or $1.50 per $1,000 invested. That's far cheaper than the company's original Grayscale Bitcoin Trust, which has an annual management fee of 1.5%.\n\nCheaper fees are always important for inventors because it means you'll keep more of your returns as the value of your ETF goes up. For example, if you invested $2,000 into the Grayscale Bitcoin Mini Trust ETF and Bitcoin's value increased 10% over the next year, you'd save about $30 in annual fees, compared to owning the original Grayscale Bitcoin Trust.\n\nStory Continues",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9969894289970398"
        },
        {
            "link": "https://finance.yahoo.com/news/strategy-could-eligible-p-500-173000830.html",
            "source": "finance.yahoo.com",
            "title": "Strategy Could Be Eligible for S&P 500 Inclusion in June if Bitcoin Closes Q1 Above $96K",
            "summary": "",
            "authors": "James Van Straten, Sat, Feb, Min Read",
            "publishDate": "2025-02-15T17:30:00+00:00",
            "content": "Disclaimer: The analyst who wrote this piece owns shares of Strategy (MSTR)\n\nStrategy (MSTR) could be on track for potential S&P 500 inclusion by June 20.\n\nCurrently, the company meets all eligibility requirements except one: achieving positive GAAP net income over the trailing 12 months (the most recent four quarters combined). To qualify, Q1 2025 earnings must be high enough to offset losses from the previous three quarters—a goal that could be achieved thanks to the adoption (now mandatory) of the Financial Accounting Standards Board (FASB) digital asset accounting rule.\n\nThe FASB rule change requires companies to recognize bitcoin (BTC) holdings at fair value, meaning price gains will flow through to the bottom line (as would price declines). Prior to this rule, corporate digital asset holders were required to account for holdings at their weakest levels. Strategy, for example, in the fourth quarter of 2024 still valued its bitcoin at less than $16,000 per token, leading to a $1 billion impairment loss even as bitcoin closed the year at about $94,000.\n\nHoly Grail\n\nAccording to an analysis by Richard Hass on X, assuming Strategy holdings don't change between now and March 31, bitcoin must close the first quarter above $96,337 for the company to meet the positive trailing 12-month earnings requirement. “Based on Q4 2024 earnings of -$671 million in net income MSTR requires $1.113B in Q1 2025 earnings to produce positive earnings in the prior four quarters and become eligible for S&P 500,\" he wrote. \"Based on MSTR's current treasury of 478,740 BTC, the required BTC price on March 31 to achieve this is $96,337”.\n\nIf bitcoin prices remain strong and MSTR continues accumulating tokens, S&P 500 inclusion is within reach. Said Benchmark analyst Mark Palmer:\n\n“MSTR’s adoption of the amended FASB guidance strengthens its case for S&P 500 inclusion. Given its outperformance of every current index constituent over four years, exclusion would be surprising.”\n\n“While joining the Nasdaq-100 was significant, the S&P 500 is the holy grail,\" continued Palmer.\" Inclusion would validate its Bitcoin strategy, as all S&P 500 index funds would hold MSTR shares, indirectly exposing investors to Bitcoin.” Disclaimer: Richard Hass's original X post was made before Strategy's latest bitcoin purchase. CoinDesk reached out for updated analysis, including Monday’s acquisition.",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9999274015426636"
        },
        {
            "link": "https://finance.yahoo.com/news/big-u-banks-mull-moves-163023531.html",
            "source": "finance.yahoo.com",
            "title": "Big U.S. banks mull moves into crypto services, The Information reports",
            "summary": "",
            "authors": "Sat, Feb, Min Read",
            "publishDate": "2025-02-15T16:30:23+00:00",
            "content": "https://www.tipranks.com/news/the-fly/big-u-s-banks-mull-moves-into-crypto-services-the-information-reports\n\nSome of the largest U.S. banks are evaluating moves into crypto services for big funds, investors and traders in order to take advantage of loosening regulations under the Trump administration, The Information’s Yueqi Yang reports, citing people familiar with the matter. State Street (STT) expects to unveil digital asset custody next year, while BNY (BK) already has a small custody operation for bitcoin (BTC) and ether (ETH) with plans to expand to more tokens. Additionally, Citi (C) has also been considering adding crypto custody services by developing them itself and partnering with external firms.\n\nMaximize Your Portfolio with Data Driven Insights:\n\nLeverage the power of TipRanks' Smart Score, a data-driven tool to help you uncover top performing stocks and make informed investment decisions.\n\nMonitor your stock picks and compare them to top Wall Street Analysts' recommendations with Your Smart Portfolio\n\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\n\nSee the top stocks recommended by analysts >>\n\nRead More on STT:",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9999891519546509"
        },
        {
            "link": "https://finance.yahoo.com/news/warren-buffett-buy-bitcoin-now-100000683.html",
            "source": "finance.yahoo.com",
            "title": "Would Warren Buffett Buy Bitcoin Right Now and Hold It Forever?",
            "summary": "",
            "authors": "Alex Carchidi, The Motley Fool, Sat, Feb, Min Read",
            "publishDate": "2025-02-15T10:00:00+00:00",
            "content": "Might the Oracle of Omaha, Warren Buffett, ever get on board with investing in an asset like Bitcoin, (CRYPTO: BTC) which -- on the surface -- breaks all of his traditional rules for investing?\n\nIt's more reasonable than it sounds. Here's why.\n\nThis perpetual skeptic is missing the forest for the trees\n\nBuffett's disposition toward Bitcoin over the years, and also toward cryptocurrencies in general, has been one of unrestrained revulsion. He's called it \"rat poison,\" and said that he wouldn't buy all the Bitcoin in the world, even for a rock-bottom price of $25, because \"it isn't going to do anything.\" He sees all crypto investments as being on track for catastrophe, a view his longtime friend and investing partner Charlie Munger seemed to share.\n\nSo he probably won't be buying it right now -- or ever. But if he did, he'd probably opt to hold it forever, much like he prefers to do with most of his investments, seeking to accrue an asset's compounding value over time. Bitcoin is a good asset for holding forever -- and therein lies the reason that Buffett is missing out on a great investment, despite it having a lot of qualities that he usually says he likes.\n\nThanks to Bitcoin's halving schedule, which is the rough timeline for when the difficulty of mining it increases relative to the reward produced, it has a built-in slowing supply growth. There can only be 21 million Bitcoins in existence, ever, as a result of the hard limits encoded into its protocol (about 19.8 million already are in circulation). So, even if there is a constant level of demand for the coin, given the constraint on supply, its price will rise over time.\n\nLet's think about the implications of that a bit more closely to address one of Buffett's key criticisms, which is that he'd need to find someone to sell Bitcoin to at a higher price than the one at which he purchased it.\n\nRemember, Buffett said he wouldn't buy all the Bitcoin in the world for $25. But he'll never get that opportunity.\n\nThere's a legion of Bitcoin fanatics out there who would be backing up the truck to buy it at prices much, much higher than that. One of them is Michael Saylor, the founder and executive chairman of MicroStrategy. His company just purchased $742 million in Bitcoin on Feb. 10, giving it a hoard of coins that's now close to $32 billion.\n\nSaylor isn't the only Bitcoin evangelist willing to make billions in purchases. Nor are all of the coin's boosters as well-funded. The larger point here is that Buffett's concern that there won't be anyone willing to buy the coin if he were to buy it is simply untrue.\n\nStory Continues",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9991408586502075"
        },
        {
            "link": "https://www.reuters.com/world/europe/meet-little-known-far-right-french-politician-with-direct-line-trump-world-2025-02-15/",
            "source": "www.reuters.com",
            "title": "Meet the little-known far-right French politician with a direct line to Trump world",
            "summary": "Marine Le Pen may be the dominant figure of the French far right, but in Trump world, a little-known European Parliament lawmaker called Sarah Knafo is making inroads.",
            "authors": "Elizabeth Pineau",
            "publishDate": "2025-02-15T07:02:47.795000+00:00",
            "content": "Marine Le Pen may be the dominant figure of the French far right, but in Trump world, a little-known European Parliament lawmaker called Sarah Knafo is making inroads.\nKnafo, a crypto-aficionado and supporter of tech billionaire Elon Musk, is one of the leading figures of France's <a href=\"/world/europe/far-right-french-presidential-hopeful-promises-reconquest-rally-2021-12-05/\">Reconquest</a>, a fringe nationalist party with strong anti-Islam views led by former presidential candidate Eric Zemmour.\nKnafo, 31, and Zemmour, 66, were among the few French politicians to bag an invite to U.S. President Donald Trump's January 20 inauguration, snagging seats at the Capital One Arena before attending the Liberty Ball later in the evening.\nNational Rally (RN) party chief Le Pen, whom the president famously stood up during a 2017 visit to Trump Tower, sent a three-person RN delegation, but did not personally attend.\nLe Pen has spent years trying to purge her party of racist and anti-Semitic elements. Her \"de-demonization\" strategy has made her the <a href=\"/world/europe/french-far-right-leader-marine-le-pen-eyes-early-presidential-election-2024-12-18/\">frontrunner to be France's next president</a> in the 2027 election, and she has been cautious about risking those hard-won gains by sidling up to Trump, who is widely disliked by voters in Western Europe.\nKnafo, who is emerging from Zemmour's shadow to be the driving force of Reconquest, has no such qualms.\nShe has spent the last few years grafting herself to the intellectual architecture of Trump 2.0 - a retooled political brand that fuses U.S. nationalism, tech evangelism and anti-establishment fervour - to pitch herself as the movement's natural representative in France.\n\"Reconquest is the only party in France that defends this mix: pro-tech, pro-business, but also the defence of national identity,\" Knafo told Reuters in an interview.\nReconquest is a minnow compared to the slightly less extreme RN, France's largest parliamentary party. Zemmour, a Jew of North African descent who won just 7% of votes in the 2022 presidential vote, has proposed banning the first name Mohammed and carrying out mass deportations to preserve French identity.\nKnafo, who is also of North African Jewish descent, has sought to modernize Reconquest by aligning herself with the new political currents flowing from across the Atlantic.\nShe acknowledged Trump's techno-conservatism is a hard-sell in France, where the welfare state is prized over libertarian disruption, but was betting Trump wouldn't back Le Pen.\n\"The de-demonization aspect is the opposite of what Trump advocates,\" Knafo said. \"He doesn't have much respect for it.\"\nThe White House did not respond to a request for comment.\nLe Pen's wariness of Trump appears to be ebbing.\nShe recently said his pressure on Colombia to receive deported migrants <a href=\"/world/americas/france-should-follow-trumps-colombia-example-dealing-with-deportees-le-pen-says-2025-01-30/\">should be copied by France</a>. Last weekend, she said the RN was \"the best placed in France to speak with the Donald Trump administration,\" adding that <a href=\"/world/europe/french-government-falls-far-right-bardella-enjoys-his-moment-sun-2024-12-05/\">her powerful wingman Jordan Bardella</a> would soon travel to the United States.\nRN spokesman Laurent Jacobelli did not respond to a request for comment.\nLuc Rouban, a Sciences Po political scientist, said the RN is finely attuned to voter concerns in France, and doubted Knafo's Trumpian conceit could succeed electorally.\n\"The United States is not France,\" he said.\n\nTRUMP TIES\nKnafo studied at France's ENA administrative college, an elite finishing school whose alumni include President Emmanuel Macron, before joining Zemmour for his failed presidential bid.\nDuring the 2022 campaign, Zemmour's anti-Islamism <a href=\"/world/europe/trump-offered-encouragement-frances-far-right-candidate-zemmour-call-bfm-tv-2022-02-15/\">attracted the interest of Trump</a>, who was at a low ebb after losing the 2020 election.\n\"'Don't give up,'\" Knafo recalled Trump telling Zemmour <a href=\"/world/europe/trump-offered-encouragement-frances-far-right-candidate-zemmour-call-bfm-tv-2022-02-15/\">in a widely reported 2022 call</a>. \"'Now you're visible, all the media will be against you. They'll say you're too brutal, too radical. Don't listen to them. Don't talk to the media. Talk directly to the people.'\"\nKnafo said she subsequently gravitated to Trump-aligned conservative thinkers, figures like journalist Christopher Caldwell and Michael Anton, who recently became a senior U.S. State Department official.\nCaldwell visited her at the European Parliament last month while Knafo met with Anton at Trump's inauguration, according to posts on her Instagram account.\nAnton and Caldwell, who both declined to comment, are senior fellows at the Claremont Institute, a California think-tank and intellectual cradle for Trumpism with close links to Vice President JD Vance.\nLast year, Knafo spent around two weeks in California as a Claremont fellow with young conservative stars, including Natalie Winters, the co-host of Steve Bannon's popular War Room podcast. Winters didn't respond to requests for comment.\n\nMUSK'S ORBIT\nAfter the fellowship, Knafo returned to Brussels where she delivered a September speech that was picked up by popular accounts on Musk's X.\n\"We will always prefer ... Elon Musk to Ursula von der Leyen, freedom to censorship,\" she declared, in reference to the European Commission president.\nKnafo said her speech caught the eye of Jacob Helberg, a Paris-born tech executive who Trump has nominated to be the State Department's top economist. He invited her to attend a Miami memorial for Hamas' Oct. 7 attack on Israel, where she said she shared a few words with Trump. That led to an invite to the United States for the November 4 election, and then another for Trump's inauguration.\nHelberg's spokeswoman, Marcy Simon, confirmed Helberg had invited Knafo to the U.S. events.\nWhile in the United States for the inauguration, Knafo also met with crypto billionaire Michael Saylor, the co-founder of bitcoin stockpiler Strategy <a href=\"https://www.reuters.com/markets/companies/MSTR.O\" target=\"_blank\">(MSTR.O)</a>, to discuss \"the upcoming French elections,\" according to her social media posts.\nSaylor did not respond to Reuters requests for comment, but reposted Knafo's account of their meeting on X, writing \"France could use more Bitcoin.\"\nKnafo said the links she is building with Trump-world could outlast his four years in office, as then \"JD Vance can be president.\"",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9863874912261963"
        },
        {
            "link": "https://www.reuters.com/business/finance/fund-managers-boost-exposure-bitcoin-etfs-quarterly-us-filings-show-2025-02-15/",
            "source": "www.reuters.com",
            "title": "Fund managers boost exposure to bitcoin ETFs, quarterly US filings show",
            "summary": "Asset managers, ranging from wealth management companies to hedge funds and pension funds, boosted allocations to U.S. exchange-traded funds tied to the price of bitcoin in the fourth quarter of 2024, as the price of the world's largest cryptocurrency soared 47%, according to recent regulatory filings.",
            "authors": "Suzanne McGee",
            "publishDate": "2025-02-15T00:21:28.560000+00:00",
            "content": "Asset managers, ranging from wealth management companies to hedge funds and pension funds, boosted allocations to U.S. exchange-traded funds tied to the price of bitcoin in the fourth quarter of 2024, as the price of the world's largest cryptocurrency soared 47%, according to recent regulatory filings.\nThe State of Wisconsin Investment Board disclosed in its quarterly 13-F filings with the Securities and Exchange Commission that its bitcoin ETF holdings more than doubled in the final three months of last year, to 6 million shares of the iShares Bitcoin Trust ETF <a href=\"https://www.reuters.com/markets/companies/IBIT.O\" target=\"_blank\">(IBIT.O)</a> by December 31. The fund, which was the first fund of its kind to report investing in crypto following the debut of bitcoin ETFs, couldn't immediately be reached for comment.\nOther large investment funds also boosted their holdings in the ETFs, which launched in January 2024.\nTudor Investment Corp, a systematic hedge fund manager, reported its holdings of the iShares ETF -- now the largest of the pack, with more than $55 billion in assets -- climbed to 8 million shares, from 4.4 million shares. The value of those holdings also soared, reflecting bitcoin's jump in value, hitting $426.9 million, up from $159.9 million at the end of September. Tudor didn't immediately respond to a request for comment.\nAn Abu Dhabi sovereign wealth fund, Mubadala Investment Co, reported its first foray into bitcoin ETFs in the fourth quarter, taking a 8.2 million share stake in the iShares ETF that was worth $436.9 million.\nHedge fund Hunting Hill Capital had no exposure to these ETFs as of the end of the third quarter, but by December 31 had re-emerged as a significant investor, with positions valued at about $131 million by the end of the year.\n\"We’ve been actively trading within the broader crypto ETF complex, and the timing of the third-quarter filing may not have aligned with when we bought and sold various ETFs,\" said Adam Guren, founder and chief investment officer of the firm.\nThe ranks of those adding to positions included financial advisory firms whose clients have been eager buyers of bitcoin ETFs. Cetera Advisors and NewEdge Advisers were among firms that boosted holdings in several of the ETFs, including products offered by Fidelity, ARK Investments and Invesco <a href=\"https://www.reuters.com/markets/companies/IVZ.N\" target=\"_blank\">(IVZ.N)</a>.\nOther investors were more selective, the filings showed. Cresset Asset Management boosted its exposure to ETFs carrying lower fees, said Jack Ablin, the firm's chief investment officer.\n\"It's also possible right now to get attractive options pricing for collar strategies, allowing us to protect the downside while giving away less of the upside in exchange, on these bitcoin funds,\" Ablin said.\nThe 13F filings are one of the few ways to get insight into how institutional investors are positioned at the end of every quarter. The positions may not reflect current holdings.",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.8200937509536743"
        },
        {
            "link": "https://finance.yahoo.com/news/fund-managers-boost-exposure-bitcoin-002113778.html",
            "source": "finance.yahoo.com",
            "title": "Fund managers boost exposure to bitcoin ETFs, quarterly US filings show",
            "summary": "",
            "authors": "Suzanne Mcgee, Sat, Feb, Min Read",
            "publishDate": "2025-02-15T00:21:13+00:00",
            "content": "By Suzanne McGee\n\n(Reuters) - Asset managers, ranging from wealth management companies to hedge funds and pension funds, boosted allocations to U.S. exchange-traded funds tied to the price of bitcoin in the fourth quarter of 2024, as the price of the world's largest cryptocurrency soared 47%, according to recent regulatory filings.\n\nThe State of Wisconsin Investment Board disclosed in its quarterly 13-F filings with the Securities and Exchange Commission that its bitcoin ETF holdings more than doubled in the final three months of last year, to 6 million shares of the iShares Bitcoin Trust ETF by December 31. The fund, which was the first fund of its kind to report investing in crypto following the debut of bitcoin ETFs, couldn't immediately be reached for comment.\n\nOther large investment funds also boosted their holdings in the ETFs, which launched in January 2024.\n\nTudor Investment Corp, a systematic hedge fund manager, reported its holdings of the iShares ETF -- now the largest of the pack, with more than $55 billion in assets -- climbed to 8 million shares, from 4.4 million shares. The value of those holdings also soared, reflecting bitcoin's jump in value, hitting $426.9 million, up from $159.9 million at the end of September. Tudor didn't immediately respond to a request for comment.\n\nAn Abu Dhabi sovereign wealth fund, Mubadala Investment Co, reported its first foray into bitcoin ETFs in the fourth quarter, taking a 8.2 million share stake in the iShares ETF that was worth $436.9 million.\n\nHedge fund Hunting Hill Capital had no exposure to these ETFs as of the end of the third quarter, but by December 31 had re-emerged as a significant investor, with positions valued at about $131 million by the end of the year.\n\n\"We’ve been actively trading within the broader crypto ETF complex, and the timing of the third-quarter filing may not have aligned with when we bought and sold various ETFs,\" said Adam Guren, founder and chief investment officer of the firm.\n\nThe ranks of those adding to positions included financial advisory firms whose clients have been eager buyers of bitcoin ETFs. Cetera Advisors and NewEdge Advisers were among firms that boosted holdings in several of the ETFs, including products offered by Fidelity, ARK Investments and Invesco.\n\nOther investors were more selective, the filings showed. Cresset Asset Management boosted its exposure to ETFs carrying lower fees, said Jack Ablin, the firm's chief investment officer.\n\n\"It's also possible right now to get attractive options pricing for collar strategies, allowing us to protect the downside while giving away less of the upside in exchange, on these bitcoin funds,\" Ablin said.\n\nStory Continues",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.8200937509536743"
        },
        {
            "link": "https://www.cnbc.com/2025/02/15/crypto-trump-gop-leadershipo-gang-up-on-fdic-over-debanking-.html",
            "source": "www.cnbc.com",
            "title": "Crypto and Trump gang up on FDIC over debanking: 'Our story is pretty ridiculous'",
            "summary": "After years of struggles with the Biden administration, crypto executives have allies across Washington, and now have a platform to voice their complaints.",
            "authors": "Mackenzie Sigalos",
            "publishDate": "2025-02-15T00:00:00+00:00",
            "content": "A US Postal Service worker outside a Signature Bank branch in the Brooklyn borough of New York, US, on Wednesday, March 15, 2023. Angus Mordant | Bloomberg | Getty Images\n\nAnchorage Digital CEO Nathan McCauley wants everyone to know what happened to his crypto company in 2023 during the Biden administration. \"Our story is pretty ridiculous,\" McCauley told CNBC in an interview after testifying at a Senate hearing, titled, \"Investigating the Real Impacts of Debanking in America,\" earlier this month. \"We had a bank that we had a growing relationship with for a number of years, who basically on a dime, decided to turn off our bank account.\" No explanation. No warning. After two years working with the bank, access was cut off. He didn't name the bank and an Anchorage spokesperson said the company is declining to provide it. McCauley's peers across the crypto industry have shared similar sagas about being locked out of the U.S. financial system, losing access to payroll, checking accounts and payment processing. Industry leaders call it \"Operation Choke Point 2.0,\" an alleged coordinated effort by regulators during the Biden presidency to pressure banks into severing ties with crypto. The 1.0 version, they say, occurred when the Obama administration went after banks that backed gun manufacturers and payday lenders. With the word \"debanking,\" crypto execs and investors have found immediate allies among top Republicans in both houses of Congress and in the White House, who are ready and willing to investigate any potential malfeasance that occurred when Democrats were in charge. President Donald Trump has coopted the agenda for political gain. At the World Economic Forum in Davos, Switzerland, last month, he accused JPMorgan Chase and Bank of America of politically motivated debanking, claiming major financial institutions have shut out conservatives under pressure from regulators. The banks denied the claim and Trump hasn't provided any evidence to back it up. Sen. Rick Scott (R-Fla.) has tied himself closely to Trump and, as chairman of the Senate Banking Committee, used his opening remarks at the hearing on Feb. 5, to echo the president's sentiment. \"It is incredibly alarming and disheartening to hear stories about financial institutions cutting off services to digital asset firms, political figures, and conservative-aligned businesses and individuals,\" Scott said.\n\nNathan McCauley, co-founder and chief executive officer of Anchorage Digital Bank, during a Senate Banking, Housing, and Urban Affairs Committee hearing in Washington, DC, US, on Wednesday, Feb. 5, 2025. Stefani Reynolds | Bloomberg | Getty Images\n\nFor crypto industry leaders like McCauley, Republican leadership in Washington has provided a platform to publicly air their grievances. McCauley, whose company is a federally chartered crypto bank, recounted Anchorage's abrupt loss of banking services in June 2023. He said that while his company has faced numerous challenges, the environment has been even worse for less-established startups. \"You can only imagine what was happening to the smaller entrepreneurs who didn't have the resources to be able to marshal in order to keep their bank accounts open,\" McCauley told CNBC. In his testimony to Scott's committee, McCauley said that after losing access to its banking services, Anchorage had to lay off 20% of its workforce, including 70 U.S. employees. To this day, clients are unable \"to send wire transfers to third parties,\" he said. The high-profile hearings so early in Trump's second administration underscore the sudden influence of the crypto industry, which was instrumental in getting its favored candidates elected across the country in November. Crypto exchange Coinbase was one of the top corporate donors in the 2024 election cycle, giving more than $75 million to a group called Fairshake and its affiliate PACs, including a fresh pledge of $25 million to support the pro-crypto super PAC in the 2026 midterms. Ripple doled out around around $50 million. Coinbase and Ripple were both involved in protracted legal battles with the SEC under former Chairman Gary Gensler.\n\nReturning the favor\n\nTrump is paying them back in a variety of ways. His executive order on crypto promises \"fair and open access\" to financial services. And Trump appointed venture capitalist David Sacks, a longtime ally of Elon Musk, as the White House's first AI and crypto czar. Meanwhile, the SEC has already signaled a rollback of rules that previously kept banks from holding bitcoin on their balance sheets, and the FDIC is under pressure to revise guidelines that made it harder for banks to serve digital asset companies. Coinbase Chief Legal Officer Paul Grewal testified before the House Financial Services Committee on Feb. 6, along with Fred Thiel, CEO of bitcoin miner MARA Holdings . In a hearing titled \"Operation Choke Point 2.0: The Biden Administration's Efforts to Put Crypto in the Crosshairs,\" they described aggressive pressure from U.S. regulators to effectively push banks to cut ties with crypto firms. \"No one wants to see anyone denied basic banking services on the basis of their political views or whether they happen to work in an industry that might be out of favor with the current administration,\" Grewal told CNBC. \"There are concerns across the political aisle and across the Congress that banking services have in the past been weaponized in order to run roughshod over those who may be out of favor.\" The FDIC last week released hundreds of pages of internal records obtained through Freedom of Information Act (FOIA) requests. The documents show that the regulator sent \"pause letters,\" urging banks to rethink their relationships with crypto clients.\n\nwatch now\n\nNic Carter, founder of Castle Island Ventures, has spent months chronicling revelations in the Choke Point investigation. He said the FDIC records show that banks were being pressured to avoid crypto clients even in the absence of clear laws. \"Ultimately, the smoking gun is the communications between the regulators and the banks themselves,\" Carter said As part of its probe, the House committee is investigating claims that bank executives and financial regulators secretly blacklisted crypto firms. Thiel, in his testimony, said that the \"discriminatory banking and financial policies threaten the digital asset ecosystem\" and that \"banks and payment processors are effectively deciding which industries can exist and grow within the U.S. economy.\"\n\nClosure of Silvergate, Signature\n\nAmong the Choke Point incidents that most caught the ire of crypto investors were the forced closures of Silvergate Bank and Signature Bank in 2023, following the meltdown at Sam Bankman Fried's FTX months earlier. Silvergate and Signature were the leading FDIC-insured banks for crypto firms. Silvergate Capital, the bank's parent, acknowledged in its bankruptcy filing last year that there had been a \"rapid contraction\" of it business in early 2023, but said it had \"stabilized\" and was able to \"meet regulatory capital requirements\" and \"had the capability to continue to serve its customers.\" Silivergate attributed its insolvency to \"increased supervisory pressure on Silvergate and other banks focused on servicing crypto-asset businesses.\" Signature Bank was seized by regulators in March 2023. Former Democratic Congressman Barney Frank, a Signature board member, claimed that the FDIC shut it down specifically \"to send a very strong anti-crypto message.\" The FDIC arranged a sale of Signature's assets, excluding $4 billion in crypto-related deposits. Mike Lempres, who was chairman of Silvergate and previously spent two years as Coinbase's legal chief, wrote in an opinion piece in the Wall Street Journal this week that the \"federal government is finally changing course after four years of vilifying cryptocurrencies and using legally dubious policies to force companies to bend to its will.\" While the crypto industry at large is rallying around that message, many in Congress are focused on making the case that banks were targeting conservatives for their political views. Carter said lawmakers are trying to reach a wider audience because \"most regular folks don't care about crypto.\" \"I think this was a political choice made by the folks in Congress and the administration that are going after debanking, was to tack on the conservative stuff as well,\" Carter said. \"So it became an issue with a much broader appeal.\" For Trump, there's more to gain from crypto than just political points. There's potentially lots of money involved. Before he was even back in office, Trump and First Lady Melania Trump had already launched meme coins that instantly added billions of dollars in paper value to the family's net worth, in addition to the tens of millions of dollars the projects earned in trading fees. A week into his term, Trump launched Truth.Fi, a financial arm of Trump Media, promising ETFs, cryptocurrency investments, and \"Patriot Economy\" assets — all custodied with $250 million at Charles Schwab. Musk, meanwhile is at the center of the Trump administration and has his own project underway. He's positioning his social media platform X as an alternative online bank, enabling users to move funds between traditional bank accounts and their digital wallets to make instant peer-to-peer payments. The good vibes are being expressed across the industry. \"it's a brand new day for crypto in America,\" said David Marcus, the former head of crypto at Meta and current CEO of infrastructure startup Lightspark, in an interview with CNBC's \"Squawk Box\" last week. What's happening under Trump, he said, is \"quite a polarity flip of atmosphere and energy for our entire industry.\" WATCH: Lightspark CEO David Marcus on the new era for crypto",
            "language": "en",
            "sentiment": "positive",
            "confidence": "0.822966456413269"
        },
        {
            "link": "https://finance.yahoo.com/news/grayscales-spot-xrp-etf-takes-215028266.html",
            "source": "finance.yahoo.com",
            "title": "Grayscale's Spot XRP ETF Takes a Big Step Toward Approval",
            "summary": "",
            "authors": "Dj Shaw, Fri, Feb, Min Read",
            "publishDate": "2025-02-14T21:50:28+00:00",
            "content": "SEC Begins Review of Grayscale's Spot XRP ETF Proposal\n\nThe Securities and Exchange Commission has officially acknowledged Grayscale's application for what would be the first-ever spot XRP exchange-traded fund, according to a Thursday filing.\n\nThe acknowledgment triggers a 240-day review period, giving the SEC until mid-October to make a final decision on the proposed ETF that would track XRP, currently the third-largest cryptocurrency with a market capitalization of $157.4 billion, according to CoinMarketCap data.\n\nThe SEC's willingness to review the XRP ETF proposal highlights a shift in the agency's stance, as the regulator continues its legal battle with Ripple Labs and amid broader changes in leadership that could signal a more nuanced approach to crypto regulation.\n\nAccording to the filing, the proposed fund would offer traditional investors regulated exposure to XRP through a familiar investment vehicle, with Coinbase Custody Trust Company serving as custodian. The trust structure mirrors Grayscale's existing bitcoin ETF, which launched after the firm successfully converted its bitcoin trust into an ETF last year.\n\nThe filing acknowledgment follows the SEC's recent acceptance of Grayscale's applications for Solana and Litecoin ETFs, furthering the investment firm's expansion of its crypto ETF offerings since debuting its spot bitcoin products, Grayscale's Bitcoin Trust ETF (GBTC) and Bitcoin Mini Trust (BTC), along with Ethereum-focused funds, Grayscale's Ethereum Trust (ETHE) and Ethereum Mini Trust (ETH).\n\nEvolving Crypto ETF Landscape\n\nNYSE initially filed the necessary paperwork for the XRP ETF in late January, followed by similar proposals from several major asset managers including Bitwise, Canary, WisdomTree, and 21Shares through the Cboe Exchange.\n\nThe proposal comes amid strong market activity for XRP, with the token trading at $2.72, up nearly 11% over the past 24 hours with a daily trading volume of $8.5 billion, according to CoinMarketCap data.\n\nThe trust would use the CoinDesk XRP Price Index to track trading across major U.S. crypto exchanges, including Coinbase, Kraken and Crypto.com, according to the filing documents. Currently, XRP has a circulating supply of 57.81 billion tokens out of a maximum supply of 100 billion.\n\nThe wave of spot crypto ETF applications would reshape the investment landscape for digital assets, with the SEC now processing multiple filings for products tied to XRP, Solana, Litecoin, and Dogecoin.\n\n\n\n\n\nPermalink | © Copyright 2025 etf.com. All rights reserved",
            "language": "en",
            "sentiment": "positive",
            "confidence": "0.9649090766906738"
        },
        {
            "link": "https://finance.yahoo.com/news/live/stock-market-today-nasdaq-logs-best-week-of-2025-as-dow-sp-500-notch-third-straight-weekly-gain-210124719.html",
            "source": "finance.yahoo.com",
            "title": "Stock market today: Nasdaq logs best week of 2025 as Dow, S&P 500 notch third-straight weekly gain",
            "summary": "",
            "authors": "Fri, Feb, Min Read, Ines Ferré, Josh Schafer, Jenny Mccall, Karen Friar, Rian Howlett",
            "publishDate": "2025-02-14T21:01:24+00:00",
            "content": "US stocks closed mixed on Friday with the Nasdaq 100 (^NDX) notching a record high close to cap a busy week of tariff hikes, inflation updates, and retail sales data, which fell short of estimates.\n\nThe S&P 500 (^GSPC) dropped slightly while the Nasdaq Composite (^IXIC) rose 0.4% to close out its best week of 2025. Both indexes gained for a third consecutive week. Meanwhile, the Dow Jones Industrial Average (^DJI) fell almost 0.3%, following Thursday's sharp gains.\n\nRetail sales booked their biggest monthly drop in a year, down 0.9% in January — significantly below the 0.2% expected. The report out Friday wrapped up a week of key data, with inflation top of mind after two hot readings dragged on hopes for interest rate cuts.\n\nMarkets took a pause following this week's fast-moving stream of policy shifts from President Donald Trump. These ranged from 25% tariffs on steel and aluminum to Ukraine peace talks with Russia to a review of CHIPS Act terms for projects.\n\n• USD (^GSPC) View Quote Details\n\nBut stocks are still on track for solid weekly wins, having jumped on Thursday as Wall Street welcomed a delay in implementation of reciprocal tariffs. Meanwhile, on Friday, Trump told reporters he would unveil new tariffs against automobiles around April 2.\n\nAmong Friday's big stock movers, Airbnb (ABNB) shares jumped after the travel company beat analyst expectations. GameStop (GME) shares popped amid speculation the games retailer will move into bitcoin. On Friday, Moderna (MRNA) posted a bigger-than-expected earnings loss, sending down shares of the struggling vaccine maker.\n\nLIVE COVERAGE IS OVER\n\n18 updates",
            "language": "en",
            "sentiment": "positive",
            "confidence": "0.9988694787025452"
        },
        {
            "link": "https://finance.yahoo.com/news/elon-musk-wants-u-treasury-200729407.html",
            "source": "finance.yahoo.com",
            "title": "Elon Musk wants the U.S. Treasury to be on a blockchain. That’s a terrible idea—take it from a big proponent of the technology",
            "summary": "",
            "authors": "Nic Puckrin, Fri, Feb, Min Read",
            "publishDate": "2025-02-14T20:07:29+00:00",
            "content": "A month ago, no one could have predicted this. Yet today, we are seriously discussing the U.S. Treasury moving all of its transactions onto a blockchain. As we know, this technology underpins cryptocurrencies like Bitcoin, and the proposal is largely thanks to the increasing involvement of crypto advocate Elon Musk in the U.S. government’s affairs.\n\nA self-proclaimed government cost-cutter, the world’s richest man and newly unelected politician has been focusing his energies on the recently launched Department of Government Efficiency, or DOGE for short. This is named after the eponymous memecoin for which Musk has become a cheerleader. In a nutshell, the new department’s job is to “rip the waste out of [America’s] $6.5 trillion budget,” at least according to Trump’s Commerce department nominee Howard Lutnick. And Musk believes a large proportion of this waste is coming from the misuse of Treasury funds.\n\n“Career Treasury officials are breaking the law every hour of every day by approving payments that are fraudulent or do not match the funding laws passed by Congress,” the Tesla CEO wrote on X, which he owns, earlier this month. “This needs to stop now!”\n\nWhen an X user asked whether the Treasury “should be put on the blockchain so this doesn’t happen,” Musk replied, “Yes!”\n\nHis view is that the transparency and immutability of the blockchain technology—which ensures all transactions are visible for everyone to see for the rest of time—would eradicate this alleged fraud. And, in theory at least, he’s absolutely right. The problem is in the implementation.\n\nA national security risk\n\nIf anyone should support the idea of a U.S. Treasury on the blockchain, it’s me. I’m a huge proponent of this technology. Indeed, I left a very well-paid job at Goldman Sachs in 2015 to enter the blockchain space and haven’t looked back. I truly believe this technology, along with the endless financial opportunities afforded by the cryptocurrency space, can help enhance not only personal wealth, but also the efficiency and transparency of nation states. However, I don’t believe for one second that moving the U.S. Treasury onto the blockchain right now would be anything short of a disaster.\n\nMy first concern is simply security. Blockchain is essentially an immutable ledger of transactions that anyone can see at any time. This means there’s no way to hide any blockchain-based transaction. This makes it very difficult to obfuscate fraudulent activity, but it would also mean that the most sensitive financial information, such as defense spending or foreign exchange operations, of the world’s most powerful nation would be available, at least in some form, for the whole world to see—and talented hackers could connect many dots. This presents an obvious national security risk.\n\nStory Continues",
            "language": "en",
            "sentiment": "neutral",
            "confidence": "0.9305892586708069"
        }
    ]
}